MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHECFC/mcu.h
        struct
        {
            __IOM uint32_t COBS : 1;   /*!< [0..0] Controls swapping in 8-bit units for data output from
                                        *   the CEU.                                                                  */
            __IOM uint32_t COWS : 1;   /*!< [1..1] Controls swapping in 16-bit units for data output from
                                        *   the CEU.                                                                  */
            __IOM uint32_t COLS : 1;   /*!< [2..2] Controls swapping in 32-bit units for data output from
                                        *   the CEU.                                                                  */
            uint32_t           : 1;
            __IOM uint32_t CDS : 1;    /*!< [4..4] Sets the image format when outputting the image data
                                        *   captured in the YCbCr422 format to the memory.                            */
            uint32_t           : 11;
            __IOM uint32_t CBE : 1;    /*!< [16..16] Controls the number of lines of captured data to be
                                        *   written to the memory.                                                    */
            uint32_t : 15;
        } CDOCR_M_b;
    };
    __IM uint32_t RESERVED13[10];

    union
    {
        __IOM uint32_t CDAYR2_M;       /*!< (@ 0x00002090) Capture Data Address Y Register 2                          */

        struct
        {
            __IOM uint32_t CAYR2 : 32; /*!< [31..0] Capture Data Address Y                                            */
        } CDAYR2_M_b;
    };

    union
    {
        __IOM uint32_t CDACR2_M;       /*!< (@ 0x00002094) Capture Data Address C Register 2                          */

        struct
        {
            __IOM uint32_t CACR2 : 32; /*!< [31..0] Capture Data Address C2                                           */
        } CDACR2_M_b;
    };

    union
    {
        __IOM uint32_t CDBYR2_M;       /*!< (@ 0x00002098) Capture Data Bottom-Field Address Y Register
                                        *                  2                                                          */

        struct
        {
            __IOM uint32_t CBYR2 : 32; /*!< [31..0] Set the address for storing the Y component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBYR2_M_b;
    };

    union
    {
        __IOM uint32_t CDBCR2_M;       /*!< (@ 0x0000209C) Capture Data Bottom-Field Address C Register
                                        *                  2                                                          */

        struct
        {
            __IOM uint32_t CBCR2 : 32; /*!< [31..0] Set the address for storing the C component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBCR2_M_b;
    };
} R_CEU_Type;                          /*!< Size = 8352 (0x20a0)                                                      */

/* =========================================================================================================================== */
/* ================                                          R_ULPT0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Ultra-Low Power Timer 0 (R_ULPT0)
 */

typedef struct                           /*!< (@ 0x40220000) R_ULPT0 Structure                                          */
{
    union
    {
        __IOM uint32_t ULPTCNT;          /*!< (@ 0x00000000) ULPT Counter Register                                      */

        struct
        {
            __IOM uint32_t ULPTCNT : 32; /*!< [31..0] 32bit counter and reload registerNOTE : When 1 is written
                                          *   to the TSTOP bit in the ULPTCR register, the 32-bit counter
                                          *   is forcibly stopped and set to FFFFFFFFH.                                 */
        } ULPTCNT_b;
    };

    union
    {
        __IOM uint32_t ULPTCMA;          /*!< (@ 0x00000004) ULPT Compare Match A Register                              */

        struct
        {
            __IOM uint32_t ULPTCMA : 32; /*!< [31..0] ULPT Compare Match A RegisterNOTE : When 1 is written
                                          *   to the TSTOP bit in the ULPTCR register, set to FFFFFFFFH                 */
        } ULPTCMA_b;
    };

    union
    {
        __IOM uint32_t ULPTCMB;          /*!< (@ 0x00000008) ULPT Compare Match B Register                              */

        struct
        {
            __IOM uint32_t ULPTCMB : 32; /*!< [31..0] AGT Compare Match B RegisterNOTE : When 1 is written
                                          *   to the TSTOP bit in the ULPTCR register, set to FFFFFFFFH                 */
        } ULPTCMB_b;
    };

    union
    {
        __IOM uint8_t ULPTCR;          /*!< (@ 0x0000000C) ULPT Control Register                                      */

        struct
        {
            __IOM uint8_t TSTART : 1;  /*!< [0..0] ULPT count start                                                   */
            __IM uint8_t  TCSTF  : 1;  /*!< [1..1] ULPT count status flag                                             */
            __OM uint8_t  TSTOP  : 1;  /*!< [2..2] ULPT count forced stop                                             */
            uint8_t              : 2;
            __IOM uint8_t TUNDF  : 1;  /*!< [5..5] ULPT underflow flag                                                */
            __IOM uint8_t TCMAF  : 1;  /*!< [6..6] ULPT compare match A flag                                          */
            __IOM uint8_t TCMBF  : 1;  /*!< [7..7] ULPT compare match B flag                                          */
        } ULPTCR_b;
    };

    union
    {
        __IOM uint8_t ULPTMR1;         /*!< (@ 0x0000000D) ULPT Mode Register 1                                       */

        struct
        {
            uint8_t              : 1;
            __IOM uint8_t TMOD1  : 1;  /*!< [1..1] ULPT operating mode select                                         */
            uint8_t              : 1;
            __IOM uint8_t TEDGPL : 1;  /*!< [3..3] ULPTEVI edge polarity select                                       */
            uint8_t              : 1;
            __IOM uint8_t TCK1   : 1;  /*!< [5..5] ULPT count source select                                           */
            uint8_t              : 2;
        } ULPTMR1_b;
    };

    union
    {
        __IOM uint8_t ULPTMR2;         /*!< (@ 0x0000000E) ULPT Mode Register 2                                       */

        struct
        {
            __IOM uint8_t CKS : 3;     /*!< [2..0] fsub/LOCO count source clock frequency division ratio
                                        *   select                                                                    */
            uint8_t           : 4;
            __IOM uint8_t LPM : 1;     /*!< [7..7] ULPT Low Power Mode                                                */
        } ULPTMR2_b;
    };

    union
    {
        __IOM uint8_t ULPTMR3;         /*!< (@ 0x0000000F) ULPT Mode Register 3                                       */

        struct
        {
            __IOM uint8_t TCNTCTL : 1; /*!< [0..0] ULPT count function select                                         */
            __IOM uint8_t TEVPOL  : 1; /*!< [1..1] ULPTEVI polarity switch                                            */
            __IOM uint8_t TOPOL   : 1; /*!< [2..2] ULPTO polarity select                                              */
            uint8_t               : 1;
            __IOM uint8_t TEECTL  : 2; /*!< [5..4] ULPTEE function select                                             */
            __IOM uint8_t TEEPOL  : 2; /*!< [7..6] ULPTEE edge polarity select                                        */
        } ULPTMR3_b;
    };

    union
    {
        __IOM uint8_t ULPTIOC;         /*!< (@ 0x00000010) ULPT I/O Control Register                                  */

        struct
        {
            uint8_t              : 2;
            __IOM uint8_t TOE    : 1;  /*!< [2..2] ULPTO output enable                                                */
            uint8_t              : 1;
            __IOM uint8_t TIPF   : 2;  /*!< [5..4] ULPTEVI input filter select                                        */
            __IOM uint8_t TIOGT0 : 1;  /*!< [6..6] ULPTEVI count control                                              */
            uint8_t              : 1;
        } ULPTIOC_b;
    };

    union
    {
        __IOM uint8_t ULPTISR;         /*!< (@ 0x00000011) ULPT Event Pin Select Register                             */

        struct
        {
            uint8_t                : 2;
            __IOM uint8_t RCCPSEL2 : 1; /*!< [2..2] ULPTEE polarty selection                                           */
            uint8_t                : 5;
        } ULPTISR_b;
    };

    union
    {
        __IOM uint8_t ULPTCMSR;        /*!< (@ 0x00000012) ULPT Compare Match Function Select Register                */

        struct
        {
            __IOM uint8_t TCMEA  : 1;  /*!< [0..0] Compare match A register enable                                    */
            __IOM uint8_t TOEA   : 1;  /*!< [1..1] ULPTOA output enable                                               */
            __IOM uint8_t TOPOLA : 1;  /*!< [2..2] ULPTOA polarity select                                             */
            uint8_t              : 1;
            __IOM uint8_t TCMEB  : 1;  /*!< [4..4] Compare match B register enable                                    */
            __IOM uint8_t TOEB   : 1;  /*!< [5..5] ULPTOB output enable                                               */
            __IOM uint8_t TOPOLB : 1;  /*!< [6..6] ULPTOB polarity select                                             */
            uint8_t              : 1;
        } ULPTCMSR_b;
    };
    __IM uint8_t RESERVED;
} R_ULPT0_Type;                        /*!< Size = 20 (0x14)                                                          */

/* =========================================================================================================================== */
/* ================                                        R_DEBUG_OCD                                        ================ */
/* =========================================================================================================================== */

/**
 * @brief On-Chip Debug Function (R_DEBUG_OCD)
 */

typedef struct                         /*!< (@ 0x40011000) R_DEBUG_OCD Structure                                      */
{
    __IM uint32_t RESERVED[192];

    union
    {
        __IM uint32_t FSBLSTATM;       /*!< (@ 0x00000300) First Stage Boot Loader Status Monitor Register            */

        struct
        {
            __IM uint32_t CS : 1;      /*!< [0..0] FSBL completion status.                                            */
            __IM uint32_t RS : 1;      /*!< [1..1] FSBL result status.                                                */
            uint32_t         : 30;
        } FSBLSTATM_b;
    };
} R_DEBUG_OCD_Type;                    /*!< Size = 772 (0x304)                                                        */

/* =========================================================================================================================== */
/* ================                                          R_DOTF                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Decryption On The Fly (R_DOTF)
 */

typedef struct                         /*!< (@ 0x40268800) R_DOTF Structure                                           */
{
    union
    {
        __IOM uint32_t CONVAREAST;     /*!< (@ 0x00000000) DOTF Conversion Area Start Address Register                */

        struct
        {
            uint32_t                  : 12;
            __IOM uint32_t CONVAREAST : 20; /*!< [31..12] First address of decryption processing area                      */
        } CONVAREAST_b;
    };

    union
    {
        __IOM uint32_t CONVAREAD;      /*!< (@ 0x00000004) DOTF Conversion Area End Address Register                  */

        struct
        {
            uint32_t                 : 12;
            __IOM uint32_t CONVAREAD : 20; /*!< [31..12] End address of decryption processing area                        */
        } CONVAREAD_b;
    };
    __IM uint32_t RESERVED[30];

    union
    {
        __IOM uint32_t REG00;          /*!< (@ 0x00000080) Register 0                                                 */

        struct
        {
            uint32_t           : 9;
            __IOM uint32_t B09 : 1;    /*!< [9..9] Bit 09                                                             */
            uint32_t           : 6;
            __IOM uint32_t B16 : 1;    /*!< [16..16] Bit 09                                                           */
            __IOM uint32_t B17 : 1;    /*!< [17..17] Bit 17                                                           */
            uint32_t           : 2;
            __IOM uint32_t B20 : 1;    /*!< [20..20] Bit 20                                                           */
            uint32_t           : 3;
            __IOM uint32_t B24 : 2;    /*!< [25..24] Bit24-25                                                         */
            uint32_t           : 2;
            __IOM uint32_t B28 : 2;    /*!< [29..28] Bit28-29                                                         */
            uint32_t           : 2;
        } REG00_b;
    };
    __IM uint32_t RESERVED1[2];

    union
    {
        __IOM uint32_t REG03;          /*!< (@ 0x0000008C) Register 03                                                */

        struct
        {
            __IOM uint32_t B00 : 32;   /*!< [31..0] Bit 0                                                             */
        } REG03_b;
    };
} R_DOTF_Type;                         /*!< Size = 144 (0x90)                                                         */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Asynchronous General Purpose Timer (R_AGTX0)
 */

typedef struct                          /*!< (@ 0x40221000) R_AGTX0 Structure                                          */
{
    union
    {
        __IOM R_AGTX0_AGT32_Type AGT32; /*!< (@ 0x00000000) AGTW (32-bit) peripheral registers                         */
        __IOM R_AGTX0_AGT16_Type AGT16; /*!< (@ 0x00000000) AGT (16-bit) peripheral registers                          */
    };
} R_AGTX0_Type;                         /*!< Size = 20 (0x14)                                                          */

/* =========================================================================================================================== */
/* ================                                         R_ECCMB0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief CANFD ECC (R_ECCMB0)
 */

typedef struct                          /*!< (@ 0x4036F200) R_ECCMB0 Structure                                         */
{
    union
    {
        __IOM uint32_t EC710CTL;        /*!< (@ 0x00000000) ECC Control Register                                       */

        struct
        {
            __IM uint32_t  ECEMF   : 1; /*!< [0..0] ECC Error Message Flag                                             */
            __IM uint32_t  ECER1F  : 1; /*!< [1..1] ECC Error Detection and Correction Flag                            */
            __IM uint32_t  ECER2F  : 1; /*!< [2..2] 2-bit ECC Error Detection Flag                                     */
            __IOM uint32_t EC1EDIC : 1; /*!< [3..3] ECC 1-bit Error Detection Interrupt Control                        */
            __IOM uint32_t EC2EDIC : 1; /*!< [4..4] ECC 2-bit Error Detection Interrupt Control                        */
            __IOM uint32_t EC1ECP  : 1; /*!< [5..5] ECC 1-bit Error Correction Permission                              */
            __IOM uint32_t ECERVF  : 1; /*!< [6..6] ECC Error Judgment Enable Flag                                     */
            uint32_t               : 2;
            __IOM uint32_t ECER1C  : 1; /*!< [9..9] Accumulating ECC Error Detection and Correction Flag
                                         *   Clear                                                                     */
            __IOM uint32_t ECER2C  : 1; /*!< [10..10] 2-bit ECC Error Detection Flag Clear                             */
            __IM uint32_t  ECOVFF  : 1; /*!< [11..11] ECC Overflow Detection Flag                                      */
            uint32_t               : 2;
            __IOM uint32_t EMCA    : 2; /*!< [15..14] Access Control to ECC Mode Select bit                            */
            __IM uint32_t  ECSEDF0 : 1; /*!< [16..16] ECC Single bit Error Address Detection Flag                      */
            __IM uint32_t  ECDEDF0 : 1; /*!< [17..17] ECC Dual Bit Error Address Detection Flag                        */
            uint32_t               : 14;
        } EC710CTL_b;
    };

    union
    {
        __IOM uint16_t EC710TMC;       /*!< (@ 0x00000004) ECC Test Mode Control Register                             */

        struct
        {
            uint16_t              : 1;
            __IOM uint16_t ECDCS  : 1; /*!< [1..1] ECC Decode Input Select                                            */
            uint16_t              : 5;
            __IOM uint16_t ECTMCE : 1; /*!< [7..7] ECC Test Mode Control Enable                                       */
            uint16_t              : 6;
            __IOM uint16_t ETMA   : 2; /*!< [15..14] ECC Test Mode Bit Access Control                                 */
        } EC710TMC_b;
    };
    __IM uint16_t RESERVED;
    __IM uint32_t RESERVED1;

    union
    {
        __IOM uint32_t EC710TED;       /*!< (@ 0x0000000C) ECC Test Substitute Data Register                          */

        struct
        {
            __IOM uint32_t ECEDB : 32; /*!< [31..0] ECC Test Substitute Data                                          */
        } EC710TED_b;
    };

    union
    {
        __IM uint32_t EC710EAD0;       /*!< (@ 0x00000010) ECC Error Address Register                                 */

        struct
        {
            __IM uint32_t ECEAD : 10;  /*!< [9..0] ECC Error Address                                                  */
            uint32_t            : 22;
        } EC710EAD0_b;
    };
} R_ECCMB0_Type;                       /*!< Size = 20 (0x14)                                                          */

/* =========================================================================================================================== */
/* ================                                          R_FLAD                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Data Flash (R_FLAD)
 */

typedef struct                         /*!< (@ 0x4011C000) R_FLAD Structure                                           */
{
    __IM uint8_t RESERVED[64];

    union
    {
        __IOM uint8_t FCKMHZ;          /*!< (@ 0x00000040) Data Flash Access Frequency Register                       */

        struct
        {
            __IOM uint8_t FCKMHZ : 8;  /*!< [7..0] Data Flash Access Frequency Register                               */
        } FCKMHZ_b;
    };
} R_FLAD_Type;                         /*!< Size = 65 (0x41)                                                          */

/* =========================================================================================================================== */
/* ================                                        R_MIPI_DSI                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief DSI Link (R_MIPI_DSI)
 */

typedef struct                         /*!< (@ 0x40346000) R_MIPI_DSI Structure                                       */
{
    union
    {
        __IM uint32_t ISR;             /*!< (@ 0x00000000) Interrupt Status Register                                  */

        struct
        {
            __IM uint32_t SQ0  : 1;    /*!< [0..0] Sequence Channel-0 Interrupt Flag                                  */
            uint32_t           : 3;
            __IM uint32_t SQ1  : 1;    /*!< [4..4] Sequence Channel-1 Interrupt Flag                                  */
            uint32_t           : 3;
            __IM uint32_t VM   : 1;    /*!< [8..8] Video Mode Interrupt Flag                                          */
            uint32_t           : 3;
            __IM uint32_t RCV  : 1;    /*!< [12..12] Receive Interrupt Flag                                           */
            uint32_t           : 3;
            __IM uint32_t FERR : 1;    /*!< [16..16] Fatal Error Interrupt Flag                                       */
            uint32_t           : 3;
            __IM uint32_t PPI  : 1;    /*!< [20..20] PPI Interrupt Flag                                               */
            uint32_t           : 11;
        } ISR_b;
    };
    __IM uint32_t RESERVED[3];

    union
    {
        __IM uint32_t LINKSR;          /*!< (@ 0x00000010) Link Status Register                                       */

        struct
        {
            __IM uint32_t SQ0RUN : 1;  /*!< [0..0] Sequence Channel-0 Running Flag                                    */
            uint32_t             : 3;
            __IM uint32_t SQ1RUN : 1;  /*!< [4..4] Sequence Channel-1 Running Flag                                    */
            uint32_t             : 3;
            __IM uint32_t VRUN   : 1;  /*!< [8..8] Video Mode Operation Running Flag                                  */
            uint32_t             : 3;
            __IM uint32_t HSBUSY : 1;  /*!< [12..12] HS Operation Busy Flag                                           */
            __IM uint32_t LPBUSY : 1;  /*!< [13..13] LP Operation Busy Flag                                           */
            uint32_t             : 18;
        } LINKSR_b;
    };
    __IM uint32_t RESERVED1[59];

    union
    {
        __IOM uint32_t TXSETR;          /*!< (@ 0x00000100) Transmit Set Register                                      */

        struct
        {
            __IOM uint32_t NUMLANE : 2; /*!< [1..0] Number of Lane                                                     */
            uint32_t               : 6;
            __IOM uint32_t CLEN    : 1; /*!< [8..8] Clock Lane Enable                                                  */
            __IOM uint32_t DLEN    : 1; /*!< [9..9] Data Lane Enable                                                   */
            uint32_t               : 22;
        } TXSETR_b;
    };

    union
    {
        __IOM uint32_t HSCLKSETR;      /*!< (@ 0x00000104) HS Clock Set Register                                      */

