MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHECFC/mcu.h
        struct
        {
            __IOM uint32_t HSCLST : 1; /*!< [0..0] HS Clock Start                                                     */
            __IOM uint32_t HSCLMD : 1; /*!< [1..1] HS Clock Running Mode                                              */
            uint32_t              : 30;
        } HSCLKSETR_b;
    };

    union
    {
        __IOM uint32_t ULPSSETR;       /*!< (@ 0x00000108) ULPS Set Register                                          */

        struct
        {
            __IOM uint32_t WKUP : 8;   /*!< [7..0] ULPS Wakeup Period                                                 */
            uint32_t            : 24;
        } ULPSSETR_b;
    };

    union
    {
        __OM uint32_t ULPSCR;          /*!< (@ 0x0000010C) ULPS Control Register                                      */

        struct
        {
            uint32_t             : 24;
            __OM uint32_t CLENT  : 1;  /*!< [24..24] CL ULPS Enter                                                    */
            __OM uint32_t CLEXIT : 1;  /*!< [25..25] CL ULPS Exit                                                     */
            uint32_t             : 2;
            __OM uint32_t DLENT  : 1;  /*!< [28..28] DL ULPS Enter                                                    */
            __OM uint32_t DLEXIT : 1;  /*!< [29..29] DL ULPS Exit                                                     */
            uint32_t             : 2;
        } ULPSCR_b;
    };

    union
    {
        __IOM uint32_t RSTCR;          /*!< (@ 0x00000110) Reset Control Register                                     */

        struct
        {
            __IOM uint32_t SWRST  : 1; /*!< [0..0] Software Reset                                                     */
            uint32_t              : 15;
            __IOM uint32_t FTXSTP : 1; /*!< [16..16] Force Tx Stop Mode                                               */
            uint32_t              : 15;
        } RSTCR_b;
    };

    union
    {
        __IM uint32_t RSTSR;           /*!< (@ 0x00000114) Reset Status Register                                      */

        struct
        {
            __IM uint32_t RSTHS  : 1;  /*!< [0..0] HS Software Reset Status                                           */
            __IM uint32_t RSTLP  : 1;  /*!< [1..1] LP Software Reset Status                                           */
            __IM uint32_t RSTAPB : 1;  /*!< [2..2] APB Software Reset Status                                          */
            __IM uint32_t RSTAXI : 1;  /*!< [3..3] AXI Software Reset Status                                          */
            __IM uint32_t RSTV   : 1;  /*!< [4..4] Video Software Reset Status                                        */
            uint32_t             : 3;
            __IM uint32_t DL0STP : 1;  /*!< [8..8] Data Lane-0 Stop Status                                            */
            __IM uint32_t DL1STP : 1;  /*!< [9..9] Data Lane-1 Stop Status                                            */
            uint32_t             : 5;
            __IM uint32_t DL0DIR : 1;  /*!< [15..15] Data Lane-0 Direction                                            */
            uint32_t             : 16;
        } RSTSR_b;
    };
    __IM uint32_t RESERVED2[2];

    union
    {
        __IOM uint32_t DSISETR;           /*!< (@ 0x00000120) DSI Set Register                                           */

        struct
        {
            __IOM uint32_t MRPSZ    : 16; /*!< [15..0] Maximum Return Packet Size                                        */
            __IOM uint32_t ECCEN    : 1;  /*!< [16..16] ECC Check Enable                                                 */
            uint32_t                : 3;
            __IOM uint32_t VC0CRCEN : 1;  /*!< [20..20] VC-0 CRC Check Enable                                            */
            __IOM uint32_t VC1CRCEN : 1;  /*!< [21..21] VC-1 CRC Check Enable                                            */
            __IOM uint32_t VC2CRCEN : 1;  /*!< [22..22] VC-2 CRC Check Enable                                            */
            __IOM uint32_t VC3CRCEN : 1;  /*!< [23..23] VC-3 CRC Check Enable                                            */
            uint32_t                : 5;
            __IOM uint32_t SCREN    : 1;  /*!< [29..29] Data Scramble Enable                                             */
            __IOM uint32_t EXTEMD   : 1;  /*!< [30..30] External Tearing Effect Detection Sense Select                   */
            __IOM uint32_t EOTPEN   : 1;  /*!< [31..31] HS Transfer EoTp Enable                                          */
        } DSISETR_b;
    };
    __IM uint32_t RESERVED3[15];

    union
    {
        __IOM uint32_t TXPPD0R;        /*!< (@ 0x00000160) Transmit Packet Payload Data 0 Register                    */

        struct
        {
            __IOM uint32_t DATA0 : 8;  /*!< [7..0] Payload Data 0                                                     */
            __IOM uint32_t DATA1 : 8;  /*!< [15..8] Payload Data 1                                                    */
            __IOM uint32_t DATA2 : 8;  /*!< [23..16] Payload Data 2                                                   */
            __IOM uint32_t DATA3 : 8;  /*!< [31..24] Payload Data 3                                                   */
        } TXPPD0R_b;
    };

    union
    {
        __IOM uint32_t TXPPD1R;        /*!< (@ 0x00000164) Transmit Packet Payload Data 1 Register                    */

        struct
        {
            __IOM uint32_t DATA4 : 8;  /*!< [7..0] Payload Data 4                                                     */
            __IOM uint32_t DATA5 : 8;  /*!< [15..8] Payload Data 5                                                    */
            __IOM uint32_t DATA6 : 8;  /*!< [23..16] Payload Data 6                                                   */
            __IOM uint32_t DATA7 : 8;  /*!< [31..24] Payload Data 7                                                   */
        } TXPPD1R_b;
    };

    union
    {
        __IOM uint32_t TXPPD2R;        /*!< (@ 0x00000168) Transmit Packet Payload Data 2 Register                    */

        struct
        {
            __IOM uint32_t DATA8  : 8; /*!< [7..0] Payload Data 8                                                     */
            __IOM uint32_t DATA9  : 8; /*!< [15..8] Payload Data 9                                                    */
            __IOM uint32_t DATA10 : 8; /*!< [23..16] Payload Data 10                                                  */
            __IOM uint32_t DATA11 : 8; /*!< [31..24] Payload Data 11                                                  */
        } TXPPD2R_b;
    };

    union
    {
        __IOM uint32_t TXPPD3R;        /*!< (@ 0x0000016C) Transmit Packet Payload Data 3 Register                    */

        struct
        {
            __IOM uint32_t DATA12 : 8; /*!< [7..0] Payload Data 12                                                    */
            __IOM uint32_t DATA13 : 8; /*!< [15..8] Payload Data 13                                                   */
            __IOM uint32_t DATA14 : 8; /*!< [23..16] Payload Data 14                                                  */
            __IOM uint32_t DATA15 : 8; /*!< [31..24] Payload Data 15                                                  */
        } TXPPD3R_b;
    };
    __IM uint32_t RESERVED4[36];

    union
    {
        __IM uint32_t RXSR;             /*!< (@ 0x00000200) Receive Status Register                                    */

        struct
        {
            __IM uint32_t BTAREND  : 1; /*!< [0..0] BTA Request End Interrupt Flag                                     */
            __IM uint32_t LRXHTO   : 1; /*!< [1..1] LP-RX Host Processor Timeout Interrupt Flag                        */
            __IM uint32_t TATO     : 1; /*!< [2..2] Turnaround Acknowledge Timeout Interrupt Flag                      */
            uint32_t               : 5;
            __IM uint32_t RXRESP   : 1; /*!< [8..8] Response Packet Receive Interrupt Flag                             */
            uint32_t               : 1;
            __IM uint32_t RXEOTP   : 1; /*!< [10..10] EoTp Receive Interrupt Flag                                      */
            uint32_t               : 2;
            __IM uint32_t RXTE     : 1; /*!< [13..13] Tearing Effect Trigger Receive Interrupt Flag                    */
            __IM uint32_t RXACK    : 1; /*!< [14..14] ACK Trigger Receive Interrupt Flag                               */
            __IM uint32_t EXTEDET  : 1; /*!< [15..15] External Tearing Effect Detect Interrupt Flag                    */
            __IM uint32_t MLFERR   : 1; /*!< [16..16] Malform Error Interrupt Flag                                     */
            __IM uint32_t ECCERRM  : 1; /*!< [17..17] Multi Bit ECC Error Interrupt Flag                               */
            __IM uint32_t UNEXERR  : 1; /*!< [18..18] Unexpected Packet Error Interrupt Flag                           */
            uint32_t               : 1;
            __IM uint32_t WCERR    : 1; /*!< [20..20] Word Count Error Interrupt Flag                                  */
            __IM uint32_t CRCERR   : 1; /*!< [21..21] CRC Error Interrupt Flag                                         */
            __IM uint32_t IBERR    : 1; /*!< [22..22] Internal Bus Error Interrupt Flag                                */
            __IM uint32_t RXOVFERR : 1; /*!< [23..23] Receive Buffer Overflow Error Interrupt Flag                     */
            __IM uint32_t PRTOERR  : 1; /*!< [24..24] Peripheral Response Timeout Error Interrupt Flag                 */
            __IM uint32_t NORESERR : 1; /*!< [25..25] No Response Error Interrupt Flag                                 */
            __IM uint32_t RSIZEERR : 1; /*!< [26..26] Return Packet Size Error Interrupt Flag                          */
            uint32_t               : 1;
            __IM uint32_t ECCERRS  : 1; /*!< [28..28] Single Bit ECC Error Interrupt Flag                              */
            uint32_t               : 1;
            __IM uint32_t RXAKE    : 1; /*!< [30..30] Acknowledge and Error Report Receive Interrupt Flag              */
            uint32_t               : 1;
        } RXSR_b;
    };

    union
    {
        __IOM uint32_t RXSCR;            /*!< (@ 0x00000204) Receive Status Clear Register                              */

        struct
        {
            __IOM uint32_t BTAREND  : 1; /*!< [0..0] BTA Request End Interrupt Flag Clear                               */
            __IOM uint32_t LRXHTO   : 1; /*!< [1..1] LP-RX Host Processor Timeout Interrupt Flag Clear                  */
            __IOM uint32_t TATO     : 1; /*!< [2..2] Turnaround Acknowledge Timeout Interrupt Flag Clear                */
            uint32_t                : 5;
            __IOM uint32_t RXRESP   : 1; /*!< [8..8] Response Packet Receive Interrupt Flag Clear                       */
            uint32_t                : 1;
            __IOM uint32_t RXEOTP   : 1; /*!< [10..10] EoTp Receive Interrupt Flag Clear                                */
            uint32_t                : 2;
            __IOM uint32_t RXTE     : 1; /*!< [13..13] Tearing Effect Trigger Receive Interrupt Flag Clear              */
            __IOM uint32_t RXACK    : 1; /*!< [14..14] ACK Trigger Receive Interrupt Flag Clear                         */
            __IOM uint32_t EXTEDET  : 1; /*!< [15..15] External Tearing Effect Detect Interrupt Flag Clear              */
            __IOM uint32_t MLFERR   : 1; /*!< [16..16] Malform Error Interrupt Flag Clear                               */
            __IOM uint32_t ECCERRM  : 1; /*!< [17..17] Multi Bit ECC Error Interrupt Flag Clear                         */
            __IOM uint32_t UNEXERR  : 1; /*!< [18..18] Unexpected Packet Error Interrupt Flag Clear                     */
            uint32_t                : 1;
            __IOM uint32_t WCERR    : 1; /*!< [20..20] Word Count Error Interrupt Flag Clear                            */
            __IOM uint32_t CRCERR   : 1; /*!< [21..21] CRC Error Interrupt Flag Clear                                   */
            __IOM uint32_t IBERR    : 1; /*!< [22..22] Internal Bus Error Interrupt Flag Clear                          */
            __IOM uint32_t RXOVFERR : 1; /*!< [23..23] Receive Buffer Overflow Error Interrupt Flag Clear               */
            __IOM uint32_t PRTOERR  : 1; /*!< [24..24] Peripheral Response Timeout Error Interrupt Flag Clear           */
            __IOM uint32_t NORESERR : 1; /*!< [25..25] No Response Error Interrupt Flag Clear                           */
            __IOM uint32_t RSIZEERR : 1; /*!< [26..26] Return Packet Size Error Interrupt Flag Clear                    */
            uint32_t                : 1;
            __IOM uint32_t ECCERRS  : 1; /*!< [28..28] Single Bit ECC Error Interrupt Flag Clear                        */
            uint32_t                : 1;
            __IOM uint32_t RXAKE    : 1; /*!< [30..30] Acknowledge and Error Report Receive Interrupt Flag
                                          *   Clear                                                                     */
            uint32_t : 1;
        } RXSCR_b;
    };

    union
    {
        __IOM uint32_t RXIER;            /*!< (@ 0x00000208) Receive Interrupt Enable Register                          */

        struct
        {
            __IOM uint32_t BTAREND  : 1; /*!< [0..0] BTA Request End Interrupt Enable                                   */
            __IOM uint32_t LRXHTO   : 1; /*!< [1..1] LP-RX Host Processor Timeout Interrupt Enable                      */
            __IOM uint32_t TATO     : 1; /*!< [2..2] Turnaround Acknowledge Timeout Interrupt Enable                    */
            uint32_t                : 5;
            __IOM uint32_t RXRESP   : 1; /*!< [8..8] Response Packet Receive Interrupt Enable                           */
            uint32_t                : 1;
            __IOM uint32_t RXEOTP   : 1; /*!< [10..10] EoTp Receive Interrupt Enable                                    */
            uint32_t                : 2;
            __IOM uint32_t RXTE     : 1; /*!< [13..13] Tearing Effect Trigger Receive Interrupt Enable                  */
            __IOM uint32_t RXACK    : 1; /*!< [14..14] ACK Trigger Receive Interrupt Enable                             */
            __IOM uint32_t EXTEDET  : 1; /*!< [15..15] External Tearing Effect Detect Interrupt Enable                  */
            __IOM uint32_t MLFERR   : 1; /*!< [16..16] Malform Error Interrupt Enable                                   */
            __IOM uint32_t ECCERRM  : 1; /*!< [17..17] Multi Bit ECC Error Interrupt Enable                             */
            __IOM uint32_t UNEXERR  : 1; /*!< [18..18] Unexpected Packet Error Interrupt Enable                         */
            uint32_t                : 1;
            __IOM uint32_t WCERR    : 1; /*!< [20..20] Word Count Error Interrupt Enable                                */
            __IOM uint32_t CRCERR   : 1; /*!< [21..21] CRC Error Interrupt Enable                                       */
            __IOM uint32_t IBERR    : 1; /*!< [22..22] Internal Bus Error Interrupt Enable                              */
            __IOM uint32_t RXOVFERR : 1; /*!< [23..23] Receive Buffer Overflow Error Interrupt Enable                   */
            __IOM uint32_t PRTOERR  : 1; /*!< [24..24] Peripheral Response Timeout Error Interrupt Enable               */
            __IOM uint32_t NORESERR : 1; /*!< [25..25] No Response Error Interrupt Enable                               */
            __IOM uint32_t RSIZEERR : 1; /*!< [26..26] Return Packet Size Error Interrupt Enable                        */
            uint32_t                : 1;
            __IOM uint32_t ECCERRS  : 1; /*!< [28..28] Single Bit ECC Error Interrupt Enable                            */
            uint32_t                : 1;
            __IOM uint32_t RXAKE    : 1; /*!< [30..30] Acknowledge and Error Report Receive Interrupt Enable            */
            uint32_t                : 1;
        } RXIER_b;
    };
    __IM uint32_t RESERVED5;

    union
    {
        __IOM uint32_t PRESPTOBTASETR;  /*!< (@ 0x00000210) Peripheral Response Timeout BTA Set Register               */

        struct
        {
            __IOM uint32_t PRTBTA : 32; /*!< [31..0] Peripheral Response Timeout Count                                 */
        } PRESPTOBTASETR_b;
    };

    union
    {
        __IOM uint32_t PRESPTOLPSETR;  /*!< (@ 0x00000214) Peripheral Response Timeout LP Set Register                */

        struct
        {
            __IOM uint32_t LPWTO : 16; /*!< [15..0] LPDT WRITE Request Timeout                                        */
            __IOM uint32_t LPRTO : 16; /*!< [31..16] LPDT READ Request Timeout                                        */
        } PRESPTOLPSETR_b;
    };

    union
    {
        __IOM uint32_t PRESPTOHSSETR;  /*!< (@ 0x00000218) Peripheral Response Timeout HS Set Register                */

        struct
        {
            __IOM uint32_t HSWTO : 16; /*!< [15..0] HS WRITE Request Timeout                                          */
            __IOM uint32_t HSRTO : 16; /*!< [31..16] HS READ Request Timeout                                          */
        } PRESPTOHSSETR_b;
    };
    __IM uint32_t RESERVED6;

    union
    {
        __IM uint32_t AKEPLATIR;       /*!< (@ 0x00000220) Acknowledge and Error Report Packet Parameter
                                        *                  Latest Info Register                                       */

        struct
        {
            __IM uint32_t EREP : 16;   /*!< [15..0] Error Report                                                      */
            __IM uint32_t VC   : 4;    /*!< [19..16] Virtual Channel ID                                               */
            uint32_t           : 12;
        } AKEPLATIR_b;
    };

    union
    {
        __IM uint32_t AKEPACMSR;       /*!< (@ 0x00000224) Acknowledge and Error Report Packet Parameter
                                        *                  Accumulate Status Register                                 */

        struct
        {
            __IM uint32_t AEREP : 16;  /*!< [15..0] Accumulated Error Report                                          */
            __IM uint32_t AVC   : 4;   /*!< [19..16] Virtual Channel ID                                               */
            uint32_t            : 12;
        } AKEPACMSR_b;
    };

    union
    {
        __IOM uint32_t AKEPSCR;        /*!< (@ 0x00000228) Acknowledge and Error Report Packet Parameter
                                        *                  Status Clear Register                                      */

        struct
        {
            __IOM uint32_t AEREP : 16; /*!< [15..0] Accumulated Error Report Clear                                    */
            __IM uint32_t  AVC   : 4;  /*!< [19..16] Virtual Channel ID                                               */
            uint32_t             : 12;
        } AKEPSCR_b;
    };
    __IM uint32_t RESERVED7;

    union
    {
        __IM uint32_t RXRSSR;          /*!< (@ 0x00000230) Receive Result Saved Status Register                       */

        struct
        {
            __IM uint32_t SLT0VLD : 1; /*!< [0..0] Slot-0 Valid Flag                                                  */
            __IM uint32_t SLT1VLD : 1; /*!< [1..1] Slot-1 Valid Flag                                                  */
            __IM uint32_t SLT2VLD : 1; /*!< [2..2] Slot-2 Valid Flag                                                  */
            __IM uint32_t SLT3VLD : 1; /*!< [3..3] Slot-3 Valid Flag                                                  */
            uint32_t              : 28;
        } RXRSSR_b;
    };

    union
    {
        __IOM uint32_t RXRSSCR;         /*!< (@ 0x00000234) Receive Result Saved Status Clear Register                 */

        struct
        {
            __IOM uint32_t SLT0VLD : 1; /*!< [0..0] Slot-0 Valid Flag Clear                                            */
            __IOM uint32_t SLT1VLD : 1; /*!< [1..1] Slot-1 Valid Flag Clear                                            */
            __IOM uint32_t SLT2VLD : 1; /*!< [2..2] Slot-2 Valid Flag Clear                                            */
            __IOM uint32_t SLT3VLD : 1; /*!< [3..3] Slot-3 Valid Flag Clear                                            */
            uint32_t               : 28;
        } RXRSSCR_b;
    };

    union
    {
        __IM uint32_t RXRINFOOWSR;     /*!< (@ 0x00000238) Receive Result Info Overwrite Status Register              */

        struct
        {
            __IM uint32_t SL0OW : 1;   /*!< [0..0] Slot-0 Information Overwrite Flag                                  */
            __IM uint32_t SL1OW : 1;   /*!< [1..1] Slot-1 Information Overwrite Flag                                  */
            __IM uint32_t SL2OW : 1;   /*!< [2..2] Slot-2 Information Overwrite Flag                                  */
            __IM uint32_t SL3OW : 1;   /*!< [3..3] Slot-3 Information Overwrite Flag                                  */
            uint32_t            : 28;
        } RXRINFOOWSR_b;
    };

    union
    {
        __IOM uint32_t RXRINFOOWSCR;   /*!< (@ 0x0000023C) Receive Result Info Overwrite Status Clear Register        */

        struct
        {
            __IOM uint32_t SL0OW : 1;  /*!< [0..0] Slot-0 Information Overwrite Flag Clear                            */
            __IOM uint32_t SL1OW : 1;  /*!< [1..1] Slot-1 Information Overwrite Flag Clear                            */
            __IOM uint32_t SL2OW : 1;  /*!< [2..2] Slot-2 Information Overwrite Flag Clear                            */
            __IOM uint32_t SL3OW : 1;  /*!< [3..3] Slot-3 Information Overwrite Flag Clear                            */
            uint32_t             : 28;
        } RXRINFOOWSCR_b;
    };

    union
    {
        union
        {
            __IM uint32_t RXRSS0R;         /*!< (@ 0x00000240) Receive Result Save Slot-0 Register                        */

            struct
            {
                __IM uint32_t DATA0   : 8; /*!< [7..0] Data 0                                                             */
                __IM uint32_t DATA1   : 8; /*!< [15..8] Data 1                                                            */
                __IM uint32_t DT      : 6; /*!< [21..16] Data Type                                                        */
                __IM uint32_t VC      : 2; /*!< [23..22] Virtual Channel                                                  */
                __IM uint32_t FMT     : 1; /*!< [24..24] Packet Format                                                    */
                __IM uint32_t RXSUC   : 1; /*!< [25..25] Receive Success                                                  */
                __IM uint32_t RXFERR  : 1; /*!< [26..26] Fatal Error                                                      */
                __IM uint32_t RXFAIL  : 1; /*!< [27..27] Receive Fail                                                     */
                __IM uint32_t RXPFAIL : 1; /*!< [28..28] Receive Packet Data Fail                                         */
                __IM uint32_t RXCERR  : 1; /*!< [29..29] Receive Correctable Error                                        */
                __IM uint32_t RXAKE   : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet                      */
                __IM uint32_t INFOOW  : 1; /*!< [31..31] Information Overwrite                                            */
            } RXRSS0R_b;
        };

