MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHECFC/mcu.h
        struct
        {
            union
            {
                union
                {
                    __IM uint16_t RXRSS0R_L;     /*!< (@ 0x00000240) Receive Result Save Slot-0 Register                        */

                    struct
                    {
                        __IM uint16_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        __IM uint16_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                    } RXRSS0R_L_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS0R_LL;    /*!< (@ 0x00000240) Receive Result Save Slot-0 Register                        */

                        struct
                        {
                            __IM uint8_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        } RXRSS0R_LL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS0R_LH;    /*!< (@ 0x00000241) Receive Result Save Slot-0 Register                        */

                        struct
                        {
                            __IM uint8_t DATA1 : 8; /*!< [7..0] Data 1                                                             */
                        } RXRSS0R_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IM uint16_t RXRSS0R_H;       /*!< (@ 0x00000242) Receive Result Save Slot-0 Register                        */

                    struct
                    {
                        __IM uint16_t DT      : 6; /*!< [5..0] Data Type                                                          */
                        __IM uint16_t VC      : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IM uint16_t FMT     : 1; /*!< [8..8] Packet Format                                                      */
                        __IM uint16_t RXSUC   : 1; /*!< [9..9] Receive Success                                                    */
                        __IM uint16_t RXFERR  : 1; /*!< [10..10] Fatal Error                                                      */
                        __IM uint16_t RXFAIL  : 1; /*!< [11..11] Receive Fail                                                     */
                        __IM uint16_t RXPFAIL : 1; /*!< [12..12] Receive Packet Data Fail                                         */
                        __IM uint16_t RXCERR  : 1; /*!< [13..13] Receive Correctable Error                                        */
                        __IM uint16_t RXAKE   : 1; /*!< [14..14] Receive Acknowledge and Error Report Packet                      */
                        __IM uint16_t INFOOW  : 1; /*!< [15..15] Information Overwrite                                            */
                    } RXRSS0R_H_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS0R_HL; /*!< (@ 0x00000242) Receive Result Save Slot-0 Register                        */

                        struct
                        {
                            __IM uint8_t DT : 6; /*!< [5..0] Data Type                                                          */
                            __IM uint8_t VC : 2; /*!< [7..6] Virtual Channel                                                    */
                        } RXRSS0R_HL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS0R_HH;      /*!< (@ 0x00000243) Receive Result Save Slot-0 Register                        */

                        struct
                        {
                            __IM uint8_t FMT     : 1; /*!< [0..0] Packet Format                                                      */
                            __IM uint8_t RXSUC   : 1; /*!< [1..1] Receive Success                                                    */
                            __IM uint8_t RXFERR  : 1; /*!< [2..2] Fatal Error                                                        */
                            __IM uint8_t RXFAIL  : 1; /*!< [3..3] Receive Fail                                                       */
                            __IM uint8_t RXPFAIL : 1; /*!< [4..4] Receive Packet Data Fail                                           */
                            __IM uint8_t RXCERR  : 1; /*!< [5..5] Receive Correctable Error                                          */
                            __IM uint8_t RXAKE   : 1; /*!< [6..6] Receive Acknowledge and Error Report Packet                        */
                            __IM uint8_t INFOOW  : 1; /*!< [7..7] Information Overwrite                                              */
                        } RXRSS0R_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IM uint32_t RXRSS1R;         /*!< (@ 0x00000244) Receive Result Save Slot-1 Register                        */

            struct
            {
                __IM uint32_t DATA0   : 8; /*!< [7..0] Data 0                                                             */
                __IM uint32_t DATA1   : 8; /*!< [15..8] Data 1                                                            */
                __IM uint32_t DT      : 6; /*!< [21..16] Data Type                                                        */
                __IM uint32_t VC      : 2; /*!< [23..22] Virtual Channel                                                  */
                __IM uint32_t FMT     : 1; /*!< [24..24] Packet Format                                                    */
                __IM uint32_t RXSUC   : 1; /*!< [25..25] Receive Success                                                  */
                __IM uint32_t RXFERR  : 1; /*!< [26..26] Fatal Error                                                      */
                __IM uint32_t RXFAIL  : 1; /*!< [27..27] Receive Fail                                                     */
                __IM uint32_t RXPFAIL : 1; /*!< [28..28] Receive Packet Data Fail                                         */
                __IM uint32_t RXCERR  : 1; /*!< [29..29] Receive Correctable Error                                        */
                __IM uint32_t RXAKE   : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet                      */
                __IM uint32_t INFOOW  : 1; /*!< [31..31] Information Overwrite                                            */
            } RXRSS1R_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IM uint16_t RXRSS1R_L;     /*!< (@ 0x00000244) Receive Result Save Slot-1 Register                        */

                    struct
                    {
                        __IM uint16_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        __IM uint16_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                    } RXRSS1R_L_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS1R_LL;    /*!< (@ 0x00000244) Receive Result Save Slot-1 Register                        */

                        struct
                        {
                            __IM uint8_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        } RXRSS1R_LL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS1R_LH;    /*!< (@ 0x00000245) Receive Result Save Slot-1 Register                        */

                        struct
                        {
                            __IM uint8_t DATA1 : 8; /*!< [7..0] Data 1                                                             */
                        } RXRSS1R_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IM uint16_t RXRSS1R_H;       /*!< (@ 0x00000246) Receive Result Save Slot-1 Register                        */

                    struct
                    {
                        __IM uint16_t DT      : 6; /*!< [5..0] Data Type                                                          */
                        __IM uint16_t VC      : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IM uint16_t FMT     : 1; /*!< [8..8] Packet Format                                                      */
                        __IM uint16_t RXSUC   : 1; /*!< [9..9] Receive Success                                                    */
                        __IM uint16_t RXFERR  : 1; /*!< [10..10] Fatal Error                                                      */
                        __IM uint16_t RXFAIL  : 1; /*!< [11..11] Receive Fail                                                     */
                        __IM uint16_t RXPFAIL : 1; /*!< [12..12] Receive Packet Data Fail                                         */
                        __IM uint16_t RXCERR  : 1; /*!< [13..13] Receive Correctable Error                                        */
                        __IM uint16_t RXAKE   : 1; /*!< [14..14] Receive Acknowledge and Error Report Packet                      */
                        __IM uint16_t INFOOW  : 1; /*!< [15..15] Information Overwrite                                            */
                    } RXRSS1R_H_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS1R_HL; /*!< (@ 0x00000246) Receive Result Save Slot-1 Register                        */

                        struct
                        {
                            __IM uint8_t DT : 6; /*!< [5..0] Data Type                                                          */
                            __IM uint8_t VC : 2; /*!< [7..6] Virtual Channel                                                    */
                        } RXRSS1R_HL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS1R_HH;      /*!< (@ 0x00000247) Receive Result Save Slot-1 Register                        */

                        struct
                        {
                            __IM uint8_t FMT     : 1; /*!< [0..0] Packet Format                                                      */
                            __IM uint8_t RXSUC   : 1; /*!< [1..1] Receive Success                                                    */
                            __IM uint8_t RXFERR  : 1; /*!< [2..2] Fatal Error                                                        */
                            __IM uint8_t RXFAIL  : 1; /*!< [3..3] Receive Fail                                                       */
                            __IM uint8_t RXPFAIL : 1; /*!< [4..4] Receive Packet Data Fail                                           */
                            __IM uint8_t RXCERR  : 1; /*!< [5..5] Receive Correctable Error                                          */
                            __IM uint8_t RXAKE   : 1; /*!< [6..6] Receive Acknowledge and Error Report Packet                        */
                            __IM uint8_t INFOOW  : 1; /*!< [7..7] Information Overwrite                                              */
                        } RXRSS1R_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IM uint32_t RXRSS2R;         /*!< (@ 0x00000248) Receive Result Save Slot-2 Register                        */

            struct
            {
                __IM uint32_t DATA0   : 8; /*!< [7..0] Data 0                                                             */
                __IM uint32_t DATA1   : 8; /*!< [15..8] Data 1                                                            */
                __IM uint32_t DT      : 6; /*!< [21..16] Data Type                                                        */
                __IM uint32_t VC      : 2; /*!< [23..22] Virtual Channel                                                  */
                __IM uint32_t FMT     : 1; /*!< [24..24] Packet Format                                                    */
                __IM uint32_t RXSUC   : 1; /*!< [25..25] Receive Success                                                  */
                __IM uint32_t RXFERR  : 1; /*!< [26..26] Fatal Error                                                      */
                __IM uint32_t RXFAIL  : 1; /*!< [27..27] Receive Fail                                                     */
                __IM uint32_t RXPFAIL : 1; /*!< [28..28] Receive Packet Data Fail                                         */
                __IM uint32_t RXCERR  : 1; /*!< [29..29] Receive Correctable Error                                        */
                __IM uint32_t RXAKE   : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet                      */
                __IM uint32_t INFOOW  : 1; /*!< [31..31] Information Overwrite                                            */
            } RXRSS2R_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IM uint16_t RXRSS2R_L;     /*!< (@ 0x00000248) Receive Result Save Slot-2 Register                        */

                    struct
                    {
                        __IM uint16_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        __IM uint16_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                    } RXRSS2R_L_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS2R_LL;    /*!< (@ 0x00000248) Receive Result Save Slot-2 Register                        */

                        struct
                        {
                            __IM uint8_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        } RXRSS2R_LL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS2R_LH;    /*!< (@ 0x00000249) Receive Result Save Slot-2 Register                        */

                        struct
                        {
                            __IM uint8_t DATA1 : 8; /*!< [7..0] Data 1                                                             */
                        } RXRSS2R_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IM uint16_t RXRSS2R_H;       /*!< (@ 0x0000024A) Receive Result Save Slot-2 Register                        */

                    struct
                    {
                        __IM uint16_t DT      : 6; /*!< [5..0] Data Type                                                          */
                        __IM uint16_t VC      : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IM uint16_t FMT     : 1; /*!< [8..8] Packet Format                                                      */
                        __IM uint16_t RXSUC   : 1; /*!< [9..9] Receive Success                                                    */
                        __IM uint16_t RXFERR  : 1; /*!< [10..10] Fatal Error                                                      */
                        __IM uint16_t RXFAIL  : 1; /*!< [11..11] Receive Fail                                                     */
                        __IM uint16_t RXPFAIL : 1; /*!< [12..12] Receive Packet Data Fail                                         */
                        __IM uint16_t RXCERR  : 1; /*!< [13..13] Receive Correctable Error                                        */
                        __IM uint16_t RXAKE   : 1; /*!< [14..14] Receive Acknowledge and Error Report Packet                      */
                        __IM uint16_t INFOOW  : 1; /*!< [15..15] Information Overwrite                                            */
                    } RXRSS2R_H_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS2R_HL; /*!< (@ 0x0000024A) Receive Result Save Slot-2 Register                        */

                        struct
                        {
                            __IM uint8_t DT : 6; /*!< [5..0] Data Type                                                          */
                            __IM uint8_t VC : 2; /*!< [7..6] Virtual Channel                                                    */
                        } RXRSS2R_HL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS2R_HH;      /*!< (@ 0x0000024B) Receive Result Save Slot-2 Register                        */

                        struct
                        {
                            __IM uint8_t FMT     : 1; /*!< [0..0] Packet Format                                                      */
                            __IM uint8_t RXSUC   : 1; /*!< [1..1] Receive Success                                                    */
                            __IM uint8_t RXFERR  : 1; /*!< [2..2] Fatal Error                                                        */
                            __IM uint8_t RXFAIL  : 1; /*!< [3..3] Receive Fail                                                       */
                            __IM uint8_t RXPFAIL : 1; /*!< [4..4] Receive Packet Data Fail                                           */
                            __IM uint8_t RXCERR  : 1; /*!< [5..5] Receive Correctable Error                                          */
                            __IM uint8_t RXAKE   : 1; /*!< [6..6] Receive Acknowledge and Error Report Packet                        */
                            __IM uint8_t INFOOW  : 1; /*!< [7..7] Information Overwrite                                              */
                        } RXRSS2R_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IM uint32_t RXRSS3R;         /*!< (@ 0x0000024C) Receive Result Save Slot-3 Register                        */

            struct
            {
                __IM uint32_t DATA0   : 8; /*!< [7..0] Data 0                                                             */
                __IM uint32_t DATA1   : 8; /*!< [15..8] Data 1                                                            */
                __IM uint32_t DT      : 6; /*!< [21..16] Data Type                                                        */
                __IM uint32_t VC      : 2; /*!< [23..22] Virtual Channel                                                  */
                __IM uint32_t FMT     : 1; /*!< [24..24] Packet Format                                                    */
                __IM uint32_t RXSUC   : 1; /*!< [25..25] Receive Success                                                  */
                __IM uint32_t RXFERR  : 1; /*!< [26..26] Fatal Error                                                      */
                __IM uint32_t RXFAIL  : 1; /*!< [27..27] Receive Fail                                                     */
                __IM uint32_t RXPFAIL : 1; /*!< [28..28] Receive Packet Data Fail                                         */
                __IM uint32_t RXCERR  : 1; /*!< [29..29] Receive Correctable Error                                        */
                __IM uint32_t RXAKE   : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet                      */
                __IM uint32_t INFOOW  : 1; /*!< [31..31] Information Overwrite                                            */
            } RXRSS3R_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IM uint16_t RXRSS3R_L;     /*!< (@ 0x0000024C) Receive Result Save Slot-3 Register                        */

                    struct
                    {
                        __IM uint16_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        __IM uint16_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                    } RXRSS3R_L_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS3R_LL;    /*!< (@ 0x0000024C) Receive Result Save Slot-3 Register                        */

                        struct
                        {
                            __IM uint8_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        } RXRSS3R_LL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS3R_LH;    /*!< (@ 0x0000024D) Receive Result Save Slot-3 Register                        */

                        struct
                        {
                            __IM uint8_t DATA1 : 8; /*!< [7..0] Data 1                                                             */
                        } RXRSS3R_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IM uint16_t RXRSS3R_H;       /*!< (@ 0x0000024E) Receive Result Save Slot-3 Register                        */

