MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHECFC/mcu.h
                    struct
                    {
                        __IM uint16_t DT      : 6; /*!< [5..0] Data Type                                                          */
                        __IM uint16_t VC      : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IM uint16_t FMT     : 1; /*!< [8..8] Packet Format                                                      */
                        __IM uint16_t RXSUC   : 1; /*!< [9..9] Receive Success                                                    */
                        __IM uint16_t RXFERR  : 1; /*!< [10..10] Fatal Error                                                      */
                        __IM uint16_t RXFAIL  : 1; /*!< [11..11] Receive Fail                                                     */
                        __IM uint16_t RXPFAIL : 1; /*!< [12..12] Receive Packet Data Fail                                         */
                        __IM uint16_t RXCERR  : 1; /*!< [13..13] Receive Correctable Error                                        */
                        __IM uint16_t RXAKE   : 1; /*!< [14..14] Receive Acknowledge and Error Report Packet                      */
                        __IM uint16_t INFOOW  : 1; /*!< [15..15] Information Overwrite                                            */
                    } RXRSS3R_H_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS3R_HL; /*!< (@ 0x0000024E) Receive Result Save Slot-3 Register                        */

                        struct
                        {
                            __IM uint8_t DT : 6; /*!< [5..0] Data Type                                                          */
                            __IM uint8_t VC : 2; /*!< [7..6] Virtual Channel                                                    */
                        } RXRSS3R_HL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS3R_HH;      /*!< (@ 0x0000024F) Receive Result Save Slot-3 Register                        */

                        struct
                        {
                            __IM uint8_t FMT     : 1; /*!< [0..0] Packet Format                                                      */
                            __IM uint8_t RXSUC   : 1; /*!< [1..1] Receive Success                                                    */
                            __IM uint8_t RXFERR  : 1; /*!< [2..2] Fatal Error                                                        */
                            __IM uint8_t RXFAIL  : 1; /*!< [3..3] Receive Fail                                                       */
                            __IM uint8_t RXPFAIL : 1; /*!< [4..4] Receive Packet Data Fail                                           */
                            __IM uint8_t RXCERR  : 1; /*!< [5..5] Receive Correctable Error                                          */
                            __IM uint8_t RXAKE   : 1; /*!< [6..6] Receive Acknowledge and Error Report Packet                        */
                            __IM uint8_t INFOOW  : 1; /*!< [7..7] Information Overwrite                                              */
                        } RXRSS3R_HH_b;
                    };
                };
            };
        };
    };
    __IM uint32_t RESERVED8[28];

    union
    {
        __IM uint32_t RXPPD0R;         /*!< (@ 0x000002C0) Receive Packet Payload Data 0 Register                     */

        struct
        {
            __IM uint32_t DATA0 : 8;   /*!< [7..0] Payload Data 0                                                     */
            __IM uint32_t DATA1 : 8;   /*!< [15..8] Payload Data 1                                                    */
            __IM uint32_t DATA2 : 8;   /*!< [23..16] Payload Data 2                                                   */
            __IM uint32_t DATA3 : 8;   /*!< [31..24] Payload Data 3                                                   */
        } RXPPD0R_b;
    };

    union
    {
        __IM uint32_t RXPPD1R;         /*!< (@ 0x000002C4) Receive Packet Payload Data 1 Register                     */

        struct
        {
            __IM uint32_t DATA4 : 8;   /*!< [7..0] Payload Data 0                                                     */
            __IM uint32_t DATA5 : 8;   /*!< [15..8] Payload Data 1                                                    */
            __IM uint32_t DATA6 : 8;   /*!< [23..16] Payload Data 2                                                   */
            __IM uint32_t DATA7 : 8;   /*!< [31..24] Payload Data 3                                                   */
        } RXPPD1R_b;
    };

    union
    {
        __IM uint32_t RXPPD2R;         /*!< (@ 0x000002C8) Receive Packet Payload Data 2 Register                     */

        struct
        {
            __IM uint32_t DATA8  : 8;  /*!< [7..0] Payload Data 8                                                     */
            __IM uint32_t DATA9  : 8;  /*!< [15..8] Payload Data 9                                                    */
            __IM uint32_t DATA10 : 8;  /*!< [23..16] Payload Data 10                                                  */
            __IM uint32_t DATA11 : 8;  /*!< [31..24] Payload Data 11                                                  */
        } RXPPD2R_b;
    };

    union
    {
        __IM uint32_t RXPPD3R;         /*!< (@ 0x000002CC) Receive Packet Payload Data 3 Register                     */

        struct
        {
            __IM uint32_t DATA12 : 8;  /*!< [7..0] Payload Data 12                                                    */
            __IM uint32_t DATA13 : 8;  /*!< [15..8] Payload Data 13                                                   */
            __IM uint32_t DATA14 : 8;  /*!< [23..16] Payload Data 14                                                  */
            __IM uint32_t DATA15 : 8;  /*!< [31..24] Payload Data 15                                                  */
        } RXPPD3R_b;
    };
    __IM uint32_t RESERVED9[4];

    union
    {
        __IOM uint32_t HSTXTOSETR;     /*!< (@ 0x000002E0) HS TX Timeout Set Register                                 */

        struct
        {
            __IOM uint32_t HTXTO : 32; /*!< [31..0] HS TX Timeout Count                                               */
        } HSTXTOSETR_b;
    };

    union
    {
        __IOM uint32_t LRXHTOSETR;      /*!< (@ 0x000002E4) LRX-H Timeout Set Register                                 */

        struct
        {
            __IOM uint32_t LRXHTO : 32; /*!< [31..0] LP-RX Host Processor Timeout                                      */
        } LRXHTOSETR_b;
    };

    union
    {
        __IOM uint32_t TATOSETR;       /*!< (@ 0x000002E8) TA Timeout Set Register                                    */

        struct
        {
            __IOM uint32_t TATO : 32;  /*!< [31..0] Turnaround Acknowledge Timeout                                    */
        } TATOSETR_b;
    };
    __IM uint32_t RESERVED10[5];

    union
    {
        __IM uint32_t FERRSR;          /*!< (@ 0x00000300) Fatal Error Status Register                                */

        struct
        {
            __IM uint32_t HTXTO   : 1; /*!< [0..0] HS TX Timeout Interrupt Flag                                       */
            __IM uint32_t LRXHTO  : 1; /*!< [1..1] LP-RX Host Processor Timeout Interrupt Flag                        */
            __IM uint32_t TATO    : 1; /*!< [2..2] Turnaround Acknowledge Timeout Interrupt Flag                      */
            uint32_t              : 13;
            __IM uint32_t ESCENT  : 1; /*!< [16..16] Escape mode Entry Error Interrupt Flag                           */
            __IM uint32_t SYNCESC : 1; /*!< [17..17] LPDT Sync Error Interrupt Flag                                   */
            __IM uint32_t CTRL    : 1; /*!< [18..18] Control Error Interrupt Flag                                     */
            __IM uint32_t CLP0    : 1; /*!< [19..19] LP0 Contention Error Interrupt Flag                              */
            __IM uint32_t CLP1    : 1; /*!< [20..20] LP1 Contention Error Interrupt Flag                              */
            uint32_t              : 6;
            __IM uint32_t CLP0S   : 1; /*!< [27..27] LP0 Contention Error Status                                      */
            __IM uint32_t CLP1S   : 1; /*!< [28..28] LP1 Contention Error Status                                      */
            uint32_t              : 3;
        } FERRSR_b;
    };

    union
    {
        __IOM uint32_t FERRSCR;         /*!< (@ 0x00000304) Fatal Error Status Clear Register                          */

        struct
        {
            __IOM uint32_t HTXTO   : 1; /*!< [0..0] HS TX Timeout Interrupt Flag Clear                                 */
            __IOM uint32_t LRXHTO  : 1; /*!< [1..1] LP-RX Host Processor Timeout Interrupt Flag Clear                  */
            __IOM uint32_t TATO    : 1; /*!< [2..2] Turnaround Acknowledge Timeout Interrupt Flag Clear                */
            uint32_t               : 13;
            __IOM uint32_t ESCENT  : 1; /*!< [16..16] Escape mode Entry Error Interrupt Flag Clear                     */
            __IOM uint32_t SYNCESC : 1; /*!< [17..17] LPDT Sync Error Interrupt Flag Clear                             */
            __IOM uint32_t CTRL    : 1; /*!< [18..18] Control Error Interrupt Flag Clear                               */
            __IOM uint32_t CLP0    : 1; /*!< [19..19] LP0 Contention Error Interrupt Flag Clear                        */
            __IOM uint32_t CLP1    : 1; /*!< [20..20] LP1 Contention Error Interrupt Flag Clear                        */
            uint32_t               : 11;
        } FERRSCR_b;
    };

    union
    {
        __IOM uint32_t FERRIER;         /*!< (@ 0x00000308) Fatal Error Interrupt Enable Register                      */

        struct
        {
            __IOM uint32_t HTXTO   : 1; /*!< [0..0] HS TX Timeout Interrupt Enable                                     */
            __IOM uint32_t LRXHTO  : 1; /*!< [1..1] LP-RX Host Processor Timeout Interrupt Enable                      */
            __IOM uint32_t TATO    : 1; /*!< [2..2] Turnaround Acknowledge Timeout Interrupt Enable                    */
            uint32_t               : 13;
            __IOM uint32_t ESCENT  : 1; /*!< [16..16] Escape mode Entry Error Interrupt Enable                         */
            __IOM uint32_t SYNCESC : 1; /*!< [17..17] LPDT Sync Error Interrupt Enable                                 */
            __IOM uint32_t CTRL    : 1; /*!< [18..18] Control Error Interrupt Enable                                   */
            __IOM uint32_t CLP0    : 1; /*!< [19..19] LP0 Contention Error Interrupt Enable                            */
            __IOM uint32_t CLP1    : 1; /*!< [20..20] LP1 Contention Error Interrupt Enable                            */
            uint32_t               : 11;
        } FERRIER_b;
    };
    __IM uint32_t RESERVED11[2];

    union
    {
        __IOM uint32_t CLSTPTSETR;     /*!< (@ 0x00000314) Clock Lane Stop Time Set Register                          */

        struct
        {
            uint32_t               : 2;
            __IOM uint32_t CLKSTPT : 10; /*!< [11..2] Clock Stop Time                                                   */
            uint32_t               : 4;
            __IOM uint32_t CLKBFHT : 8;  /*!< [23..16] Clock Beforehand Time                                            */
            __IOM uint32_t CLKKPT  : 8;  /*!< [31..24] Clock Keep Time                                                  */
        } CLSTPTSETR_b;
    };

    union
    {
        __IOM uint32_t LPTRNSTSETR;      /*!< (@ 0x00000318) LP Transition Time Set Register                            */

        struct
        {
            __IOM uint32_t GOLPBKT : 10; /*!< [9..0] Go LP and Back Time                                                */
            uint32_t               : 22;
        } LPTRNSTSETR_b;
    };
    __IM uint32_t RESERVED12;

    union
    {
        __IM uint32_t PLSR;             /*!< (@ 0x00000320) Physical Lane Status Register                              */

        struct
        {
            __IM uint32_t CLUAN    : 1; /*!< [0..0] Clock Lane UlpsActiveNot Status                                    */
            __IM uint32_t CLSTP    : 1; /*!< [1..1] Clock Lane Stop Status                                             */
            __IM uint32_t DL0RLE   : 1; /*!< [2..2] Data Lane-0 RxLpdtEsc Status                                       */
            __IM uint32_t DL0RUE   : 1; /*!< [3..3] Data Lane-0 RxUlpsEsc Status                                       */
            __IM uint32_t DL0UAN   : 1; /*!< [4..4] Data Lane-0 UlpsActiveNot Status                                   */
            __IM uint32_t DL1UAN   : 1; /*!< [5..5] Data Lane-1 UlpsActiveNot Status                                   */
            uint32_t               : 2;
            __IM uint32_t DL0STP   : 1; /*!< [8..8] Data Lane-0 Stop Status                                            */
            __IM uint32_t DL1STP   : 1; /*!< [9..9] Data Lane-1 Stop Status                                            */
            uint32_t               : 2;
            __IM uint32_t DL0RX2TX : 1; /*!< [12..12] Data Lane-0 RX to TX Transition Interrupt Flag                   */
            __IM uint32_t DL0TX2RX : 1; /*!< [13..13] Data Lane-0 TX to RX Transition Interrupt Flag                   */
            uint32_t               : 1;
            __IM uint32_t DL0DIR   : 1; /*!< [15..15] Data Lane-0 Direction                                            */
            uint32_t               : 8;
            __IM uint32_t CLULPENT : 1; /*!< [24..24] Clock Lane ULPS Enter Interrupt Flag                             */
            __IM uint32_t CLULPEXT : 1; /*!< [25..25] Clock Lane ULPS Exit Interrupt Flag                              */
            __IM uint32_t CLLP2HS  : 1; /*!< [26..26] Clock Lane LP to HS Transition Interrupt Flag                    */
            __IM uint32_t CLHS2LP  : 1; /*!< [27..27] Clock Lane HS to LP Transition Interrupt Flag                    */
            __IM uint32_t DLULPENT : 1; /*!< [28..28] Data Lane ULPS Enter Interrupt Flag                              */
            __IM uint32_t DLULPEXT : 1; /*!< [29..29] Data Lane ULPS Exit Interrupt Flag                               */
            uint32_t               : 2;
        } PLSR_b;
    };

    union
    {
        __IOM uint32_t PLSCR;          /*!< (@ 0x00000324) Physical Lane Status Clear Register                        */

        struct
        {
            uint32_t                : 12;
            __IOM uint32_t DL0RX2TX : 1; /*!< [12..12] Data Lane-0 RX to TX Transition Interrupt Flag Clear             */
            __IOM uint32_t DL0TX2RX : 1; /*!< [13..13] Data Lane-0 TX to RX Transition Interrupt Flag Clear             */
            uint32_t                : 10;
            __IOM uint32_t CLULPENT : 1; /*!< [24..24] Clock Lane ULPS Enter Interrupt Flag Clear                       */
            __IOM uint32_t CLULPEXT : 1; /*!< [25..25] Clock Lane ULPS Exit Interrupt Flag Clear                        */
            __IOM uint32_t CLLP2HS  : 1; /*!< [26..26] Clock Lane LP to HS Transition Interrupt Flag Clear              */
            __IOM uint32_t CLHS2LP  : 1; /*!< [27..27] Clock Lane HS to LP Transition Interrupt Flag Clear              */
            __IOM uint32_t DLULPENT : 1; /*!< [28..28] Data Lane ULPS Enter Interrupt Flag Clear                        */
            __IOM uint32_t DLULPEXT : 1; /*!< [29..29] Data Lane ULPS Exit Interrupt Flag Clear                         */
            uint32_t                : 2;
        } PLSCR_b;
    };

    union
    {
        __IOM uint32_t PLIER;          /*!< (@ 0x00000328) Physical Lane Interrupt Enable Register                    */

        struct
        {
            uint32_t                : 12;
            __IOM uint32_t DL0RX2TX : 1; /*!< [12..12] Data Lane-0 RX to TX Transition Interrupt Enable                 */
            __IOM uint32_t DL0TX2RX : 1; /*!< [13..13] Data Lane-0 TX to RX Transition Interrupt Enable                 */
            uint32_t                : 10;
            __IOM uint32_t CLULPENT : 1; /*!< [24..24] Clock Lane ULPS Enter Interrupt Enable                           */
            __IOM uint32_t CLULPEXT : 1; /*!< [25..25] Clock Lane ULPS Exit Interrupt Enable                            */
            __IOM uint32_t CLLP2HS  : 1; /*!< [26..26] Clock Lane LP to HS Transition Interrupt Enable                  */
            __IOM uint32_t CLHS2LP  : 1; /*!< [27..27] Clock Lane HS to LP Transition Interrupt Enable                  */
            __IOM uint32_t DLULPENT : 1; /*!< [28..28] Data Lane ULPS Enter Interrupt Enable                            */
            __IOM uint32_t DLULPEXT : 1; /*!< [29..29] Data Lane ULPS Exit Interrupt Enable                             */
            uint32_t                : 2;
        } PLIER_b;
    };
    __IM uint32_t RESERVED13[53];

    union
    {
        __IOM uint32_t VMSET0R;         /*!< (@ 0x00000400) Video Mode Set 0 Register                                  */

        struct
        {
            __OM uint32_t VSTART   : 1; /*!< [0..0] Video Mode Operation Start                                         */
            __OM uint32_t VSTOP    : 1; /*!< [1..1] Video Mode Operation Stop                                          */
            uint32_t               : 6;
            __IOM uint32_t HSANOLP : 1; /*!< [8..8] HSA period No LP                                                   */
            __IOM uint32_t HBPNOLP : 1; /*!< [9..9] HBP period No LP                                                   */
            __IOM uint32_t HFPNOLP : 1; /*!< [10..10] HFP period No LP                                                 */
            uint32_t               : 21;
        } VMSET0R_b;
    };

    union
    {
        __IOM uint32_t VMSET1R;        /*!< (@ 0x00000404) Video Mode Set 1 Register                                  */

        struct
        {
            uint32_t           : 2;
            __IOM uint32_t DLY : 12;   /*!< [13..2] Delay Value                                                       */
            uint32_t           : 18;
        } VMSET1R_b;
    };
    __IM uint32_t RESERVED14[2];

    union
    {
        __IM uint32_t VMSR;            /*!< (@ 0x00000410) Video Mode Status Register                                 */

        struct
        {
            __IM uint32_t START   : 1; /*!< [0..0] Video Mode Operation Start Interrupt Flag                          */
            __IM uint32_t STOP    : 1; /*!< [1..1] Video Mode Operation Stop Interrupt Flag                           */
            __IM uint32_t RUNNING : 1; /*!< [2..2] Video Mode Operation Running Status                                */
            __IM uint32_t VIRDY   : 1; /*!< [3..3] Video Mode Operation Ready Interrupt Flag                          */
            uint32_t              : 16;
            __IM uint32_t TIMERR  : 1; /*!< [20..20] Timing Error Interrupt Flag                                      */
            uint32_t              : 1;
            __IM uint32_t VBUFUDF : 1; /*!< [22..22] Video Buffer Underflow Error Interrupt Flag                      */
            __IM uint32_t VBUFOVF : 1; /*!< [23..23] Video Buffer Overflow Error Interrupt Flag                       */
            uint32_t              : 8;
        } VMSR_b;
    };

    union
    {
        __IOM uint32_t VMSCR;           /*!< (@ 0x00000414) Video Mode Status Clear Register                           */

        struct
        {
            __IOM uint32_t START   : 1; /*!< [0..0] Video Mode Operation Start Interrupt Flag Clear                    */
            __IOM uint32_t STOP    : 1; /*!< [1..1] Video Mode Operation Stop Interrupt Flag Clear                     */
            uint32_t               : 1;
            __IOM uint32_t VIRDY   : 1; /*!< [3..3] Video Mode Operation Ready Interrupt Flag Clear                    */
            uint32_t               : 16;
            __IOM uint32_t TIMERR  : 1; /*!< [20..20] Timing Error Interrupt Flag Clear                                */
            uint32_t               : 1;
            __IOM uint32_t VBUFUDF : 1; /*!< [22..22] Video Buffer Underflow Error Interrupt Flag Clear                */
            __IOM uint32_t VBUFOVF : 1; /*!< [23..23] Video Buffer Overflow Error Interrupt Flag Clear                 */
            uint32_t               : 8;
        } VMSCR_b;
    };

    union
    {
        __IOM uint32_t VMIER;           /*!< (@ 0x00000418) Video Mode Interrupt Enable Register                       */

        struct
        {
            __IOM uint32_t START   : 1; /*!< [0..0] Video Mode Operation Start Interrupt Enable                        */
            __IOM uint32_t STOP    : 1; /*!< [1..1] Video Mode Operation Stop Interrupt Enable                         */
            uint32_t               : 1;
            __IOM uint32_t VIRDY   : 1; /*!< [3..3] Video Mode Operation Ready Interrupt Enable                        */
            uint32_t               : 16;
            __IOM uint32_t TIMERR  : 1; /*!< [20..20] Timing Error Interrupt Enable                                    */
            uint32_t               : 1;
            __IOM uint32_t VBUFUDF : 1; /*!< [22..22] Video Buffer Underflow Error Interrupt Enable                    */
            __IOM uint32_t VBUFOVF : 1; /*!< [23..23] Video Buffer Overflow Error Interrupt Enable                     */
            uint32_t               : 8;
        } VMIER_b;
    };
    __IM uint32_t RESERVED15;

    union
    {
        __IOM uint32_t VMPPSETR;       /*!< (@ 0x00000420) Video Mode Pixel Packet Set Register                       */

        struct
        {
            uint32_t               : 15;
            __IOM uint32_t TXESYNC : 1; /*!< [15..15] Transmit End of Sync Pulse                                       */
            __IOM uint32_t DT      : 6; /*!< [21..16] Video Mode Data Type                                             */
            __IOM uint32_t VC      : 2; /*!< [23..22] Video Mode Virtual Channel                                       */
            uint32_t               : 8;
        } VMPPSETR_b;
    };
    __IM uint32_t RESERVED16;

    union
    {
        __IOM uint32_t VMVSSETR;       /*!< (@ 0x00000428) Video Mode Vertical Size Set Register                      */

        struct
        {
            __IOM uint32_t VSA   : 12; /*!< [11..0] VSA Lines                                                         */
            uint32_t             : 3;
            __IOM uint32_t VSPOL : 1;  /*!< [15..15] VSYNC Polarity                                                   */
            __IOM uint32_t VACT  : 15; /*!< [30..16] Vertical Active Lines                                            */
            uint32_t             : 1;
        } VMVSSETR_b;
    };

    union
    {
        __IOM uint32_t VMVPSETR;       /*!< (@ 0x0000042C) Video Mode Vertical Porch Set Register                     */

        struct
        {
            __IOM uint32_t VBP : 13;   /*!< [12..0] VBP Lines                                                         */
            uint32_t           : 3;
            __IOM uint32_t VFP : 13;   /*!< [28..16] VFP Lines                                                        */
            uint32_t           : 3;
        } VMVPSETR_b;
    };

