MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHECFC/mcu.h
        struct
        {
            __IM uint32_t PORTPN : 4;             /*!< [3..0] FSBL Error Notification Port Pin Number                            */
            __IM uint32_t PORTGN : 5;             /*!< [8..4] FSBL Error Notification Port Group Name                            */
            uint32_t             : 23;
        } FSBLCTRL2_b;
    };
    __IOM uint32_t SACC0;                         /*!< (@ 0x0000008C) Start Address of Code Certification 0                      */
    __IOM uint32_t SACC1;                         /*!< (@ 0x00000090) Start Address of Code Certification 1                      */
    __IOM uint32_t SAMR;                          /*!< (@ 0x00000094) Start Address of Measurement Report                        */
    __IM uint32_t  RESERVED1[178];
    __IM uint32_t  HOEMRTPK;                      /*!< (@ 0x00000360) Hask of OEM_ROOT_PK                                        */
    __IM uint32_t  RESERVED2[7];
    __IOM R_OFS_DATAFLASH_CFGDLOCK_Type CFGDLOCK; /*!< (@ 0x00000380) Configuration Data Lock Bits                               */
    __IM uint32_t RESERVED3[11];

    union
    {
        __IOM uint16_t ARCLS;            /*!< (@ 0x000003C0) Anti-Rollback Counter Lock Setting                         */

        struct
        {
            __IOM uint16_t ARCS_LK  : 1; /*!< [0..0] ARC_SEC Lock                                                       */
            __IOM uint16_t ARCNS_LK : 4; /*!< [4..1] ARC_NSEC Lock                                                      */
            __IOM uint16_t ARCBL_LK : 1; /*!< [5..5] ARC_OEMBL Lock                                                     */
            uint16_t                : 10;
        } ARCLS_b;
    };

    union
    {
        __IOM uint16_t ARCCS;             /*!< (@ 0x000003C2) ARCCS                                                      */

        struct
        {
            __IOM uint16_t CNF_ARCNS : 2; /*!< [1..0] Configuation setting for ARC_NSEC                                  */
            uint16_t                 : 14;
        } ARCCS_b;
    };
    __IM uint32_t RESERVED4[291];

    union
    {
        __IOM uint32_t ARC_SEC[2];       /*!< (@ 0x00000850) Anti-Rollback Counter for Secure Application
                                          *                  n                                                          */

        struct
        {
            __IOM uint32_t ARC_SEC : 32; /*!< [31..0] ARC_SEC                                                           */
        } ARC_SEC_b[2];
    };

    union
    {
        __IOM uint32_t ARC_NSEC[8];       /*!< (@ 0x00000858) Anti-Rollback Counter for Non-Secure Application           */

        struct
        {
            __IOM uint32_t ARC_NSEC : 32; /*!< [31..0] Anti-Rollback Counter for Non-secure Application                  */
        } ARC_NSEC_b[8];
    };

    union
    {
        __IOM uint32_t ARC_OEMBL[2];       /*!< (@ 0x00000878) Anti-Rollback Counter for OEMBL                            */

        struct
        {
            __IOM uint32_t ARC_OEMBL : 32; /*!< [31..0] Anti-Rollback Counter for OEM_BL Application                      */
        } ARC_OEMBL_b[2];
    };
} R_OFS_DATAFLASH_Type;                    /*!< Size = 2176 (0x880)                                                       */

/** @} */ /* End of group Device_Peripheral_peripherals */

/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */

/** @addtogroup Device_Peripheral_peripheralAddr
 * @{
 */

 #if defined(_RA_TZ_NONSECURE)
  #define BASE_NS_OFFSET         (BSP_FEATURE_TZ_NS_OFFSET)
 #else
  #define BASE_NS_OFFSET         0U
 #endif

 #define R_ACMPHS0_BASE          (0x40236000UL + BASE_NS_OFFSET)
 #define R_ACMPHS1_BASE          (0x40236100UL + BASE_NS_OFFSET)
 #define R_ACMPHS2_BASE          (0x40236200UL + BASE_NS_OFFSET)
 #define R_ACMPHS3_BASE          (0x40236300UL + BASE_NS_OFFSET)
 #define R_ACMPHS4_BASE          (0x40236400UL + BASE_NS_OFFSET)
 #define R_ACMPHS5_BASE          (0x40236500UL + BASE_NS_OFFSET)
 #define R_ADC0_BASE             (0x40332000UL + BASE_NS_OFFSET)
 #define R_ADC1_BASE             (0x40332200UL + BASE_NS_OFFSET)
 #define R_PSCU_BASE             (0x40204000UL + BASE_NS_OFFSET)
 #define R_BUS_BASE              (0x40003000UL + BASE_NS_OFFSET)
 #define R_CAC_BASE              (0x40202400UL + BASE_NS_OFFSET)
 #define R_CANFD_BASE            (0x40380000UL + BASE_NS_OFFSET)
 #define R_CANFD1_BASE           (0x40382000UL + BASE_NS_OFFSET)
 #define R_CRC_BASE              (0x40310000UL + BASE_NS_OFFSET)
 #define R_DAC_BASE              (0x40333000UL + BASE_NS_OFFSET)
 #define R_DEBUG_BASE            (0x4001B000UL + BASE_NS_OFFSET)
 #define R_DMA_BASE              (0x4000A800UL + BASE_NS_OFFSET)
 #define R_DMAC0_BASE            (0x4000A000UL + BASE_NS_OFFSET)
 #define R_DMAC1_BASE            (0x4000A040UL + BASE_NS_OFFSET)
 #define R_DMAC2_BASE            (0x4000A080UL + BASE_NS_OFFSET)
 #define R_DMAC3_BASE            (0x4000A0C0UL + BASE_NS_OFFSET)
 #define R_DMAC4_BASE            (0x4000A100UL + BASE_NS_OFFSET)
 #define R_DMAC5_BASE            (0x4000A140UL + BASE_NS_OFFSET)
 #define R_DMAC6_BASE            (0x4000A180UL + BASE_NS_OFFSET)
 #define R_DMAC7_BASE            (0x4000A1C0UL + BASE_NS_OFFSET)
 #define R_DOC_BASE              (0x40311000UL + BASE_NS_OFFSET)
 #define R_DRW_BASE              (0x40344000UL + BASE_NS_OFFSET)
 #define R_DTC_BASE              (0x4000AC00UL + BASE_NS_OFFSET)
 #define R_ELC_BASE              (0x40201000UL + BASE_NS_OFFSET)
 #define R_ETHERC0_BASE          (0x40354100UL + BASE_NS_OFFSET)
 #define R_ETHERC_EDMAC_BASE     (0x40354000UL + BASE_NS_OFFSET)
 #define R_FACI_HP_CMD_BASE      (0x40100000UL + BASE_NS_OFFSET)
 #define R_FACI_HP_BASE          (0x4011E000UL + BASE_NS_OFFSET)
 #define R_FCACHE_BASE           (0x4001C100UL + BASE_NS_OFFSET)
 #define R_GLCDC_BASE            (0x40342000UL + BASE_NS_OFFSET)
 #define R_GPT0_BASE             (0x40322000UL + BASE_NS_OFFSET)
 #define R_GPT1_BASE             (0x40322100UL + BASE_NS_OFFSET)
 #define R_GPT2_BASE             (0x40322200UL + BASE_NS_OFFSET)
 #define R_GPT3_BASE             (0x40322300UL + BASE_NS_OFFSET)
 #define R_GPT4_BASE             (0x40322400UL + BASE_NS_OFFSET)
 #define R_GPT5_BASE             (0x40322500UL + BASE_NS_OFFSET)
 #define R_GPT6_BASE             (0x40322600UL + BASE_NS_OFFSET)
 #define R_GPT7_BASE             (0x40322700UL + BASE_NS_OFFSET)
 #define R_GPT8_BASE             (0x40322800UL + BASE_NS_OFFSET)
 #define R_GPT9_BASE             (0x40322900UL + BASE_NS_OFFSET)
 #define R_GPT10_BASE            (0x40322A00UL + BASE_NS_OFFSET)
 #define R_GPT11_BASE            (0x40322B00UL + BASE_NS_OFFSET)
 #define R_GPT12_BASE            (0x40322C00UL + BASE_NS_OFFSET)
 #define R_GPT13_BASE            (0x40322D00UL + BASE_NS_OFFSET)
 #define R_GPT_OPS_BASE          (0x40323F00UL + BASE_NS_OFFSET)
 #define R_GPT_POEG0_BASE        (0x40212000UL + BASE_NS_OFFSET)
 #define R_GPT_POEG1_BASE        (0x40212100UL + BASE_NS_OFFSET)
 #define R_GPT_POEG2_BASE        (0x40212200UL + BASE_NS_OFFSET)
 #define R_GPT_POEG3_BASE        (0x40212300UL + BASE_NS_OFFSET)
 #define R_ICU_BASE              (0x40006000UL + BASE_NS_OFFSET)
 #define R_IIC0_BASE             (0x4025E000UL + BASE_NS_OFFSET)
 #define R_IIC1_BASE             (0x4025E100UL + BASE_NS_OFFSET)
 #define R_IIC2_BASE             (0x4025E200UL + BASE_NS_OFFSET)
 #define R_IWDT_BASE             (0x40202200UL + BASE_NS_OFFSET)
 #define R_I3C0_BASE             (0x4035F000UL + BASE_NS_OFFSET)
 #define R_I3C1_BASE             (0x4035F100UL + BASE_NS_OFFSET)
 #define R_MPU_MMPU_BASE         (0x40000000UL + BASE_NS_OFFSET)
 #define R_MPU_SPMON_BASE        (0x40000D00UL + BASE_NS_OFFSET)
 #define R_MSTP_BASE             (0x40203000UL + BASE_NS_OFFSET)
 #define R_PORT0_BASE            (0x40400000UL + BASE_NS_OFFSET)
 #define R_PORT1_BASE            (0x40400020UL + BASE_NS_OFFSET)
 #define R_PORT2_BASE            (0x40400040UL + BASE_NS_OFFSET)
 #define R_PORT3_BASE            (0x40400060UL + BASE_NS_OFFSET)
 #define R_PORT4_BASE            (0x40400080UL + BASE_NS_OFFSET)
 #define R_PORT5_BASE            (0x404000A0UL + BASE_NS_OFFSET)
 #define R_PORT6_BASE            (0x404000C0UL + BASE_NS_OFFSET)
 #define R_PORT7_BASE            (0x404000E0UL + BASE_NS_OFFSET)
 #define R_PORT8_BASE            (0x40400100UL + BASE_NS_OFFSET)
 #define R_PORT9_BASE            (0x40400120UL + BASE_NS_OFFSET)
 #define R_PORT10_BASE           (0x40400140UL + BASE_NS_OFFSET)
 #define R_PORT11_BASE           (0x40400160UL + BASE_NS_OFFSET)
 #define R_PORT12_BASE           (0x40400180UL + BASE_NS_OFFSET)
 #define R_PORT13_BASE           (0x404001A0UL + BASE_NS_OFFSET)
 #define R_PORT14_BASE           (0x404001C0UL + BASE_NS_OFFSET)
 #define R_PFS_BASE              (0x40400800UL + BASE_NS_OFFSET)
 #define R_PMISC_BASE            (0x40400D00UL + BASE_NS_OFFSET)
 #define R_RTC_BASE              (0x40202000UL + BASE_NS_OFFSET)
 #define R_SCI0_BASE             (0x40358000UL + BASE_NS_OFFSET)
 #define R_SCI1_BASE             (0x40358100UL + BASE_NS_OFFSET)
 #define R_SCI2_BASE             (0x40358200UL + BASE_NS_OFFSET)
 #define R_SCI3_BASE             (0x40358300UL + BASE_NS_OFFSET)
 #define R_SCI4_BASE             (0x40358400UL + BASE_NS_OFFSET)
 #define R_SCI5_BASE             (0x40358500UL + BASE_NS_OFFSET)
 #define R_SCI6_BASE             (0x40358600UL + BASE_NS_OFFSET)
 #define R_SCI7_BASE             (0x40358700UL + BASE_NS_OFFSET)
 #define R_SCI8_BASE             (0x40358800UL + BASE_NS_OFFSET)
 #define R_SCI9_BASE             (0x40358900UL + BASE_NS_OFFSET)
 #define R_SDHI0_BASE            (0x40252000UL + BASE_NS_OFFSET)
 #define R_SDHI1_BASE            (0x40252400UL + BASE_NS_OFFSET)
 #define R_SPI0_BASE             (0x4035C000UL + BASE_NS_OFFSET)
 #define R_SPI1_BASE             (0x4035C100UL + BASE_NS_OFFSET)
 #define R_SPI2_BASE             (0x40072200UL + BASE_NS_OFFSET)
 #define R_SRAM_BASE             (0x40002000UL + BASE_NS_OFFSET)
 #define R_SSI0_BASE             (0x4025D000UL + BASE_NS_OFFSET)
 #define R_SSI1_BASE             (0x4025D100UL + BASE_NS_OFFSET)
 #define R_SYSTEM_BASE           (0x4001E000UL + BASE_NS_OFFSET)
 #define R_TSN_CAL_BASE          (0x4011B17CUL + BASE_NS_OFFSET)
 #define R_TSN_CTRL_BASE         (0x40235000UL + BASE_NS_OFFSET)
 #define R_USB_FS0_BASE          (0x40250000UL + BASE_NS_OFFSET)
 #define R_WDT_BASE              (0x40202600UL + BASE_NS_OFFSET)
 #define R_CPSCU_BASE            (0x40008000UL + BASE_NS_OFFSET)
 #define R_DOC_B_BASE            (0x40311000UL + BASE_NS_OFFSET)
 #define R_SCI_B0_BASE           (0x40358000UL + BASE_NS_OFFSET)
 #define R_SCI_B1_BASE           (0x40358100UL + BASE_NS_OFFSET)
 #define R_SCI_B2_BASE           (0x40358200UL + BASE_NS_OFFSET)
 #define R_SCI_B3_BASE           (0x40358300UL + BASE_NS_OFFSET)
 #define R_SCI_B4_BASE           (0x40358400UL + BASE_NS_OFFSET)
 #define R_SCI_B9_BASE           (0x40358900UL + BASE_NS_OFFSET)
 #define R_SPI_B0_BASE           (0x4035C000UL + BASE_NS_OFFSET)
 #define R_SPI_B1_BASE           (0x4035C100UL + BASE_NS_OFFSET)
 #define R_USB_HS0_BASE          (0x40351000UL + BASE_NS_OFFSET)
 #define R_XSPI0_BASE            (0x40268000UL + BASE_NS_OFFSET)
 #define R_XSPI1_BASE            (0x40268400UL + BASE_NS_OFFSET)
 #define R_MIPI_PHY_BASE         (0x40346C00UL + BASE_NS_OFFSET)
 #define R_CEU_BASE              (0x40348000UL + BASE_NS_OFFSET)
 #define R_ULPT0_BASE            (0x40220000UL + BASE_NS_OFFSET)
 #define R_ULPT1_BASE            (0x40220100UL + BASE_NS_OFFSET)
 #define R_DEBUG_OCD_BASE        (0x40011000UL + BASE_NS_OFFSET)
 #define R_DOTF_BASE             (0x40268800UL + BASE_NS_OFFSET)
 #define R_AGTX0_BASE            (0x40221000UL + BASE_NS_OFFSET)
 #define R_AGTX1_BASE            (0x40221100UL + BASE_NS_OFFSET)
 #define R_AGTX2_BASE            (0x40221200UL + BASE_NS_OFFSET)
 #define R_AGTX3_BASE            (0x40221300UL + BASE_NS_OFFSET)
 #define R_AGTX4_BASE            (0x40221400UL + BASE_NS_OFFSET)
 #define R_AGTX5_BASE            (0x40221500UL + BASE_NS_OFFSET)
 #define R_AGTX6_BASE            (0x40221600UL + BASE_NS_OFFSET)
 #define R_AGTX7_BASE            (0x40221700UL + BASE_NS_OFFSET)
 #define R_AGTX8_BASE            (0x40221800UL + BASE_NS_OFFSET)
 #define R_AGTX9_BASE            (0x40221900UL + BASE_NS_OFFSET)
 #define R_DOTF1_BASE            (0x40268900UL + BASE_NS_OFFSET)
 #define R_ECCMB0_BASE           (0x4036F200UL + BASE_NS_OFFSET)
 #define R_ECCMB1_BASE           (0x4036F300UL + BASE_NS_OFFSET)
 #define R_FLAD_BASE             (0x4011C000UL + BASE_NS_OFFSET)
 #define R_MIPI_DSI_BASE         (0x40346000UL + BASE_NS_OFFSET)
 #define R_OFS_DATAFLASH_BASE    (0x27030000UL + BASE_NS_OFFSET)
 #define R_SCI_B5_BASE           (0x40358500UL + BASE_NS_OFFSET)
 #define R_SCI_B6_BASE           (0x40358600UL + BASE_NS_OFFSET)
 #define R_SCI_B7_BASE           (0x40358700UL + BASE_NS_OFFSET)
 #define R_SCI_B8_BASE           (0x40358800UL + BASE_NS_OFFSET)
 #define R_WDT1_BASE             (0x40044300UL + BASE_NS_OFFSET)

/** @} */ /* End of group Device_Peripheral_peripheralAddr */

/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */

/** @addtogroup Device_Peripheral_declaration
 * @{
 */

