MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHECFC/mcu.h
/* =========================================================  IRQCR  ========================================================= */
 #define R_ICU_IRQCR_FLTEN_Pos            (7UL)          /*!< FLTEN (Bit 7)                                         */
 #define R_ICU_IRQCR_FLTEN_Msk            (0x80UL)       /*!< FLTEN (Bitfield-Mask: 0x01)                           */
 #define R_ICU_IRQCR_FCLKSEL_Pos          (4UL)          /*!< FCLKSEL (Bit 4)                                       */
 #define R_ICU_IRQCR_FCLKSEL_Msk          (0x30UL)       /*!< FCLKSEL (Bitfield-Mask: 0x03)                         */
 #define R_ICU_IRQCR_IRQMD_Pos            (0UL)          /*!< IRQMD (Bit 0)                                         */
 #define R_ICU_IRQCR_IRQMD_Msk            (0x3UL)        /*!< IRQMD (Bitfield-Mask: 0x03)                           */
/* =========================================================  NMICR  ========================================================= */
 #define R_ICU_NMICR_NMIMD_Pos            (0UL)          /*!< NMIMD (Bit 0)                                         */
 #define R_ICU_NMICR_NMIMD_Msk            (0x1UL)        /*!< NMIMD (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMICR_NFCLKSEL_Pos         (4UL)          /*!< NFCLKSEL (Bit 4)                                      */
 #define R_ICU_NMICR_NFCLKSEL_Msk         (0x30UL)       /*!< NFCLKSEL (Bitfield-Mask: 0x03)                        */
 #define R_ICU_NMICR_NFLTEN_Pos           (7UL)          /*!< NFLTEN (Bit 7)                                        */
 #define R_ICU_NMICR_NFLTEN_Msk           (0x80UL)       /*!< NFLTEN (Bitfield-Mask: 0x01)                          */
/* ========================================================  SWIRQ_S  ======================================================== */
 #define R_ICU_SWIRQ_S_SWIRQS_Pos         (0UL)          /*!< SWIRQS (Bit 0)                                        */
 #define R_ICU_SWIRQ_S_SWIRQS_Msk         (0x1UL)        /*!< SWIRQS (Bitfield-Mask: 0x01)                          */
/* =======================================================  SWIRQ_NS  ======================================================== */
 #define R_ICU_SWIRQ_NS_SWIRQNS_Pos       (0UL)          /*!< SWIRQNS (Bit 0)                                       */
 #define R_ICU_SWIRQ_NS_SWIRQNS_Msk       (0x1UL)        /*!< SWIRQNS (Bitfield-Mask: 0x01)                         */
/* ========================================================  IENMIER  ======================================================== */
 #define R_ICU_IENMIER_CMEN_Pos           (0UL)          /*!< CMEN (Bit 0)                                          */
 #define R_ICU_IENMIER_CMEN_Msk           (0x1UL)        /*!< CMEN (Bitfield-Mask: 0x01)                            */
 #define R_ICU_IENMIER_LMEN_Pos           (1UL)          /*!< LMEN (Bit 1)                                          */
 #define R_ICU_IENMIER_LMEN_Msk           (0x2UL)        /*!< LMEN (Bitfield-Mask: 0x01)                            */
 #define R_ICU_IENMIER_BUSEN_Pos          (2UL)          /*!< BUSEN (Bit 2)                                         */
 #define R_ICU_IENMIER_BUSEN_Msk          (0x4UL)        /*!< BUSEN (Bitfield-Mask: 0x01)                           */
/* =========================================================  NMIER  ========================================================= */
 #define R_ICU_NMIER_IWDTEN_Pos           (0UL)          /*!< IWDTEN (Bit 0)                                        */
 #define R_ICU_NMIER_IWDTEN_Msk           (0x1UL)        /*!< IWDTEN (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMIER_WDTEN_Pos            (1UL)          /*!< WDTEN (Bit 1)                                         */
 #define R_ICU_NMIER_WDTEN_Msk            (0x2UL)        /*!< WDTEN (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMIER_LVD1EN_Pos           (2UL)          /*!< LVD1EN (Bit 2)                                        */
 #define R_ICU_NMIER_LVD1EN_Msk           (0x4UL)        /*!< LVD1EN (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMIER_LVD2EN_Pos           (3UL)          /*!< LVD2EN (Bit 3)                                        */
 #define R_ICU_NMIER_LVD2EN_Msk           (0x8UL)        /*!< LVD2EN (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMIER_OSTEN_Pos            (6UL)          /*!< OSTEN (Bit 6)                                         */
 #define R_ICU_NMIER_OSTEN_Msk            (0x40UL)       /*!< OSTEN (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMIER_NMIEN_Pos            (7UL)          /*!< NMIEN (Bit 7)                                         */
 #define R_ICU_NMIER_NMIEN_Msk            (0x80UL)       /*!< NMIEN (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMIER_BUSEN_Pos            (12UL)         /*!< BUSEN (Bit 12)                                        */
 #define R_ICU_NMIER_BUSEN_Msk            (0x1000UL)     /*!< BUSEN (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMIER_CMEN_Pos             (13UL)         /*!< CMEN (Bit 13)                                         */
 #define R_ICU_NMIER_CMEN_Msk             (0x2000UL)     /*!< CMEN (Bitfield-Mask: 0x01)                            */
 #define R_ICU_NMIER_LUEN_Pos             (15UL)         /*!< LUEN (Bit 15)                                         */
 #define R_ICU_NMIER_LUEN_Msk             (0x8000UL)     /*!< LUEN (Bitfield-Mask: 0x01)                            */
/* ========================================================  NMICLR  ========================================================= */
 #define R_ICU_NMICLR_IWDTCLR_Pos         (0UL)          /*!< IWDTCLR (Bit 0)                                       */
 #define R_ICU_NMICLR_IWDTCLR_Msk         (0x1UL)        /*!< IWDTCLR (Bitfield-Mask: 0x01)                         */
 #define R_ICU_NMICLR_WDTCLR_Pos          (1UL)          /*!< WDTCLR (Bit 1)                                        */
 #define R_ICU_NMICLR_WDTCLR_Msk          (0x2UL)        /*!< WDTCLR (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMICLR_LVD1CLR_Pos         (2UL)          /*!< LVD1CLR (Bit 2)                                       */
 #define R_ICU_NMICLR_LVD1CLR_Msk         (0x4UL)        /*!< LVD1CLR (Bitfield-Mask: 0x01)                         */
 #define R_ICU_NMICLR_LVD2CLR_Pos         (3UL)          /*!< LVD2CLR (Bit 3)                                       */
 #define R_ICU_NMICLR_LVD2CLR_Msk         (0x8UL)        /*!< LVD2CLR (Bitfield-Mask: 0x01)                         */
 #define R_ICU_NMICLR_OSTCLR_Pos          (6UL)          /*!< OSTCLR (Bit 6)                                        */
 #define R_ICU_NMICLR_OSTCLR_Msk          (0x40UL)       /*!< OSTCLR (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMICLR_NMICLR_Pos          (7UL)          /*!< NMICLR (Bit 7)                                        */
 #define R_ICU_NMICLR_NMICLR_Msk          (0x80UL)       /*!< NMICLR (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMICLR_BUSCLR_Pos          (12UL)         /*!< BUSCLR (Bit 12)                                       */
 #define R_ICU_NMICLR_BUSCLR_Msk          (0x1000UL)     /*!< BUSCLR (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMICLR_CMCLR_Pos           (13UL)         /*!< CMCLR (Bit 13)                                        */
 #define R_ICU_NMICLR_CMCLR_Msk           (0x2000UL)     /*!< CMCLR (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMICLR_LUCLR_Pos           (15UL)         /*!< LUCLR (Bit 15)                                        */
 #define R_ICU_NMICLR_LUCLR_Msk           (0x8000UL)     /*!< LUCLR (Bitfield-Mask: 0x01)                           */
/* =========================================================  NMISR  ========================================================= */
 #define R_ICU_NMISR_IWDTST_Pos           (0UL)          /*!< IWDTST (Bit 0)                                        */
 #define R_ICU_NMISR_IWDTST_Msk           (0x1UL)        /*!< IWDTST (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMISR_WDTST_Pos            (1UL)          /*!< WDTST (Bit 1)                                         */
 #define R_ICU_NMISR_WDTST_Msk            (0x2UL)        /*!< WDTST (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMISR_LVD1ST_Pos           (2UL)          /*!< LVD1ST (Bit 2)                                        */
 #define R_ICU_NMISR_LVD1ST_Msk           (0x4UL)        /*!< LVD1ST (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMISR_LVD2ST_Pos           (3UL)          /*!< LVD2ST (Bit 3)                                        */
 #define R_ICU_NMISR_LVD2ST_Msk           (0x8UL)        /*!< LVD2ST (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMISR_OSTST_Pos            (6UL)          /*!< OSTST (Bit 6)                                         */
 #define R_ICU_NMISR_OSTST_Msk            (0x40UL)       /*!< OSTST (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMISR_NMIST_Pos            (7UL)          /*!< NMIST (Bit 7)                                         */
 #define R_ICU_NMISR_NMIST_Msk            (0x80UL)       /*!< NMIST (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMISR_BUSST_Pos            (12UL)         /*!< BUSST (Bit 12)                                        */
 #define R_ICU_NMISR_BUSST_Msk            (0x1000UL)     /*!< BUSST (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMISR_CMST_Pos             (13UL)         /*!< CMST (Bit 13)                                         */
 #define R_ICU_NMISR_CMST_Msk             (0x2000UL)     /*!< CMST (Bitfield-Mask: 0x01)                            */
 #define R_ICU_NMISR_LUST_Pos             (15UL)         /*!< LUST (Bit 15)                                         */
 #define R_ICU_NMISR_LUST_Msk             (0x8000UL)     /*!< LUST (Bitfield-Mask: 0x01)                            */
/* =========================================================  WUPEN  ========================================================= */
 #define R_ICU_WUPEN_IRQWUPEN0_Pos        (0UL)          /*!< IRQWUPEN0 (Bit 0)                                     */
 #define R_ICU_WUPEN_IRQWUPEN0_Msk        (0x1UL)        /*!< IRQWUPEN0 (Bitfield-Mask: 0x01)                       */
 #define R_ICU_WUPEN_IRQWUPEN1_Pos        (1UL)          /*!< IRQWUPEN1 (Bit 1)                                     */
 #define R_ICU_WUPEN_IRQWUPEN1_Msk        (0x2UL)        /*!< IRQWUPEN1 (Bitfield-Mask: 0x01)                       */
 #define R_ICU_WUPEN_IRQWUPEN2_Pos        (2UL)          /*!< IRQWUPEN2 (Bit 2)                                     */
 #define R_ICU_WUPEN_IRQWUPEN2_Msk        (0x4UL)        /*!< IRQWUPEN2 (Bitfield-Mask: 0x01)                       */
 #define R_ICU_WUPEN_IRQWUPEN3_Pos        (3UL)          /*!< IRQWUPEN3 (Bit 3)                                     */
 #define R_ICU_WUPEN_IRQWUPEN3_Msk        (0x8UL)        /*!< IRQWUPEN3 (Bitfield-Mask: 0x01)                       */
 #define R_ICU_WUPEN_IRQWUPEN4_Pos        (4UL)          /*!< IRQWUPEN4 (Bit 4)                                     */
 #define R_ICU_WUPEN_IRQWUPEN4_Msk        (0x10UL)       /*!< IRQWUPEN4 (Bitfield-Mask: 0x01)                       */
 #define R_ICU_WUPEN_IRQWUPEN5_Pos        (5UL)          /*!< IRQWUPEN5 (Bit 5)                                     */
 #define R_ICU_WUPEN_IRQWUPEN5_Msk        (0x20UL)       /*!< IRQWUPEN5 (Bitfield-Mask: 0x01)                       */
 #define R_ICU_WUPEN_IRQWUPEN6_Pos        (6UL)          /*!< IRQWUPEN6 (Bit 6)                                     */
 #define R_ICU_WUPEN_IRQWUPEN6_Msk        (0x40UL)       /*!< IRQWUPEN6 (Bitfield-Mask: 0x01)                       */
 #define R_ICU_WUPEN_IRQWUPEN7_Pos        (7UL)          /*!< IRQWUPEN7 (Bit 7)                                     */
 #define R_ICU_WUPEN_IRQWUPEN7_Msk        (0x80UL)       /*!< IRQWUPEN7 (Bitfield-Mask: 0x01)                       */
 #define R_ICU_WUPEN_IRQWUPEN8_Pos        (8UL)          /*!< IRQWUPEN8 (Bit 8)                                     */
 #define R_ICU_WUPEN_IRQWUPEN8_Msk        (0x100UL)      /*!< IRQWUPEN8 (Bitfield-Mask: 0x01)                       */
 #define R_ICU_WUPEN_IRQWUPEN9_Pos        (9UL)          /*!< IRQWUPEN9 (Bit 9)                                     */
 #define R_ICU_WUPEN_IRQWUPEN9_Msk        (0x200UL)      /*!< IRQWUPEN9 (Bitfield-Mask: 0x01)                       */
 #define R_ICU_WUPEN_IRQWUPEN10_Pos       (10UL)         /*!< IRQWUPEN10 (Bit 10)                                   */
 #define R_ICU_WUPEN_IRQWUPEN10_Msk       (0x400UL)      /*!< IRQWUPEN10 (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN_IRQWUPEN11_Pos       (11UL)         /*!< IRQWUPEN11 (Bit 11)                                   */
 #define R_ICU_WUPEN_IRQWUPEN11_Msk       (0x800UL)      /*!< IRQWUPEN11 (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN_IRQWUPEN12_Pos       (12UL)         /*!< IRQWUPEN12 (Bit 12)                                   */
 #define R_ICU_WUPEN_IRQWUPEN12_Msk       (0x1000UL)     /*!< IRQWUPEN12 (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN_IRQWUPEN13_Pos       (13UL)         /*!< IRQWUPEN13 (Bit 13)                                   */
 #define R_ICU_WUPEN_IRQWUPEN13_Msk       (0x2000UL)     /*!< IRQWUPEN13 (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN_IRQWUPEN14_Pos       (14UL)         /*!< IRQWUPEN14 (Bit 14)                                   */
 #define R_ICU_WUPEN_IRQWUPEN14_Msk       (0x4000UL)     /*!< IRQWUPEN14 (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN_IRQWUPEN15_Pos       (15UL)         /*!< IRQWUPEN15 (Bit 15)                                   */
 #define R_ICU_WUPEN_IRQWUPEN15_Msk       (0x8000UL)     /*!< IRQWUPEN15 (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN_IWDTWUPEN_Pos        (16UL)         /*!< IWDTWUPEN (Bit 16)                                    */
 #define R_ICU_WUPEN_IWDTWUPEN_Msk        (0x10000UL)    /*!< IWDTWUPEN (Bitfield-Mask: 0x01)                       */
 #define R_ICU_WUPEN_LVD1WUPEN_Pos        (18UL)         /*!< LVD1WUPEN (Bit 18)                                    */
 #define R_ICU_WUPEN_LVD1WUPEN_Msk        (0x40000UL)    /*!< LVD1WUPEN (Bitfield-Mask: 0x01)                       */
 #define R_ICU_WUPEN_LVD2WUPEN_Pos        (19UL)         /*!< LVD2WUPEN (Bit 19)                                    */
 #define R_ICU_WUPEN_LVD2WUPEN_Msk        (0x80000UL)    /*!< LVD2WUPEN (Bitfield-Mask: 0x01)                       */
 #define R_ICU_WUPEN_VBATTWUPEN_Pos       (20UL)         /*!< VBATTWUPEN (Bit 20)                                   */
 #define R_ICU_WUPEN_VBATTWUPEN_Msk       (0x100000UL)   /*!< VBATTWUPEN (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN_RTCALMWUPEN_Pos      (24UL)         /*!< RTCALMWUPEN (Bit 24)                                  */
 #define R_ICU_WUPEN_RTCALMWUPEN_Msk      (0x1000000UL)  /*!< RTCALMWUPEN (Bitfield-Mask: 0x01)                     */
 #define R_ICU_WUPEN_RTCPRDWUPEN_Pos      (25UL)         /*!< RTCPRDWUPEN (Bit 25)                                  */
 #define R_ICU_WUPEN_RTCPRDWUPEN_Msk      (0x2000000UL)  /*!< RTCPRDWUPEN (Bitfield-Mask: 0x01)                     */
 #define R_ICU_WUPEN_USBHSWUPEN_Pos       (26UL)         /*!< USBHSWUPEN (Bit 26)                                   */
 #define R_ICU_WUPEN_USBHSWUPEN_Msk       (0x4000000UL)  /*!< USBHSWUPEN (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN_USBFSWUPEN_Pos       (27UL)         /*!< USBFSWUPEN (Bit 27)                                   */
 #define R_ICU_WUPEN_USBFSWUPEN_Msk       (0x8000000UL)  /*!< USBFSWUPEN (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN_AGT1UDWUPEN_Pos      (28UL)         /*!< AGT1UDWUPEN (Bit 28)                                  */
 #define R_ICU_WUPEN_AGT1UDWUPEN_Msk      (0x10000000UL) /*!< AGT1UDWUPEN (Bitfield-Mask: 0x01)                     */
 #define R_ICU_WUPEN_AGT1CAWUPEN_Pos      (29UL)         /*!< AGT1CAWUPEN (Bit 29)                                  */
 #define R_ICU_WUPEN_AGT1CAWUPEN_Msk      (0x20000000UL) /*!< AGT1CAWUPEN (Bitfield-Mask: 0x01)                     */
 #define R_ICU_WUPEN_AGT1CBWUPEN_Pos      (30UL)         /*!< AGT1CBWUPEN (Bit 30)                                  */
 #define R_ICU_WUPEN_AGT1CBWUPEN_Msk      (0x40000000UL) /*!< AGT1CBWUPEN (Bitfield-Mask: 0x01)                     */
 #define R_ICU_WUPEN_RIIC0WUPEN_Pos       (31UL)         /*!< RIIC0WUPEN (Bit 31)                                   */
 #define R_ICU_WUPEN_RIIC0WUPEN_Msk       (0x80000000UL) /*!< RIIC0WUPEN (Bitfield-Mask: 0x01)                      */
/* ========================================================  WUPEN1  ========================================================= */
 #define R_ICU_WUPEN1_COMPHS0WUPEN_Pos    (3UL)          /*!< COMPHS0WUPEN (Bit 3)                                  */
 #define R_ICU_WUPEN1_COMPHS0WUPEN_Msk    (0x8UL)        /*!< COMPHS0WUPEN (Bitfield-Mask: 0x01)                    */
 #define R_ICU_WUPEN1_ULP0UWUPEN_Pos      (8UL)          /*!< ULP0UWUPEN (Bit 8)                                    */
 #define R_ICU_WUPEN1_ULP0UWUPEN_Msk      (0x100UL)      /*!< ULP0UWUPEN (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN1_ULP0AWUPEN_Pos      (9UL)          /*!< ULP0AWUPEN (Bit 9)                                    */
 #define R_ICU_WUPEN1_ULP0AWUPEN_Msk      (0x200UL)      /*!< ULP0AWUPEN (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN1_ULP0BWUPEN_Pos      (10UL)         /*!< ULP0BWUPEN (Bit 10)                                   */
 #define R_ICU_WUPEN1_ULP0BWUPEN_Msk      (0x400UL)      /*!< ULP0BWUPEN (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN1_I3CWUPEN_Pos        (11UL)         /*!< I3CWUPEN (Bit 11)                                     */
 #define R_ICU_WUPEN1_I3CWUPEN_Msk        (0x800UL)      /*!< I3CWUPEN (Bitfield-Mask: 0x01)                        */
 #define R_ICU_WUPEN1_ULP1UWUPEN_Pos      (12UL)         /*!< ULP1UWUPEN (Bit 12)                                   */
 #define R_ICU_WUPEN1_ULP1UWUPEN_Msk      (0x1000UL)     /*!< ULP1UWUPEN (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN1_ULP1AWUPEN_Pos      (13UL)         /*!< ULP1AWUPEN (Bit 13)                                   */
 #define R_ICU_WUPEN1_ULP1AWUPEN_Msk      (0x2000UL)     /*!< ULP1AWUPEN (Bitfield-Mask: 0x01)                      */
 #define R_ICU_WUPEN1_ULP1BWUPEN_Pos      (14UL)         /*!< ULP1BWUPEN (Bit 14)                                   */
 #define R_ICU_WUPEN1_ULP1BWUPEN_Msk      (0x4000UL)     /*!< ULP1BWUPEN (Bitfield-Mask: 0x01)                      */
/* =========================================================  IELSR  ========================================================= */
 #define R_ICU_IELSR_DTCE_Pos             (24UL)         /*!< DTCE (Bit 24)                                         */
 #define R_ICU_IELSR_DTCE_Msk             (0x1000000UL)  /*!< DTCE (Bitfield-Mask: 0x01)                            */
 #define R_ICU_IELSR_IR_Pos               (16UL)         /*!< IR (Bit 16)                                           */
 #define R_ICU_IELSR_IR_Msk               (0x10000UL)    /*!< IR (Bitfield-Mask: 0x01)                              */
 #define R_ICU_IELSR_IELS_Pos             (0UL)          /*!< IELS (Bit 0)                                          */
 #define R_ICU_IELSR_IELS_Msk             (0x1ffUL)      /*!< IELS (Bitfield-Mask: 0x1ff)                           */

/* =========================================================================================================================== */
/* ================                                          R_IIC0                                           ================ */
/* =========================================================================================================================== */

