MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHECFC/mcu.h
 #define R_SYSTEM_VBTBKR76_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR77  ======================================================== */
 #define R_SYSTEM_VBTBKR77_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR77_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR78  ======================================================== */
 #define R_SYSTEM_VBTBKR78_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR78_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR79  ======================================================== */
 #define R_SYSTEM_VBTBKR79_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR79_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR80  ======================================================== */
 #define R_SYSTEM_VBTBKR80_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR80_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR81  ======================================================== */
 #define R_SYSTEM_VBTBKR81_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR81_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR82  ======================================================== */
 #define R_SYSTEM_VBTBKR82_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR82_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR83  ======================================================== */
 #define R_SYSTEM_VBTBKR83_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR83_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR84  ======================================================== */
 #define R_SYSTEM_VBTBKR84_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR84_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR85  ======================================================== */
 #define R_SYSTEM_VBTBKR85_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR85_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR86  ======================================================== */
 #define R_SYSTEM_VBTBKR86_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR86_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR87  ======================================================== */
 #define R_SYSTEM_VBTBKR87_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR87_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR88  ======================================================== */
 #define R_SYSTEM_VBTBKR88_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR88_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR89  ======================================================== */
 #define R_SYSTEM_VBTBKR89_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR89_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR90  ======================================================== */
 #define R_SYSTEM_VBTBKR90_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR90_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR91  ======================================================== */
 #define R_SYSTEM_VBTBKR91_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR91_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR92  ======================================================== */
 #define R_SYSTEM_VBTBKR92_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR92_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR93  ======================================================== */
 #define R_SYSTEM_VBTBKR93_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR93_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR94  ======================================================== */
 #define R_SYSTEM_VBTBKR94_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR94_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR95  ======================================================== */
 #define R_SYSTEM_VBTBKR95_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR95_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR96  ======================================================== */
 #define R_SYSTEM_VBTBKR96_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR96_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR97  ======================================================== */
 #define R_SYSTEM_VBTBKR97_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR97_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR98  ======================================================== */
 #define R_SYSTEM_VBTBKR98_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR98_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR99  ======================================================== */
 #define R_SYSTEM_VBTBKR99_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR99_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR100  ======================================================= */
 #define R_SYSTEM_VBTBKR100_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR100_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR101  ======================================================= */
 #define R_SYSTEM_VBTBKR101_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR101_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR102  ======================================================= */
 #define R_SYSTEM_VBTBKR102_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR102_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR103  ======================================================= */
 #define R_SYSTEM_VBTBKR103_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR103_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR104  ======================================================= */
 #define R_SYSTEM_VBTBKR104_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR104_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR105  ======================================================= */
 #define R_SYSTEM_VBTBKR105_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR105_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR106  ======================================================= */
 #define R_SYSTEM_VBTBKR106_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR106_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR107  ======================================================= */
 #define R_SYSTEM_VBTBKR107_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR107_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR108  ======================================================= */
 #define R_SYSTEM_VBTBKR108_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR108_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR109  ======================================================= */
 #define R_SYSTEM_VBTBKR109_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR109_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR110  ======================================================= */
 #define R_SYSTEM_VBTBKR110_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR110_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR111  ======================================================= */
 #define R_SYSTEM_VBTBKR111_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR111_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR112  ======================================================= */
 #define R_SYSTEM_VBTBKR112_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR112_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR113  ======================================================= */
 #define R_SYSTEM_VBTBKR113_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR113_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR114  ======================================================= */
 #define R_SYSTEM_VBTBKR114_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR114_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR115  ======================================================= */
 #define R_SYSTEM_VBTBKR115_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR115_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR116  ======================================================= */
 #define R_SYSTEM_VBTBKR116_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR116_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR117  ======================================================= */
 #define R_SYSTEM_VBTBKR117_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR117_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR118  ======================================================= */
 #define R_SYSTEM_VBTBKR118_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR118_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR119  ======================================================= */
 #define R_SYSTEM_VBTBKR119_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR119_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR120  ======================================================= */
 #define R_SYSTEM_VBTBKR120_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR120_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR121  ======================================================= */
 #define R_SYSTEM_VBTBKR121_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR121_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR122  ======================================================= */
 #define R_SYSTEM_VBTBKR122_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR122_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR123  ======================================================= */
 #define R_SYSTEM_VBTBKR123_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR123_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR124  ======================================================= */
 #define R_SYSTEM_VBTBKR124_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR124_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR125  ======================================================= */
 #define R_SYSTEM_VBTBKR125_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR125_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR126  ======================================================= */
 #define R_SYSTEM_VBTBKR126_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR126_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR127  ======================================================= */
 #define R_SYSTEM_VBTBKR127_VBTBKR_Pos           (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR127_VBTBKR_Msk           (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */

/* =========================================================================================================================== */
/* ================                                         R_TSN_CAL                                         ================ */
/* =========================================================================================================================== */

/* =========================================================  TSCDR  ========================================================= */
 #define R_TSN_CAL_TSCDR_TSCDR_Pos    (0UL)          /*!< TSCDR (Bit 0)                                         */
 #define R_TSN_CAL_TSCDR_TSCDR_Msk    (0xffffffffUL) /*!< TSCDR (Bitfield-Mask: 0xffffffff)                     */

/* =========================================================================================================================== */
/* ================                                        R_TSN_CTRL                                         ================ */
/* =========================================================================================================================== */

/* =========================================================  TSCR  ========================================================== */
 #define R_TSN_CTRL_TSCR_TSEN_Pos    (7UL)    /*!< TSEN (Bit 7)                                          */
 #define R_TSN_CTRL_TSCR_TSEN_Msk    (0x80UL) /*!< TSEN (Bitfield-Mask: 0x01)                            */
 #define R_TSN_CTRL_TSCR_TSOE_Pos    (4UL)    /*!< TSOE (Bit 4)                                          */
 #define R_TSN_CTRL_TSCR_TSOE_Msk    (0x10UL) /*!< TSOE (Bitfield-Mask: 0x01)                            */

/* =========================================================================================================================== */
/* ================                                         R_USB_FS0                                         ================ */
/* =========================================================================================================================== */

