MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHECFC/mcu.h
 #define R_CEU_CDBYR2_CBYR2_Msk          (0xffffffffUL) /*!< CBYR2 (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CDBCR2  ========================================================= */
 #define R_CEU_CDBCR2_CBCR2_Pos          (0UL)          /*!< CBCR2 (Bit 0)                                         */
 #define R_CEU_CDBCR2_CBCR2_Msk          (0xffffffffUL) /*!< CBCR2 (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  AXIBUSCTL2  ======================================================= */
 #define R_CEU_AXIBUSCTL2_AWCACHE_Pos    (0UL)          /*!< AWCACHE (Bit 0)                                       */
 #define R_CEU_AXIBUSCTL2_AWCACHE_Msk    (0xfUL)        /*!< AWCACHE (Bitfield-Mask: 0x0f)                         */
/* ========================================================  CAMOR_B  ======================================================== */
 #define R_CEU_CAMOR_B_HOFST_Pos         (0UL)          /*!< HOFST (Bit 0)                                         */
 #define R_CEU_CAMOR_B_HOFST_Msk         (0x1fffUL)     /*!< HOFST (Bitfield-Mask: 0x1fff)                         */
 #define R_CEU_CAMOR_B_VOFST_Pos         (16UL)         /*!< VOFST (Bit 16)                                        */
 #define R_CEU_CAMOR_B_VOFST_Msk         (0xfff0000UL)  /*!< VOFST (Bitfield-Mask: 0xfff)                          */
/* ========================================================  CAPWR_B  ======================================================== */
 #define R_CEU_CAPWR_B_HWDTH_Pos         (0UL)          /*!< HWDTH (Bit 0)                                         */
 #define R_CEU_CAPWR_B_HWDTH_Msk         (0x1fffUL)     /*!< HWDTH (Bitfield-Mask: 0x1fff)                         */
 #define R_CEU_CAPWR_B_VWDTH_Pos         (16UL)         /*!< VWDTH (Bit 16)                                        */
 #define R_CEU_CAPWR_B_VWDTH_Msk         (0xfff0000UL)  /*!< VWDTH (Bitfield-Mask: 0xfff)                          */
/* ========================================================  CFLCR_B  ======================================================== */
 #define R_CEU_CFLCR_B_HFRAC_Pos         (0UL)          /*!< HFRAC (Bit 0)                                         */
 #define R_CEU_CFLCR_B_HFRAC_Msk         (0xfffUL)      /*!< HFRAC (Bitfield-Mask: 0xfff)                          */
 #define R_CEU_CFLCR_B_HMANT_Pos         (12UL)         /*!< HMANT (Bit 12)                                        */
 #define R_CEU_CFLCR_B_HMANT_Msk         (0xf000UL)     /*!< HMANT (Bitfield-Mask: 0x0f)                           */
 #define R_CEU_CFLCR_B_VFRAC_Pos         (16UL)         /*!< VFRAC (Bit 16)                                        */
 #define R_CEU_CFLCR_B_VFRAC_Msk         (0xfff0000UL)  /*!< VFRAC (Bitfield-Mask: 0xfff)                          */
 #define R_CEU_CFLCR_B_VMANT_Pos         (28UL)         /*!< VMANT (Bit 28)                                        */
 #define R_CEU_CFLCR_B_VMANT_Msk         (0xf0000000UL) /*!< VMANT (Bitfield-Mask: 0x0f)                           */
/* ========================================================  CFSZR_B  ======================================================== */
 #define R_CEU_CFSZR_B_HFCLP_Pos         (0UL)          /*!< HFCLP (Bit 0)                                         */
 #define R_CEU_CFSZR_B_HFCLP_Msk         (0xfffUL)      /*!< HFCLP (Bitfield-Mask: 0xfff)                          */
 #define R_CEU_CFSZR_B_VFCLP_Pos         (16UL)         /*!< VFCLP (Bit 16)                                        */
 #define R_CEU_CFSZR_B_VFCLP_Msk         (0xfff0000UL)  /*!< VFCLP (Bitfield-Mask: 0xfff)                          */
/* ========================================================  CDWDR_B  ======================================================== */
 #define R_CEU_CDWDR_B_CHDW_Pos          (0UL)          /*!< CHDW (Bit 0)                                          */
 #define R_CEU_CDWDR_B_CHDW_Msk          (0x1fffUL)     /*!< CHDW (Bitfield-Mask: 0x1fff)                          */
/* ========================================================  CDAYR_B  ======================================================== */
 #define R_CEU_CDAYR_B_CAYR_Pos          (0UL)          /*!< CAYR (Bit 0)                                          */
 #define R_CEU_CDAYR_B_CAYR_Msk          (0xffffffffUL) /*!< CAYR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  CDACR_B  ======================================================== */
 #define R_CEU_CDACR_B_CACR_Pos          (0UL)          /*!< CACR (Bit 0)                                          */
 #define R_CEU_CDACR_B_CACR_Msk          (0xffffffffUL) /*!< CACR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  CDBYR_B  ======================================================== */
 #define R_CEU_CDBYR_B_CBYR_Pos          (0UL)          /*!< CBYR (Bit 0)                                          */
 #define R_CEU_CDBYR_B_CBYR_Msk          (0xffffffffUL) /*!< CBYR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  CDBCR_B  ======================================================== */
 #define R_CEU_CDBCR_B_CBCR_Pos          (0UL)          /*!< CBCR (Bit 0)                                          */
 #define R_CEU_CDBCR_B_CBCR_Msk          (0xffffffffUL) /*!< CBCR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  CBDSR_B  ======================================================== */
 #define R_CEU_CBDSR_B_CBVS_Pos          (0UL)          /*!< CBVS (Bit 0)                                          */
 #define R_CEU_CBDSR_B_CBVS_Msk          (0x7fffffUL)   /*!< CBVS (Bitfield-Mask: 0x7fffff)                        */
/* ========================================================  CLFCR_B  ======================================================== */
 #define R_CEU_CLFCR_B_LPF_Pos           (0UL)          /*!< LPF (Bit 0)                                           */
 #define R_CEU_CLFCR_B_LPF_Msk           (0x1UL)        /*!< LPF (Bitfield-Mask: 0x01)                             */
/* ========================================================  CDOCR_B  ======================================================== */
 #define R_CEU_CDOCR_B_COBS_Pos          (0UL)          /*!< COBS (Bit 0)                                          */
 #define R_CEU_CDOCR_B_COBS_Msk          (0x1UL)        /*!< COBS (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CDOCR_B_COWS_Pos          (1UL)          /*!< COWS (Bit 1)                                          */
 #define R_CEU_CDOCR_B_COWS_Msk          (0x2UL)        /*!< COWS (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CDOCR_B_COLS_Pos          (2UL)          /*!< COLS (Bit 2)                                          */
 #define R_CEU_CDOCR_B_COLS_Msk          (0x4UL)        /*!< COLS (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CDOCR_B_CDS_Pos           (4UL)          /*!< CDS (Bit 4)                                           */
 #define R_CEU_CDOCR_B_CDS_Msk           (0x10UL)       /*!< CDS (Bitfield-Mask: 0x01)                             */
 #define R_CEU_CDOCR_B_CBE_Pos           (16UL)         /*!< CBE (Bit 16)                                          */
 #define R_CEU_CDOCR_B_CBE_Msk           (0x10000UL)    /*!< CBE (Bitfield-Mask: 0x01)                             */
/* =======================================================  CDAYR2_B  ======================================================== */
 #define R_CEU_CDAYR2_B_CAYR2_Pos        (0UL)          /*!< CAYR2 (Bit 0)                                         */
 #define R_CEU_CDAYR2_B_CAYR2_Msk        (0xffffffffUL) /*!< CAYR2 (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CDACR2_B  ======================================================== */
 #define R_CEU_CDACR2_B_CACR2_Pos        (0UL)          /*!< CACR2 (Bit 0)                                         */
 #define R_CEU_CDACR2_B_CACR2_Msk        (0xffffffffUL) /*!< CACR2 (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CDBYR2_B  ======================================================== */
 #define R_CEU_CDBYR2_B_CBYR2_Pos        (0UL)          /*!< CBYR2 (Bit 0)                                         */
 #define R_CEU_CDBYR2_B_CBYR2_Msk        (0xffffffffUL) /*!< CBYR2 (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CDBCR2_B  ======================================================== */
 #define R_CEU_CDBCR2_B_CBCR2_Pos        (0UL)          /*!< CBCR2 (Bit 0)                                         */
 #define R_CEU_CDBCR2_B_CBCR2_Msk        (0xffffffffUL) /*!< CBCR2 (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CAMOR_M  ======================================================== */
 #define R_CEU_CAMOR_M_HOFST_Pos         (0UL)          /*!< HOFST (Bit 0)                                         */
 #define R_CEU_CAMOR_M_HOFST_Msk         (0x1fffUL)     /*!< HOFST (Bitfield-Mask: 0x1fff)                         */
 #define R_CEU_CAMOR_M_VOFST_Pos         (16UL)         /*!< VOFST (Bit 16)                                        */
 #define R_CEU_CAMOR_M_VOFST_Msk         (0xfff0000UL)  /*!< VOFST (Bitfield-Mask: 0xfff)                          */
/* ========================================================  CAPWR_M  ======================================================== */
 #define R_CEU_CAPWR_M_HWDTH_Pos         (0UL)          /*!< HWDTH (Bit 0)                                         */
 #define R_CEU_CAPWR_M_HWDTH_Msk         (0x1fffUL)     /*!< HWDTH (Bitfield-Mask: 0x1fff)                         */
 #define R_CEU_CAPWR_M_VWDTH_Pos         (16UL)         /*!< VWDTH (Bit 16)                                        */
 #define R_CEU_CAPWR_M_VWDTH_Msk         (0xfff0000UL)  /*!< VWDTH (Bitfield-Mask: 0xfff)                          */
/* ========================================================  CFLCR_M  ======================================================== */
 #define R_CEU_CFLCR_M_HFRAC_Pos         (0UL)          /*!< HFRAC (Bit 0)                                         */
 #define R_CEU_CFLCR_M_HFRAC_Msk         (0xfffUL)      /*!< HFRAC (Bitfield-Mask: 0xfff)                          */
 #define R_CEU_CFLCR_M_HMANT_Pos         (12UL)         /*!< HMANT (Bit 12)                                        */
 #define R_CEU_CFLCR_M_HMANT_Msk         (0xf000UL)     /*!< HMANT (Bitfield-Mask: 0x0f)                           */
 #define R_CEU_CFLCR_M_VFRAC_Pos         (16UL)         /*!< VFRAC (Bit 16)                                        */
 #define R_CEU_CFLCR_M_VFRAC_Msk         (0xfff0000UL)  /*!< VFRAC (Bitfield-Mask: 0xfff)                          */
 #define R_CEU_CFLCR_M_VMANT_Pos         (28UL)         /*!< VMANT (Bit 28)                                        */
 #define R_CEU_CFLCR_M_VMANT_Msk         (0xf0000000UL) /*!< VMANT (Bitfield-Mask: 0x0f)                           */
/* ========================================================  CFSZR_M  ======================================================== */
 #define R_CEU_CFSZR_M_HFCLP_Pos         (0UL)          /*!< HFCLP (Bit 0)                                         */
 #define R_CEU_CFSZR_M_HFCLP_Msk         (0xfffUL)      /*!< HFCLP (Bitfield-Mask: 0xfff)                          */
 #define R_CEU_CFSZR_M_VFCLP_Pos         (16UL)         /*!< VFCLP (Bit 16)                                        */
 #define R_CEU_CFSZR_M_VFCLP_Msk         (0xfff0000UL)  /*!< VFCLP (Bitfield-Mask: 0xfff)                          */
/* ========================================================  CDWDR_M  ======================================================== */
 #define R_CEU_CDWDR_M_CHDW_Pos          (0UL)          /*!< CHDW (Bit 0)                                          */
 #define R_CEU_CDWDR_M_CHDW_Msk          (0x1fffUL)     /*!< CHDW (Bitfield-Mask: 0x1fff)                          */
/* ========================================================  CDAYR_M  ======================================================== */
 #define R_CEU_CDAYR_M_CAYR_Pos          (0UL)          /*!< CAYR (Bit 0)                                          */
 #define R_CEU_CDAYR_M_CAYR_Msk          (0xffffffffUL) /*!< CAYR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  CDACR_M  ======================================================== */
 #define R_CEU_CDACR_M_CACR_Pos          (0UL)          /*!< CACR (Bit 0)                                          */
 #define R_CEU_CDACR_M_CACR_Msk          (0xffffffffUL) /*!< CACR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  CDBYR_M  ======================================================== */
 #define R_CEU_CDBYR_M_CBYR_Pos          (0UL)          /*!< CBYR (Bit 0)                                          */
 #define R_CEU_CDBYR_M_CBYR_Msk          (0xffffffffUL) /*!< CBYR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  CDBCR_M  ======================================================== */
 #define R_CEU_CDBCR_M_CBCR_Pos          (0UL)          /*!< CBCR (Bit 0)                                          */
 #define R_CEU_CDBCR_M_CBCR_Msk          (0xffffffffUL) /*!< CBCR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  CBDSR_M  ======================================================== */
 #define R_CEU_CBDSR_M_CBVS_Pos          (0UL)          /*!< CBVS (Bit 0)                                          */
 #define R_CEU_CBDSR_M_CBVS_Msk          (0x7fffffUL)   /*!< CBVS (Bitfield-Mask: 0x7fffff)                        */
/* ========================================================  CLFCR_M  ======================================================== */
 #define R_CEU_CLFCR_M_LPF_Pos           (0UL)          /*!< LPF (Bit 0)                                           */
 #define R_CEU_CLFCR_M_LPF_Msk           (0x1UL)        /*!< LPF (Bitfield-Mask: 0x01)                             */
/* ========================================================  CDOCR_M  ======================================================== */
 #define R_CEU_CDOCR_M_COBS_Pos          (0UL)          /*!< COBS (Bit 0)                                          */
 #define R_CEU_CDOCR_M_COBS_Msk          (0x1UL)        /*!< COBS (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CDOCR_M_COWS_Pos          (1UL)          /*!< COWS (Bit 1)                                          */
 #define R_CEU_CDOCR_M_COWS_Msk          (0x2UL)        /*!< COWS (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CDOCR_M_COLS_Pos          (2UL)          /*!< COLS (Bit 2)                                          */
 #define R_CEU_CDOCR_M_COLS_Msk          (0x4UL)        /*!< COLS (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CDOCR_M_CDS_Pos           (4UL)          /*!< CDS (Bit 4)                                           */
 #define R_CEU_CDOCR_M_CDS_Msk           (0x10UL)       /*!< CDS (Bitfield-Mask: 0x01)                             */
 #define R_CEU_CDOCR_M_CBE_Pos           (16UL)         /*!< CBE (Bit 16)                                          */
 #define R_CEU_CDOCR_M_CBE_Msk           (0x10000UL)    /*!< CBE (Bitfield-Mask: 0x01)                             */
/* =======================================================  CDAYR2_M  ======================================================== */
 #define R_CEU_CDAYR2_M_CAYR2_Pos        (0UL)          /*!< CAYR2 (Bit 0)                                         */
 #define R_CEU_CDAYR2_M_CAYR2_Msk        (0xffffffffUL) /*!< CAYR2 (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CDACR2_M  ======================================================== */
 #define R_CEU_CDACR2_M_CACR2_Pos        (0UL)          /*!< CACR2 (Bit 0)                                         */
 #define R_CEU_CDACR2_M_CACR2_Msk        (0xffffffffUL) /*!< CACR2 (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CDBYR2_M  ======================================================== */
 #define R_CEU_CDBYR2_M_CBYR2_Pos        (0UL)          /*!< CBYR2 (Bit 0)                                         */
 #define R_CEU_CDBYR2_M_CBYR2_Msk        (0xffffffffUL) /*!< CBYR2 (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CDBCR2_M  ======================================================== */
 #define R_CEU_CDBCR2_M_CBCR2_Pos        (0UL)          /*!< CBCR2 (Bit 0)                                         */
 #define R_CEU_CDBCR2_M_CBCR2_Msk        (0xffffffffUL) /*!< CBCR2 (Bitfield-Mask: 0xffffffff)                     */

/* =========================================================================================================================== */
/* ================                                          R_ULPT0                                          ================ */
/* =========================================================================================================================== */

