MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHECFC/mcu.h
 #define R_MIPI_DSI_RXRSS0R_RXPFAIL_Pos           (28UL)         /*!< RXPFAIL (Bit 28)                                      */
 #define R_MIPI_DSI_RXRSS0R_RXPFAIL_Msk           (0x10000000UL) /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSS0R_RXCERR_Pos            (29UL)         /*!< RXCERR (Bit 29)                                       */
 #define R_MIPI_DSI_RXRSS0R_RXCERR_Msk            (0x20000000UL) /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS0R_RXAKE_Pos             (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_MIPI_DSI_RXRSS0R_RXAKE_Msk             (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS0R_INFOOW_Pos            (31UL)         /*!< INFOOW (Bit 31)                                       */
 #define R_MIPI_DSI_RXRSS0R_INFOOW_Msk            (0x80000000UL) /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* ========================================================  RXRSS1R  ======================================================== */
 #define R_MIPI_DSI_RXRSS1R_DATA0_Pos             (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS1R_DATA0_Msk             (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXRSS1R_DATA1_Pos             (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_RXRSS1R_DATA1_Msk             (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXRSS1R_DT_Pos                (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_RXRSS1R_DT_Msk                (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_RXRSS1R_VC_Pos                (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_RXRSS1R_VC_Msk                (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_RXRSS1R_FMT_Pos               (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_RXRSS1R_FMT_Msk               (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_RXRSS1R_RXSUC_Pos             (25UL)         /*!< RXSUC (Bit 25)                                        */
 #define R_MIPI_DSI_RXRSS1R_RXSUC_Msk             (0x2000000UL)  /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS1R_RXFERR_Pos            (26UL)         /*!< RXFERR (Bit 26)                                       */
 #define R_MIPI_DSI_RXRSS1R_RXFERR_Msk            (0x4000000UL)  /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS1R_RXFAIL_Pos            (27UL)         /*!< RXFAIL (Bit 27)                                       */
 #define R_MIPI_DSI_RXRSS1R_RXFAIL_Msk            (0x8000000UL)  /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS1R_RXPFAIL_Pos           (28UL)         /*!< RXPFAIL (Bit 28)                                      */
 #define R_MIPI_DSI_RXRSS1R_RXPFAIL_Msk           (0x10000000UL) /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSS1R_RXCERR_Pos            (29UL)         /*!< RXCERR (Bit 29)                                       */
 #define R_MIPI_DSI_RXRSS1R_RXCERR_Msk            (0x20000000UL) /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS1R_RXAKE_Pos             (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_MIPI_DSI_RXRSS1R_RXAKE_Msk             (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS1R_INFOOW_Pos            (31UL)         /*!< INFOOW (Bit 31)                                       */
 #define R_MIPI_DSI_RXRSS1R_INFOOW_Msk            (0x80000000UL) /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* ========================================================  RXRSS2R  ======================================================== */
 #define R_MIPI_DSI_RXRSS2R_DATA0_Pos             (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS2R_DATA0_Msk             (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXRSS2R_DATA1_Pos             (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_RXRSS2R_DATA1_Msk             (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXRSS2R_DT_Pos                (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_RXRSS2R_DT_Msk                (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_RXRSS2R_VC_Pos                (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_RXRSS2R_VC_Msk                (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_RXRSS2R_FMT_Pos               (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_RXRSS2R_FMT_Msk               (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_RXRSS2R_RXSUC_Pos             (25UL)         /*!< RXSUC (Bit 25)                                        */
 #define R_MIPI_DSI_RXRSS2R_RXSUC_Msk             (0x2000000UL)  /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS2R_RXFERR_Pos            (26UL)         /*!< RXFERR (Bit 26)                                       */
 #define R_MIPI_DSI_RXRSS2R_RXFERR_Msk            (0x4000000UL)  /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS2R_RXFAIL_Pos            (27UL)         /*!< RXFAIL (Bit 27)                                       */
 #define R_MIPI_DSI_RXRSS2R_RXFAIL_Msk            (0x8000000UL)  /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS2R_RXPFAIL_Pos           (28UL)         /*!< RXPFAIL (Bit 28)                                      */
 #define R_MIPI_DSI_RXRSS2R_RXPFAIL_Msk           (0x10000000UL) /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSS2R_RXCERR_Pos            (29UL)         /*!< RXCERR (Bit 29)                                       */
 #define R_MIPI_DSI_RXRSS2R_RXCERR_Msk            (0x20000000UL) /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS2R_RXAKE_Pos             (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_MIPI_DSI_RXRSS2R_RXAKE_Msk             (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS2R_INFOOW_Pos            (31UL)         /*!< INFOOW (Bit 31)                                       */
 #define R_MIPI_DSI_RXRSS2R_INFOOW_Msk            (0x80000000UL) /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* ========================================================  RXRSS3R  ======================================================== */
 #define R_MIPI_DSI_RXRSS3R_DATA0_Pos             (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS3R_DATA0_Msk             (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXRSS3R_DATA1_Pos             (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_RXRSS3R_DATA1_Msk             (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXRSS3R_DT_Pos                (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_RXRSS3R_DT_Msk                (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_RXRSS3R_VC_Pos                (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_RXRSS3R_VC_Msk                (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_RXRSS3R_FMT_Pos               (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_RXRSS3R_FMT_Msk               (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_RXRSS3R_RXSUC_Pos             (25UL)         /*!< RXSUC (Bit 25)                                        */
 #define R_MIPI_DSI_RXRSS3R_RXSUC_Msk             (0x2000000UL)  /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS3R_RXFERR_Pos            (26UL)         /*!< RXFERR (Bit 26)                                       */
 #define R_MIPI_DSI_RXRSS3R_RXFERR_Msk            (0x4000000UL)  /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS3R_RXFAIL_Pos            (27UL)         /*!< RXFAIL (Bit 27)                                       */
 #define R_MIPI_DSI_RXRSS3R_RXFAIL_Msk            (0x8000000UL)  /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS3R_RXPFAIL_Pos           (28UL)         /*!< RXPFAIL (Bit 28)                                      */
 #define R_MIPI_DSI_RXRSS3R_RXPFAIL_Msk           (0x10000000UL) /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSS3R_RXCERR_Pos            (29UL)         /*!< RXCERR (Bit 29)                                       */
 #define R_MIPI_DSI_RXRSS3R_RXCERR_Msk            (0x20000000UL) /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS3R_RXAKE_Pos             (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_MIPI_DSI_RXRSS3R_RXAKE_Msk             (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS3R_INFOOW_Pos            (31UL)         /*!< INFOOW (Bit 31)                                       */
 #define R_MIPI_DSI_RXRSS3R_INFOOW_Msk            (0x80000000UL) /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* =======================================================  RXRSS0R_L  ======================================================= */
 #define R_MIPI_DSI_RXRSS0R_L_DATA0_Pos           (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS0R_L_DATA0_Msk           (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXRSS0R_L_DATA1_Pos           (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_RXRSS0R_L_DATA1_Msk           (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =======================================================  RXRSS1R_L  ======================================================= */
 #define R_MIPI_DSI_RXRSS1R_L_DATA0_Pos           (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS1R_L_DATA0_Msk           (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXRSS1R_L_DATA1_Pos           (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_RXRSS1R_L_DATA1_Msk           (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =======================================================  RXRSS2R_L  ======================================================= */
 #define R_MIPI_DSI_RXRSS2R_L_DATA0_Pos           (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS2R_L_DATA0_Msk           (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXRSS2R_L_DATA1_Pos           (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_RXRSS2R_L_DATA1_Msk           (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =======================================================  RXRSS3R_L  ======================================================= */
 #define R_MIPI_DSI_RXRSS3R_L_DATA0_Pos           (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS3R_L_DATA0_Msk           (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXRSS3R_L_DATA1_Pos           (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_RXRSS3R_L_DATA1_Msk           (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ======================================================  RXRSS0R_LL  ======================================================= */
 #define R_MIPI_DSI_RXRSS0R_LL_DATA0_Pos          (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS0R_LL_DATA0_Msk          (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ======================================================  RXRSS1R_LL  ======================================================= */
 #define R_MIPI_DSI_RXRSS1R_LL_DATA0_Pos          (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS1R_LL_DATA0_Msk          (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ======================================================  RXRSS2R_LL  ======================================================= */
 #define R_MIPI_DSI_RXRSS2R_LL_DATA0_Pos          (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS2R_LL_DATA0_Msk          (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ======================================================  RXRSS3R_LL  ======================================================= */
 #define R_MIPI_DSI_RXRSS3R_LL_DATA0_Pos          (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS3R_LL_DATA0_Msk          (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ======================================================  RXRSS0R_LH  ======================================================= */
 #define R_MIPI_DSI_RXRSS0R_LH_DATA1_Pos          (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS0R_LH_DATA1_Msk          (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ======================================================  RXRSS1R_LH  ======================================================= */
 #define R_MIPI_DSI_RXRSS1R_LH_DATA1_Pos          (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS1R_LH_DATA1_Msk          (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ======================================================  RXRSS2R_LH  ======================================================= */
 #define R_MIPI_DSI_RXRSS2R_LH_DATA1_Pos          (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS2R_LH_DATA1_Msk          (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ======================================================  RXRSS3R_LH  ======================================================= */
 #define R_MIPI_DSI_RXRSS3R_LH_DATA1_Pos          (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS3R_LH_DATA1_Msk          (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =======================================================  RXRSS0R_H  ======================================================= */
 #define R_MIPI_DSI_RXRSS0R_H_DT_Pos              (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_RXRSS0R_H_DT_Msk              (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_RXRSS0R_H_VC_Pos              (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_RXRSS0R_H_VC_Msk              (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_RXRSS0R_H_FMT_Pos             (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_RXRSS0R_H_FMT_Msk             (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_RXRSS0R_H_RXSUC_Pos           (9UL)          /*!< RXSUC (Bit 9)                                         */
 #define R_MIPI_DSI_RXRSS0R_H_RXSUC_Msk           (0x200UL)      /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS0R_H_RXFERR_Pos          (10UL)         /*!< RXFERR (Bit 10)                                       */
 #define R_MIPI_DSI_RXRSS0R_H_RXFERR_Msk          (0x400UL)      /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS0R_H_RXFAIL_Pos          (11UL)         /*!< RXFAIL (Bit 11)                                       */
 #define R_MIPI_DSI_RXRSS0R_H_RXFAIL_Msk          (0x800UL)      /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS0R_H_RXPFAIL_Pos         (12UL)         /*!< RXPFAIL (Bit 12)                                      */
 #define R_MIPI_DSI_RXRSS0R_H_RXPFAIL_Msk         (0x1000UL)     /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSS0R_H_RXCERR_Pos          (13UL)         /*!< RXCERR (Bit 13)                                       */
 #define R_MIPI_DSI_RXRSS0R_H_RXCERR_Msk          (0x2000UL)     /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS0R_H_RXAKE_Pos           (14UL)         /*!< RXAKE (Bit 14)                                        */
 #define R_MIPI_DSI_RXRSS0R_H_RXAKE_Msk           (0x4000UL)     /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS0R_H_INFOOW_Pos          (15UL)         /*!< INFOOW (Bit 15)                                       */
 #define R_MIPI_DSI_RXRSS0R_H_INFOOW_Msk          (0x8000UL)     /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* =======================================================  RXRSS1R_H  ======================================================= */
 #define R_MIPI_DSI_RXRSS1R_H_DT_Pos              (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_RXRSS1R_H_DT_Msk              (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_RXRSS1R_H_VC_Pos              (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_RXRSS1R_H_VC_Msk              (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_RXRSS1R_H_FMT_Pos             (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_RXRSS1R_H_FMT_Msk             (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_RXRSS1R_H_RXSUC_Pos           (9UL)          /*!< RXSUC (Bit 9)                                         */
 #define R_MIPI_DSI_RXRSS1R_H_RXSUC_Msk           (0x200UL)      /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS1R_H_RXFERR_Pos          (10UL)         /*!< RXFERR (Bit 10)                                       */
 #define R_MIPI_DSI_RXRSS1R_H_RXFERR_Msk          (0x400UL)      /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS1R_H_RXFAIL_Pos          (11UL)         /*!< RXFAIL (Bit 11)                                       */
 #define R_MIPI_DSI_RXRSS1R_H_RXFAIL_Msk          (0x800UL)      /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS1R_H_RXPFAIL_Pos         (12UL)         /*!< RXPFAIL (Bit 12)                                      */
 #define R_MIPI_DSI_RXRSS1R_H_RXPFAIL_Msk         (0x1000UL)     /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSS1R_H_RXCERR_Pos          (13UL)         /*!< RXCERR (Bit 13)                                       */
 #define R_MIPI_DSI_RXRSS1R_H_RXCERR_Msk          (0x2000UL)     /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS1R_H_RXAKE_Pos           (14UL)         /*!< RXAKE (Bit 14)                                        */
 #define R_MIPI_DSI_RXRSS1R_H_RXAKE_Msk           (0x4000UL)     /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS1R_H_INFOOW_Pos          (15UL)         /*!< INFOOW (Bit 15)                                       */
 #define R_MIPI_DSI_RXRSS1R_H_INFOOW_Msk          (0x8000UL)     /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* =======================================================  RXRSS2R_H  ======================================================= */
 #define R_MIPI_DSI_RXRSS2R_H_DT_Pos              (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_RXRSS2R_H_DT_Msk              (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_RXRSS2R_H_VC_Pos              (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_RXRSS2R_H_VC_Msk              (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_RXRSS2R_H_FMT_Pos             (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_RXRSS2R_H_FMT_Msk             (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_RXRSS2R_H_RXSUC_Pos           (9UL)          /*!< RXSUC (Bit 9)                                         */
 #define R_MIPI_DSI_RXRSS2R_H_RXSUC_Msk           (0x200UL)      /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS2R_H_RXFERR_Pos          (10UL)         /*!< RXFERR (Bit 10)                                       */
 #define R_MIPI_DSI_RXRSS2R_H_RXFERR_Msk          (0x400UL)      /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS2R_H_RXFAIL_Pos          (11UL)         /*!< RXFAIL (Bit 11)                                       */
 #define R_MIPI_DSI_RXRSS2R_H_RXFAIL_Msk          (0x800UL)      /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS2R_H_RXPFAIL_Pos         (12UL)         /*!< RXPFAIL (Bit 12)                                      */
 #define R_MIPI_DSI_RXRSS2R_H_RXPFAIL_Msk         (0x1000UL)     /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSS2R_H_RXCERR_Pos          (13UL)         /*!< RXCERR (Bit 13)                                       */
 #define R_MIPI_DSI_RXRSS2R_H_RXCERR_Msk          (0x2000UL)     /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS2R_H_RXAKE_Pos           (14UL)         /*!< RXAKE (Bit 14)                                        */
 #define R_MIPI_DSI_RXRSS2R_H_RXAKE_Msk           (0x4000UL)     /*!< RXAKE (Bitfield-Mask: 0x01)                           */
