MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHECFC/mcu.h
 #define R_MIPI_DSI_RXRSS2R_H_INFOOW_Pos          (15UL)         /*!< INFOOW (Bit 15)                                       */
 #define R_MIPI_DSI_RXRSS2R_H_INFOOW_Msk          (0x8000UL)     /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* =======================================================  RXRSS3R_H  ======================================================= */
 #define R_MIPI_DSI_RXRSS3R_H_DT_Pos              (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_RXRSS3R_H_DT_Msk              (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_RXRSS3R_H_VC_Pos              (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_RXRSS3R_H_VC_Msk              (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_RXRSS3R_H_FMT_Pos             (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_RXRSS3R_H_FMT_Msk             (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_RXRSS3R_H_RXSUC_Pos           (9UL)          /*!< RXSUC (Bit 9)                                         */
 #define R_MIPI_DSI_RXRSS3R_H_RXSUC_Msk           (0x200UL)      /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS3R_H_RXFERR_Pos          (10UL)         /*!< RXFERR (Bit 10)                                       */
 #define R_MIPI_DSI_RXRSS3R_H_RXFERR_Msk          (0x400UL)      /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS3R_H_RXFAIL_Pos          (11UL)         /*!< RXFAIL (Bit 11)                                       */
 #define R_MIPI_DSI_RXRSS3R_H_RXFAIL_Msk          (0x800UL)      /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS3R_H_RXPFAIL_Pos         (12UL)         /*!< RXPFAIL (Bit 12)                                      */
 #define R_MIPI_DSI_RXRSS3R_H_RXPFAIL_Msk         (0x1000UL)     /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSS3R_H_RXCERR_Pos          (13UL)         /*!< RXCERR (Bit 13)                                       */
 #define R_MIPI_DSI_RXRSS3R_H_RXCERR_Msk          (0x2000UL)     /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS3R_H_RXAKE_Pos           (14UL)         /*!< RXAKE (Bit 14)                                        */
 #define R_MIPI_DSI_RXRSS3R_H_RXAKE_Msk           (0x4000UL)     /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS3R_H_INFOOW_Pos          (15UL)         /*!< INFOOW (Bit 15)                                       */
 #define R_MIPI_DSI_RXRSS3R_H_INFOOW_Msk          (0x8000UL)     /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* ======================================================  RXRSS0R_HL  ======================================================= */
 #define R_MIPI_DSI_RXRSS0R_HL_DT_Pos             (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_RXRSS0R_HL_DT_Msk             (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_RXRSS0R_HL_VC_Pos             (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_RXRSS0R_HL_VC_Msk             (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ======================================================  RXRSS1R_HL  ======================================================= */
 #define R_MIPI_DSI_RXRSS1R_HL_DT_Pos             (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_RXRSS1R_HL_DT_Msk             (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_RXRSS1R_HL_VC_Pos             (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_RXRSS1R_HL_VC_Msk             (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ======================================================  RXRSS2R_HL  ======================================================= */
 #define R_MIPI_DSI_RXRSS2R_HL_DT_Pos             (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_RXRSS2R_HL_DT_Msk             (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_RXRSS2R_HL_VC_Pos             (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_RXRSS2R_HL_VC_Msk             (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ======================================================  RXRSS3R_HL  ======================================================= */
 #define R_MIPI_DSI_RXRSS3R_HL_DT_Pos             (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_RXRSS3R_HL_DT_Msk             (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_RXRSS3R_HL_VC_Pos             (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_RXRSS3R_HL_VC_Msk             (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ======================================================  RXRSS0R_HH  ======================================================= */
 #define R_MIPI_DSI_RXRSS0R_HH_FMT_Pos            (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_RXRSS0R_HH_FMT_Msk            (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_RXRSS0R_HH_RXSUC_Pos          (1UL)          /*!< RXSUC (Bit 1)                                         */
 #define R_MIPI_DSI_RXRSS0R_HH_RXSUC_Msk          (0x2UL)        /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS0R_HH_RXFERR_Pos         (2UL)          /*!< RXFERR (Bit 2)                                        */
 #define R_MIPI_DSI_RXRSS0R_HH_RXFERR_Msk         (0x4UL)        /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS0R_HH_RXFAIL_Pos         (3UL)          /*!< RXFAIL (Bit 3)                                        */
 #define R_MIPI_DSI_RXRSS0R_HH_RXFAIL_Msk         (0x8UL)        /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS0R_HH_RXPFAIL_Pos        (4UL)          /*!< RXPFAIL (Bit 4)                                       */
 #define R_MIPI_DSI_RXRSS0R_HH_RXPFAIL_Msk        (0x10UL)       /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSS0R_HH_RXCERR_Pos         (5UL)          /*!< RXCERR (Bit 5)                                        */
 #define R_MIPI_DSI_RXRSS0R_HH_RXCERR_Msk         (0x20UL)       /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS0R_HH_RXAKE_Pos          (6UL)          /*!< RXAKE (Bit 6)                                         */
 #define R_MIPI_DSI_RXRSS0R_HH_RXAKE_Msk          (0x40UL)       /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS0R_HH_INFOOW_Pos         (7UL)          /*!< INFOOW (Bit 7)                                        */
 #define R_MIPI_DSI_RXRSS0R_HH_INFOOW_Msk         (0x80UL)       /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* ======================================================  RXRSS1R_HH  ======================================================= */
 #define R_MIPI_DSI_RXRSS1R_HH_FMT_Pos            (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_RXRSS1R_HH_FMT_Msk            (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_RXRSS1R_HH_RXSUC_Pos          (1UL)          /*!< RXSUC (Bit 1)                                         */
 #define R_MIPI_DSI_RXRSS1R_HH_RXSUC_Msk          (0x2UL)        /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS1R_HH_RXFERR_Pos         (2UL)          /*!< RXFERR (Bit 2)                                        */
 #define R_MIPI_DSI_RXRSS1R_HH_RXFERR_Msk         (0x4UL)        /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS1R_HH_RXFAIL_Pos         (3UL)          /*!< RXFAIL (Bit 3)                                        */
 #define R_MIPI_DSI_RXRSS1R_HH_RXFAIL_Msk         (0x8UL)        /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS1R_HH_RXPFAIL_Pos        (4UL)          /*!< RXPFAIL (Bit 4)                                       */
 #define R_MIPI_DSI_RXRSS1R_HH_RXPFAIL_Msk        (0x10UL)       /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSS1R_HH_RXCERR_Pos         (5UL)          /*!< RXCERR (Bit 5)                                        */
 #define R_MIPI_DSI_RXRSS1R_HH_RXCERR_Msk         (0x20UL)       /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS1R_HH_RXAKE_Pos          (6UL)          /*!< RXAKE (Bit 6)                                         */
 #define R_MIPI_DSI_RXRSS1R_HH_RXAKE_Msk          (0x40UL)       /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS1R_HH_INFOOW_Pos         (7UL)          /*!< INFOOW (Bit 7)                                        */
 #define R_MIPI_DSI_RXRSS1R_HH_INFOOW_Msk         (0x80UL)       /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* ======================================================  RXRSS2R_HH  ======================================================= */
 #define R_MIPI_DSI_RXRSS2R_HH_FMT_Pos            (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_RXRSS2R_HH_FMT_Msk            (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_RXRSS2R_HH_RXSUC_Pos          (1UL)          /*!< RXSUC (Bit 1)                                         */
 #define R_MIPI_DSI_RXRSS2R_HH_RXSUC_Msk          (0x2UL)        /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS2R_HH_RXFERR_Pos         (2UL)          /*!< RXFERR (Bit 2)                                        */
 #define R_MIPI_DSI_RXRSS2R_HH_RXFERR_Msk         (0x4UL)        /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS2R_HH_RXFAIL_Pos         (3UL)          /*!< RXFAIL (Bit 3)                                        */
 #define R_MIPI_DSI_RXRSS2R_HH_RXFAIL_Msk         (0x8UL)        /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS2R_HH_RXPFAIL_Pos        (4UL)          /*!< RXPFAIL (Bit 4)                                       */
 #define R_MIPI_DSI_RXRSS2R_HH_RXPFAIL_Msk        (0x10UL)       /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSS2R_HH_RXCERR_Pos         (5UL)          /*!< RXCERR (Bit 5)                                        */
 #define R_MIPI_DSI_RXRSS2R_HH_RXCERR_Msk         (0x20UL)       /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS2R_HH_RXAKE_Pos          (6UL)          /*!< RXAKE (Bit 6)                                         */
 #define R_MIPI_DSI_RXRSS2R_HH_RXAKE_Msk          (0x40UL)       /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS2R_HH_INFOOW_Pos         (7UL)          /*!< INFOOW (Bit 7)                                        */
 #define R_MIPI_DSI_RXRSS2R_HH_INFOOW_Msk         (0x80UL)       /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* ======================================================  RXRSS3R_HH  ======================================================= */
 #define R_MIPI_DSI_RXRSS3R_HH_FMT_Pos            (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_RXRSS3R_HH_FMT_Msk            (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_RXRSS3R_HH_RXSUC_Pos          (1UL)          /*!< RXSUC (Bit 1)                                         */
 #define R_MIPI_DSI_RXRSS3R_HH_RXSUC_Msk          (0x2UL)        /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS3R_HH_RXFERR_Pos         (2UL)          /*!< RXFERR (Bit 2)                                        */
 #define R_MIPI_DSI_RXRSS3R_HH_RXFERR_Msk         (0x4UL)        /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS3R_HH_RXFAIL_Pos         (3UL)          /*!< RXFAIL (Bit 3)                                        */
 #define R_MIPI_DSI_RXRSS3R_HH_RXFAIL_Msk         (0x8UL)        /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS3R_HH_RXPFAIL_Pos        (4UL)          /*!< RXPFAIL (Bit 4)                                       */
 #define R_MIPI_DSI_RXRSS3R_HH_RXPFAIL_Msk        (0x10UL)       /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSS3R_HH_RXCERR_Pos         (5UL)          /*!< RXCERR (Bit 5)                                        */
 #define R_MIPI_DSI_RXRSS3R_HH_RXCERR_Msk         (0x20UL)       /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS3R_HH_RXAKE_Pos          (6UL)          /*!< RXAKE (Bit 6)                                         */
 #define R_MIPI_DSI_RXRSS3R_HH_RXAKE_Msk          (0x40UL)       /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS3R_HH_INFOOW_Pos         (7UL)          /*!< INFOOW (Bit 7)                                        */
 #define R_MIPI_DSI_RXRSS3R_HH_INFOOW_Msk         (0x80UL)       /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* ========================================================  RXPPD0R  ======================================================== */
 #define R_MIPI_DSI_RXPPD0R_DATA0_Pos             (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_RXPPD0R_DATA0_Msk             (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXPPD0R_DATA1_Pos             (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_RXPPD0R_DATA1_Msk             (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXPPD0R_DATA2_Pos             (16UL)         /*!< DATA2 (Bit 16)                                        */
 #define R_MIPI_DSI_RXPPD0R_DATA2_Msk             (0xff0000UL)   /*!< DATA2 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXPPD0R_DATA3_Pos             (24UL)         /*!< DATA3 (Bit 24)                                        */
 #define R_MIPI_DSI_RXPPD0R_DATA3_Msk             (0xff000000UL) /*!< DATA3 (Bitfield-Mask: 0xff)                           */
/* ========================================================  RXPPD1R  ======================================================== */
 #define R_MIPI_DSI_RXPPD1R_DATA4_Pos             (0UL)          /*!< DATA4 (Bit 0)                                         */
 #define R_MIPI_DSI_RXPPD1R_DATA4_Msk             (0xffUL)       /*!< DATA4 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXPPD1R_DATA5_Pos             (8UL)          /*!< DATA5 (Bit 8)                                         */
 #define R_MIPI_DSI_RXPPD1R_DATA5_Msk             (0xff00UL)     /*!< DATA5 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXPPD1R_DATA6_Pos             (16UL)         /*!< DATA6 (Bit 16)                                        */
 #define R_MIPI_DSI_RXPPD1R_DATA6_Msk             (0xff0000UL)   /*!< DATA6 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXPPD1R_DATA7_Pos             (24UL)         /*!< DATA7 (Bit 24)                                        */
 #define R_MIPI_DSI_RXPPD1R_DATA7_Msk             (0xff000000UL) /*!< DATA7 (Bitfield-Mask: 0xff)                           */
/* ========================================================  RXPPD2R  ======================================================== */
 #define R_MIPI_DSI_RXPPD2R_DATA8_Pos             (0UL)          /*!< DATA8 (Bit 0)                                         */
 #define R_MIPI_DSI_RXPPD2R_DATA8_Msk             (0xffUL)       /*!< DATA8 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXPPD2R_DATA9_Pos             (8UL)          /*!< DATA9 (Bit 8)                                         */
 #define R_MIPI_DSI_RXPPD2R_DATA9_Msk             (0xff00UL)     /*!< DATA9 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXPPD2R_DATA10_Pos            (16UL)         /*!< DATA10 (Bit 16)                                       */
 #define R_MIPI_DSI_RXPPD2R_DATA10_Msk            (0xff0000UL)   /*!< DATA10 (Bitfield-Mask: 0xff)                          */
 #define R_MIPI_DSI_RXPPD2R_DATA11_Pos            (24UL)         /*!< DATA11 (Bit 24)                                       */
 #define R_MIPI_DSI_RXPPD2R_DATA11_Msk            (0xff000000UL) /*!< DATA11 (Bitfield-Mask: 0xff)                          */
/* ========================================================  RXPPD3R  ======================================================== */
 #define R_MIPI_DSI_RXPPD3R_DATA12_Pos            (0UL)          /*!< DATA12 (Bit 0)                                        */
 #define R_MIPI_DSI_RXPPD3R_DATA12_Msk            (0xffUL)       /*!< DATA12 (Bitfield-Mask: 0xff)                          */
 #define R_MIPI_DSI_RXPPD3R_DATA13_Pos            (8UL)          /*!< DATA13 (Bit 8)                                        */
 #define R_MIPI_DSI_RXPPD3R_DATA13_Msk            (0xff00UL)     /*!< DATA13 (Bitfield-Mask: 0xff)                          */
 #define R_MIPI_DSI_RXPPD3R_DATA14_Pos            (16UL)         /*!< DATA14 (Bit 16)                                       */
 #define R_MIPI_DSI_RXPPD3R_DATA14_Msk            (0xff0000UL)   /*!< DATA14 (Bitfield-Mask: 0xff)                          */
 #define R_MIPI_DSI_RXPPD3R_DATA15_Pos            (24UL)         /*!< DATA15 (Bit 24)                                       */
 #define R_MIPI_DSI_RXPPD3R_DATA15_Msk            (0xff000000UL) /*!< DATA15 (Bitfield-Mask: 0xff)                          */
/* ======================================================  HSTXTOSETR  ======================================================= */
 #define R_MIPI_DSI_HSTXTOSETR_HTXTO_Pos          (0UL)          /*!< HTXTO (Bit 0)                                         */
 #define R_MIPI_DSI_HSTXTOSETR_HTXTO_Msk          (0xffffffffUL) /*!< HTXTO (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  LRXHTOSETR  ======================================================= */
 #define R_MIPI_DSI_LRXHTOSETR_LRXHTO_Pos         (0UL)          /*!< LRXHTO (Bit 0)                                        */
 #define R_MIPI_DSI_LRXHTOSETR_LRXHTO_Msk         (0xffffffffUL) /*!< LRXHTO (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  TATOSETR  ======================================================== */
 #define R_MIPI_DSI_TATOSETR_TATO_Pos             (0UL)          /*!< TATO (Bit 0)                                          */
 #define R_MIPI_DSI_TATOSETR_TATO_Msk             (0xffffffffUL) /*!< TATO (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  FERRSR  ========================================================= */
 #define R_MIPI_DSI_FERRSR_HTXTO_Pos              (0UL)          /*!< HTXTO (Bit 0)                                         */
 #define R_MIPI_DSI_FERRSR_HTXTO_Msk              (0x1UL)        /*!< HTXTO (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_FERRSR_LRXHTO_Pos             (1UL)          /*!< LRXHTO (Bit 1)                                        */
 #define R_MIPI_DSI_FERRSR_LRXHTO_Msk             (0x2UL)        /*!< LRXHTO (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_FERRSR_TATO_Pos               (2UL)          /*!< TATO (Bit 2)                                          */
 #define R_MIPI_DSI_FERRSR_TATO_Msk               (0x4UL)        /*!< TATO (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_FERRSR_ESCENT_Pos             (16UL)         /*!< ESCENT (Bit 16)                                       */
 #define R_MIPI_DSI_FERRSR_ESCENT_Msk             (0x10000UL)    /*!< ESCENT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_FERRSR_SYNCESC_Pos            (17UL)         /*!< SYNCESC (Bit 17)                                      */
 #define R_MIPI_DSI_FERRSR_SYNCESC_Msk            (0x20000UL)    /*!< SYNCESC (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_FERRSR_CTRL_Pos               (18UL)         /*!< CTRL (Bit 18)                                         */
 #define R_MIPI_DSI_FERRSR_CTRL_Msk               (0x40000UL)    /*!< CTRL (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_FERRSR_CLP0_Pos               (19UL)         /*!< CLP0 (Bit 19)                                         */
 #define R_MIPI_DSI_FERRSR_CLP0_Msk               (0x80000UL)    /*!< CLP0 (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_FERRSR_CLP1_Pos               (20UL)         /*!< CLP1 (Bit 20)                                         */
 #define R_MIPI_DSI_FERRSR_CLP1_Msk               (0x100000UL)   /*!< CLP1 (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_FERRSR_CLP0S_Pos              (27UL)         /*!< CLP0S (Bit 27)                                        */
 #define R_MIPI_DSI_FERRSR_CLP0S_Msk              (0x8000000UL)  /*!< CLP0S (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_FERRSR_CLP1S_Pos              (28UL)         /*!< CLP1S (Bit 28)                                        */
 #define R_MIPI_DSI_FERRSR_CLP1S_Msk              (0x10000000UL) /*!< CLP1S (Bitfield-Mask: 0x01)                           */
/* ========================================================  FERRSCR  ======================================================== */
 #define R_MIPI_DSI_FERRSCR_HTXTO_Pos             (0UL)          /*!< HTXTO (Bit 0)                                         */
 #define R_MIPI_DSI_FERRSCR_HTXTO_Msk             (0x1UL)        /*!< HTXTO (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_FERRSCR_LRXHTO_Pos            (1UL)          /*!< LRXHTO (Bit 1)                                        */
 #define R_MIPI_DSI_FERRSCR_LRXHTO_Msk            (0x2UL)        /*!< LRXHTO (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_FERRSCR_TATO_Pos              (2UL)          /*!< TATO (Bit 2)                                          */
 #define R_MIPI_DSI_FERRSCR_TATO_Msk              (0x4UL)        /*!< TATO (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_FERRSCR_ESCENT_Pos            (16UL)         /*!< ESCENT (Bit 16)                                       */
 #define R_MIPI_DSI_FERRSCR_ESCENT_Msk            (0x10000UL)    /*!< ESCENT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_FERRSCR_SYNCESC_Pos           (17UL)         /*!< SYNCESC (Bit 17)                                      */
 #define R_MIPI_DSI_FERRSCR_SYNCESC_Msk           (0x20000UL)    /*!< SYNCESC (Bitfield-Mask: 0x01)                         */
