MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHECFC/mcu.h
 #define R_MIPI_DSI_FERRSCR_CTRL_Pos              (18UL)         /*!< CTRL (Bit 18)                                         */
 #define R_MIPI_DSI_FERRSCR_CTRL_Msk              (0x40000UL)    /*!< CTRL (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_FERRSCR_CLP0_Pos              (19UL)         /*!< CLP0 (Bit 19)                                         */
 #define R_MIPI_DSI_FERRSCR_CLP0_Msk              (0x80000UL)    /*!< CLP0 (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_FERRSCR_CLP1_Pos              (20UL)         /*!< CLP1 (Bit 20)                                         */
 #define R_MIPI_DSI_FERRSCR_CLP1_Msk              (0x100000UL)   /*!< CLP1 (Bitfield-Mask: 0x01)                            */
/* ========================================================  FERRIER  ======================================================== */
 #define R_MIPI_DSI_FERRIER_HTXTO_Pos             (0UL)          /*!< HTXTO (Bit 0)                                         */
 #define R_MIPI_DSI_FERRIER_HTXTO_Msk             (0x1UL)        /*!< HTXTO (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_FERRIER_LRXHTO_Pos            (1UL)          /*!< LRXHTO (Bit 1)                                        */
 #define R_MIPI_DSI_FERRIER_LRXHTO_Msk            (0x2UL)        /*!< LRXHTO (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_FERRIER_TATO_Pos              (2UL)          /*!< TATO (Bit 2)                                          */
 #define R_MIPI_DSI_FERRIER_TATO_Msk              (0x4UL)        /*!< TATO (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_FERRIER_ESCENT_Pos            (16UL)         /*!< ESCENT (Bit 16)                                       */
 #define R_MIPI_DSI_FERRIER_ESCENT_Msk            (0x10000UL)    /*!< ESCENT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_FERRIER_SYNCESC_Pos           (17UL)         /*!< SYNCESC (Bit 17)                                      */
 #define R_MIPI_DSI_FERRIER_SYNCESC_Msk           (0x20000UL)    /*!< SYNCESC (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_FERRIER_CTRL_Pos              (18UL)         /*!< CTRL (Bit 18)                                         */
 #define R_MIPI_DSI_FERRIER_CTRL_Msk              (0x40000UL)    /*!< CTRL (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_FERRIER_CLP0_Pos              (19UL)         /*!< CLP0 (Bit 19)                                         */
 #define R_MIPI_DSI_FERRIER_CLP0_Msk              (0x80000UL)    /*!< CLP0 (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_FERRIER_CLP1_Pos              (20UL)         /*!< CLP1 (Bit 20)                                         */
 #define R_MIPI_DSI_FERRIER_CLP1_Msk              (0x100000UL)   /*!< CLP1 (Bitfield-Mask: 0x01)                            */
/* ======================================================  CLSTPTSETR  ======================================================= */
 #define R_MIPI_DSI_CLSTPTSETR_CLKSTPT_Pos        (2UL)          /*!< CLKSTPT (Bit 2)                                       */
 #define R_MIPI_DSI_CLSTPTSETR_CLKSTPT_Msk        (0xffcUL)      /*!< CLKSTPT (Bitfield-Mask: 0x3ff)                        */
 #define R_MIPI_DSI_CLSTPTSETR_CLKBFHT_Pos        (16UL)         /*!< CLKBFHT (Bit 16)                                      */
 #define R_MIPI_DSI_CLSTPTSETR_CLKBFHT_Msk        (0xff0000UL)   /*!< CLKBFHT (Bitfield-Mask: 0xff)                         */
 #define R_MIPI_DSI_CLSTPTSETR_CLKKPT_Pos         (24UL)         /*!< CLKKPT (Bit 24)                                       */
 #define R_MIPI_DSI_CLSTPTSETR_CLKKPT_Msk         (0xff000000UL) /*!< CLKKPT (Bitfield-Mask: 0xff)                          */
/* ======================================================  LPTRNSTSETR  ====================================================== */
 #define R_MIPI_DSI_LPTRNSTSETR_GOLPBKT_Pos       (0UL)          /*!< GOLPBKT (Bit 0)                                       */
 #define R_MIPI_DSI_LPTRNSTSETR_GOLPBKT_Msk       (0x3ffUL)      /*!< GOLPBKT (Bitfield-Mask: 0x3ff)                        */
/* =========================================================  PLSR  ========================================================== */
 #define R_MIPI_DSI_PLSR_CLUAN_Pos                (0UL)          /*!< CLUAN (Bit 0)                                         */
 #define R_MIPI_DSI_PLSR_CLUAN_Msk                (0x1UL)        /*!< CLUAN (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_PLSR_CLSTP_Pos                (1UL)          /*!< CLSTP (Bit 1)                                         */
 #define R_MIPI_DSI_PLSR_CLSTP_Msk                (0x2UL)        /*!< CLSTP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_PLSR_DL0RLE_Pos               (2UL)          /*!< DL0RLE (Bit 2)                                        */
 #define R_MIPI_DSI_PLSR_DL0RLE_Msk               (0x4UL)        /*!< DL0RLE (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_PLSR_DL0RUE_Pos               (3UL)          /*!< DL0RUE (Bit 3)                                        */
 #define R_MIPI_DSI_PLSR_DL0RUE_Msk               (0x8UL)        /*!< DL0RUE (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_PLSR_DL0UAN_Pos               (4UL)          /*!< DL0UAN (Bit 4)                                        */
 #define R_MIPI_DSI_PLSR_DL0UAN_Msk               (0x10UL)       /*!< DL0UAN (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_PLSR_DL1UAN_Pos               (5UL)          /*!< DL1UAN (Bit 5)                                        */
 #define R_MIPI_DSI_PLSR_DL1UAN_Msk               (0x20UL)       /*!< DL1UAN (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_PLSR_DL0STP_Pos               (8UL)          /*!< DL0STP (Bit 8)                                        */
 #define R_MIPI_DSI_PLSR_DL0STP_Msk               (0x100UL)      /*!< DL0STP (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_PLSR_DL1STP_Pos               (9UL)          /*!< DL1STP (Bit 9)                                        */
 #define R_MIPI_DSI_PLSR_DL1STP_Msk               (0x200UL)      /*!< DL1STP (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_PLSR_DL0RX2TX_Pos             (12UL)         /*!< DL0RX2TX (Bit 12)                                     */
 #define R_MIPI_DSI_PLSR_DL0RX2TX_Msk             (0x1000UL)     /*!< DL0RX2TX (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLSR_DL0TX2RX_Pos             (13UL)         /*!< DL0TX2RX (Bit 13)                                     */
 #define R_MIPI_DSI_PLSR_DL0TX2RX_Msk             (0x2000UL)     /*!< DL0TX2RX (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLSR_DL0DIR_Pos               (15UL)         /*!< DL0DIR (Bit 15)                                       */
 #define R_MIPI_DSI_PLSR_DL0DIR_Msk               (0x8000UL)     /*!< DL0DIR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_PLSR_CLULPENT_Pos             (24UL)         /*!< CLULPENT (Bit 24)                                     */
 #define R_MIPI_DSI_PLSR_CLULPENT_Msk             (0x1000000UL)  /*!< CLULPENT (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLSR_CLULPEXT_Pos             (25UL)         /*!< CLULPEXT (Bit 25)                                     */
 #define R_MIPI_DSI_PLSR_CLULPEXT_Msk             (0x2000000UL)  /*!< CLULPEXT (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLSR_CLLP2HS_Pos              (26UL)         /*!< CLLP2HS (Bit 26)                                      */
 #define R_MIPI_DSI_PLSR_CLLP2HS_Msk              (0x4000000UL)  /*!< CLLP2HS (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_PLSR_CLHS2LP_Pos              (27UL)         /*!< CLHS2LP (Bit 27)                                      */
 #define R_MIPI_DSI_PLSR_CLHS2LP_Msk              (0x8000000UL)  /*!< CLHS2LP (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_PLSR_DLULPENT_Pos             (28UL)         /*!< DLULPENT (Bit 28)                                     */
 #define R_MIPI_DSI_PLSR_DLULPENT_Msk             (0x10000000UL) /*!< DLULPENT (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLSR_DLULPEXT_Pos             (29UL)         /*!< DLULPEXT (Bit 29)                                     */
 #define R_MIPI_DSI_PLSR_DLULPEXT_Msk             (0x20000000UL) /*!< DLULPEXT (Bitfield-Mask: 0x01)                        */
/* =========================================================  PLSCR  ========================================================= */
 #define R_MIPI_DSI_PLSCR_DL0RX2TX_Pos            (12UL)         /*!< DL0RX2TX (Bit 12)                                     */
 #define R_MIPI_DSI_PLSCR_DL0RX2TX_Msk            (0x1000UL)     /*!< DL0RX2TX (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLSCR_DL0TX2RX_Pos            (13UL)         /*!< DL0TX2RX (Bit 13)                                     */
 #define R_MIPI_DSI_PLSCR_DL0TX2RX_Msk            (0x2000UL)     /*!< DL0TX2RX (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLSCR_CLULPENT_Pos            (24UL)         /*!< CLULPENT (Bit 24)                                     */
 #define R_MIPI_DSI_PLSCR_CLULPENT_Msk            (0x1000000UL)  /*!< CLULPENT (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLSCR_CLULPEXT_Pos            (25UL)         /*!< CLULPEXT (Bit 25)                                     */
 #define R_MIPI_DSI_PLSCR_CLULPEXT_Msk            (0x2000000UL)  /*!< CLULPEXT (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLSCR_CLLP2HS_Pos             (26UL)         /*!< CLLP2HS (Bit 26)                                      */
 #define R_MIPI_DSI_PLSCR_CLLP2HS_Msk             (0x4000000UL)  /*!< CLLP2HS (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_PLSCR_CLHS2LP_Pos             (27UL)         /*!< CLHS2LP (Bit 27)                                      */
 #define R_MIPI_DSI_PLSCR_CLHS2LP_Msk             (0x8000000UL)  /*!< CLHS2LP (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_PLSCR_DLULPENT_Pos            (28UL)         /*!< DLULPENT (Bit 28)                                     */
 #define R_MIPI_DSI_PLSCR_DLULPENT_Msk            (0x10000000UL) /*!< DLULPENT (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLSCR_DLULPEXT_Pos            (29UL)         /*!< DLULPEXT (Bit 29)                                     */
 #define R_MIPI_DSI_PLSCR_DLULPEXT_Msk            (0x20000000UL) /*!< DLULPEXT (Bitfield-Mask: 0x01)                        */
/* =========================================================  PLIER  ========================================================= */
 #define R_MIPI_DSI_PLIER_DL0RX2TX_Pos            (12UL)         /*!< DL0RX2TX (Bit 12)                                     */
 #define R_MIPI_DSI_PLIER_DL0RX2TX_Msk            (0x1000UL)     /*!< DL0RX2TX (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLIER_DL0TX2RX_Pos            (13UL)         /*!< DL0TX2RX (Bit 13)                                     */
 #define R_MIPI_DSI_PLIER_DL0TX2RX_Msk            (0x2000UL)     /*!< DL0TX2RX (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLIER_CLULPENT_Pos            (24UL)         /*!< CLULPENT (Bit 24)                                     */
 #define R_MIPI_DSI_PLIER_CLULPENT_Msk            (0x1000000UL)  /*!< CLULPENT (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLIER_CLULPEXT_Pos            (25UL)         /*!< CLULPEXT (Bit 25)                                     */
 #define R_MIPI_DSI_PLIER_CLULPEXT_Msk            (0x2000000UL)  /*!< CLULPEXT (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLIER_CLLP2HS_Pos             (26UL)         /*!< CLLP2HS (Bit 26)                                      */
 #define R_MIPI_DSI_PLIER_CLLP2HS_Msk             (0x4000000UL)  /*!< CLLP2HS (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_PLIER_CLHS2LP_Pos             (27UL)         /*!< CLHS2LP (Bit 27)                                      */
 #define R_MIPI_DSI_PLIER_CLHS2LP_Msk             (0x8000000UL)  /*!< CLHS2LP (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_PLIER_DLULPENT_Pos            (28UL)         /*!< DLULPENT (Bit 28)                                     */
 #define R_MIPI_DSI_PLIER_DLULPENT_Msk            (0x10000000UL) /*!< DLULPENT (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_PLIER_DLULPEXT_Pos            (29UL)         /*!< DLULPEXT (Bit 29)                                     */
 #define R_MIPI_DSI_PLIER_DLULPEXT_Msk            (0x20000000UL) /*!< DLULPEXT (Bitfield-Mask: 0x01)                        */
/* ========================================================  VMSET0R  ======================================================== */
 #define R_MIPI_DSI_VMSET0R_VSTART_Pos            (0UL)          /*!< VSTART (Bit 0)                                        */
 #define R_MIPI_DSI_VMSET0R_VSTART_Msk            (0x1UL)        /*!< VSTART (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_VMSET0R_VSTOP_Pos             (1UL)          /*!< VSTOP (Bit 1)                                         */
 #define R_MIPI_DSI_VMSET0R_VSTOP_Msk             (0x2UL)        /*!< VSTOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_VMSET0R_HSANOLP_Pos           (8UL)          /*!< HSANOLP (Bit 8)                                       */
 #define R_MIPI_DSI_VMSET0R_HSANOLP_Msk           (0x100UL)      /*!< HSANOLP (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_VMSET0R_HBPNOLP_Pos           (9UL)          /*!< HBPNOLP (Bit 9)                                       */
 #define R_MIPI_DSI_VMSET0R_HBPNOLP_Msk           (0x200UL)      /*!< HBPNOLP (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_VMSET0R_HFPNOLP_Pos           (10UL)         /*!< HFPNOLP (Bit 10)                                      */
 #define R_MIPI_DSI_VMSET0R_HFPNOLP_Msk           (0x400UL)      /*!< HFPNOLP (Bitfield-Mask: 0x01)                         */
/* ========================================================  VMSET1R  ======================================================== */
 #define R_MIPI_DSI_VMSET1R_DLY_Pos               (2UL)          /*!< DLY (Bit 2)                                           */
 #define R_MIPI_DSI_VMSET1R_DLY_Msk               (0x3ffcUL)     /*!< DLY (Bitfield-Mask: 0xfff)                            */
/* =========================================================  VMSR  ========================================================== */
 #define R_MIPI_DSI_VMSR_START_Pos                (0UL)          /*!< START (Bit 0)                                         */
 #define R_MIPI_DSI_VMSR_START_Msk                (0x1UL)        /*!< START (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_VMSR_STOP_Pos                 (1UL)          /*!< STOP (Bit 1)                                          */
 #define R_MIPI_DSI_VMSR_STOP_Msk                 (0x2UL)        /*!< STOP (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_VMSR_RUNNING_Pos              (2UL)          /*!< RUNNING (Bit 2)                                       */
 #define R_MIPI_DSI_VMSR_RUNNING_Msk              (0x4UL)        /*!< RUNNING (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_VMSR_VIRDY_Pos                (3UL)          /*!< VIRDY (Bit 3)                                         */
 #define R_MIPI_DSI_VMSR_VIRDY_Msk                (0x8UL)        /*!< VIRDY (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_VMSR_TIMERR_Pos               (20UL)         /*!< TIMERR (Bit 20)                                       */
 #define R_MIPI_DSI_VMSR_TIMERR_Msk               (0x100000UL)   /*!< TIMERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_VMSR_VBUFUDF_Pos              (22UL)         /*!< VBUFUDF (Bit 22)                                      */
 #define R_MIPI_DSI_VMSR_VBUFUDF_Msk              (0x400000UL)   /*!< VBUFUDF (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_VMSR_VBUFOVF_Pos              (23UL)         /*!< VBUFOVF (Bit 23)                                      */
 #define R_MIPI_DSI_VMSR_VBUFOVF_Msk              (0x800000UL)   /*!< VBUFOVF (Bitfield-Mask: 0x01)                         */
/* =========================================================  VMSCR  ========================================================= */
 #define R_MIPI_DSI_VMSCR_START_Pos               (0UL)          /*!< START (Bit 0)                                         */
 #define R_MIPI_DSI_VMSCR_START_Msk               (0x1UL)        /*!< START (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_VMSCR_STOP_Pos                (1UL)          /*!< STOP (Bit 1)                                          */
 #define R_MIPI_DSI_VMSCR_STOP_Msk                (0x2UL)        /*!< STOP (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_VMSCR_VIRDY_Pos               (3UL)          /*!< VIRDY (Bit 3)                                         */
 #define R_MIPI_DSI_VMSCR_VIRDY_Msk               (0x8UL)        /*!< VIRDY (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_VMSCR_TIMERR_Pos              (20UL)         /*!< TIMERR (Bit 20)                                       */
 #define R_MIPI_DSI_VMSCR_TIMERR_Msk              (0x100000UL)   /*!< TIMERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_VMSCR_VBUFUDF_Pos             (22UL)         /*!< VBUFUDF (Bit 22)                                      */
 #define R_MIPI_DSI_VMSCR_VBUFUDF_Msk             (0x400000UL)   /*!< VBUFUDF (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_VMSCR_VBUFOVF_Pos             (23UL)         /*!< VBUFOVF (Bit 23)                                      */
 #define R_MIPI_DSI_VMSCR_VBUFOVF_Msk             (0x800000UL)   /*!< VBUFOVF (Bitfield-Mask: 0x01)                         */
/* =========================================================  VMIER  ========================================================= */
 #define R_MIPI_DSI_VMIER_START_Pos               (0UL)          /*!< START (Bit 0)                                         */
 #define R_MIPI_DSI_VMIER_START_Msk               (0x1UL)        /*!< START (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_VMIER_STOP_Pos                (1UL)          /*!< STOP (Bit 1)                                          */
 #define R_MIPI_DSI_VMIER_STOP_Msk                (0x2UL)        /*!< STOP (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_VMIER_VIRDY_Pos               (3UL)          /*!< VIRDY (Bit 3)                                         */
 #define R_MIPI_DSI_VMIER_VIRDY_Msk               (0x8UL)        /*!< VIRDY (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_VMIER_TIMERR_Pos              (20UL)         /*!< TIMERR (Bit 20)                                       */
 #define R_MIPI_DSI_VMIER_TIMERR_Msk              (0x100000UL)   /*!< TIMERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_VMIER_VBUFUDF_Pos             (22UL)         /*!< VBUFUDF (Bit 22)                                      */
 #define R_MIPI_DSI_VMIER_VBUFUDF_Msk             (0x400000UL)   /*!< VBUFUDF (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_VMIER_VBUFOVF_Pos             (23UL)         /*!< VBUFOVF (Bit 23)                                      */
 #define R_MIPI_DSI_VMIER_VBUFOVF_Msk             (0x800000UL)   /*!< VBUFOVF (Bitfield-Mask: 0x01)                         */
/* =======================================================  VMPPSETR  ======================================================== */
 #define R_MIPI_DSI_VMPPSETR_TXESYNC_Pos          (15UL)         /*!< TXESYNC (Bit 15)                                      */
 #define R_MIPI_DSI_VMPPSETR_TXESYNC_Msk          (0x8000UL)     /*!< TXESYNC (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_VMPPSETR_DT_Pos               (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_VMPPSETR_DT_Msk               (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_VMPPSETR_VC_Pos               (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_VMPPSETR_VC_Msk               (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
/* =======================================================  VMVSSETR  ======================================================== */
 #define R_MIPI_DSI_VMVSSETR_VSA_Pos              (0UL)          /*!< VSA (Bit 0)                                           */
 #define R_MIPI_DSI_VMVSSETR_VSA_Msk              (0xfffUL)      /*!< VSA (Bitfield-Mask: 0xfff)                            */
 #define R_MIPI_DSI_VMVSSETR_VSPOL_Pos            (15UL)         /*!< VSPOL (Bit 15)                                        */
 #define R_MIPI_DSI_VMVSSETR_VSPOL_Msk            (0x8000UL)     /*!< VSPOL (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_VMVSSETR_VACT_Pos             (16UL)         /*!< VACT (Bit 16)                                         */
 #define R_MIPI_DSI_VMVSSETR_VACT_Msk             (0x7fff0000UL) /*!< VACT (Bitfield-Mask: 0x7fff)                          */
/* =======================================================  VMVPSETR  ======================================================== */
 #define R_MIPI_DSI_VMVPSETR_VBP_Pos              (0UL)          /*!< VBP (Bit 0)                                           */
 #define R_MIPI_DSI_VMVPSETR_VBP_Msk              (0x1fffUL)     /*!< VBP (Bitfield-Mask: 0x1fff)                           */
 #define R_MIPI_DSI_VMVPSETR_VFP_Pos              (16UL)         /*!< VFP (Bit 16)                                          */
 #define R_MIPI_DSI_VMVPSETR_VFP_Msk              (0x1fff0000UL) /*!< VFP (Bitfield-Mask: 0x1fff)                           */
/* =======================================================  VMHSSETR  ======================================================== */
 #define R_MIPI_DSI_VMHSSETR_HSA_Pos              (0UL)          /*!< HSA (Bit 0)                                           */
 #define R_MIPI_DSI_VMHSSETR_HSA_Msk              (0xfffUL)      /*!< HSA (Bitfield-Mask: 0xfff)                            */
 #define R_MIPI_DSI_VMHSSETR_HSPOL_Pos            (15UL)         /*!< HSPOL (Bit 15)                                        */
 #define R_MIPI_DSI_VMHSSETR_HSPOL_Msk            (0x8000UL)     /*!< HSPOL (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_VMHSSETR_HACT_Pos             (16UL)         /*!< HACT (Bit 16)                                         */
 #define R_MIPI_DSI_VMHSSETR_HACT_Msk             (0x7fff0000UL) /*!< HACT (Bitfield-Mask: 0x7fff)                          */
/* =======================================================  VMHPSETR  ======================================================== */
 #define R_MIPI_DSI_VMHPSETR_HBP_Pos              (0UL)          /*!< HBP (Bit 0)                                           */
 #define R_MIPI_DSI_VMHPSETR_HBP_Msk              (0x1fffUL)     /*!< HBP (Bitfield-Mask: 0x1fff)                           */
 #define R_MIPI_DSI_VMHPSETR_HFP_Pos              (16UL)         /*!< HFP (Bit 16)                                          */
 #define R_MIPI_DSI_VMHPSETR_HFP_Msk              (0x1fff0000UL) /*!< HFP (Bitfield-Mask: 0x1fff)                           */
