MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHECFC/mcu.h
/* ======================================================  SQCH0SET0R  ======================================================= */
 #define R_MIPI_DSI_SQCH0SET0R_START_Pos          (0UL)          /*!< START (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0SET0R_START_Msk          (0x1UL)        /*!< START (Bitfield-Mask: 0x01)                           */
/* ========================================================  SQCH0SR  ======================================================== */
 #define R_MIPI_DSI_SQCH0SR_RUNNING_Pos           (2UL)          /*!< RUNNING (Bit 2)                                       */
 #define R_MIPI_DSI_SQCH0SR_RUNNING_Msk           (0x4UL)        /*!< RUNNING (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0SR_AACTFIN_Pos           (4UL)          /*!< AACTFIN (Bit 4)                                       */
 #define R_MIPI_DSI_SQCH0SR_AACTFIN_Msk           (0x10UL)       /*!< AACTFIN (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0SR_ADESFIN_Pos           (8UL)          /*!< ADESFIN (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH0SR_ADESFIN_Msk           (0x100UL)      /*!< ADESFIN (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0SR_DABORT_Pos            (16UL)         /*!< DABORT (Bit 16)                                       */
 #define R_MIPI_DSI_SQCH0SR_DABORT_Msk            (0x10000UL)    /*!< DABORT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0SR_SIZEERR_Pos           (19UL)         /*!< SIZEERR (Bit 19)                                      */
 #define R_MIPI_DSI_SQCH0SR_SIZEERR_Msk           (0x80000UL)    /*!< SIZEERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0SR_TXIBERR_Pos           (24UL)         /*!< TXIBERR (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH0SR_TXIBERR_Msk           (0x1000000UL)  /*!< TXIBERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0SR_RXFERR_Pos            (26UL)         /*!< RXFERR (Bit 26)                                       */
 #define R_MIPI_DSI_SQCH0SR_RXFERR_Msk            (0x4000000UL)  /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0SR_RXFAIL_Pos            (27UL)         /*!< RXFAIL (Bit 27)                                       */
 #define R_MIPI_DSI_SQCH0SR_RXFAIL_Msk            (0x8000000UL)  /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0SR_RXPFAIL_Pos           (28UL)         /*!< RXPFAIL (Bit 28)                                      */
 #define R_MIPI_DSI_SQCH0SR_RXPFAIL_Msk           (0x10000000UL) /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0SR_RXCORERR_Pos          (29UL)         /*!< RXCORERR (Bit 29)                                     */
 #define R_MIPI_DSI_SQCH0SR_RXCORERR_Msk          (0x20000000UL) /*!< RXCORERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_SQCH0SR_RXAKE_Pos             (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_MIPI_DSI_SQCH0SR_RXAKE_Msk             (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
/* =======================================================  SQCH0SCR  ======================================================== */
 #define R_MIPI_DSI_SQCH0SCR_AACTFIN_Pos          (4UL)          /*!< AACTFIN (Bit 4)                                       */
 #define R_MIPI_DSI_SQCH0SCR_AACTFIN_Msk          (0x10UL)       /*!< AACTFIN (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0SCR_ADESFIN_Pos          (8UL)          /*!< ADESFIN (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH0SCR_ADESFIN_Msk          (0x100UL)      /*!< ADESFIN (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0SCR_DABORT_Pos           (16UL)         /*!< DABORT (Bit 16)                                       */
 #define R_MIPI_DSI_SQCH0SCR_DABORT_Msk           (0x10000UL)    /*!< DABORT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0SCR_SIZEERR_Pos          (19UL)         /*!< SIZEERR (Bit 19)                                      */
 #define R_MIPI_DSI_SQCH0SCR_SIZEERR_Msk          (0x80000UL)    /*!< SIZEERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0SCR_TXIBERR_Pos          (24UL)         /*!< TXIBERR (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH0SCR_TXIBERR_Msk          (0x1000000UL)  /*!< TXIBERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0SCR_RXFERR_Pos           (26UL)         /*!< RXFERR (Bit 26)                                       */
 #define R_MIPI_DSI_SQCH0SCR_RXFERR_Msk           (0x4000000UL)  /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0SCR_RXFAIL_Pos           (27UL)         /*!< RXFAIL (Bit 27)                                       */
 #define R_MIPI_DSI_SQCH0SCR_RXFAIL_Msk           (0x8000000UL)  /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0SCR_RXPFAIL_Pos          (28UL)         /*!< RXPFAIL (Bit 28)                                      */
 #define R_MIPI_DSI_SQCH0SCR_RXPFAIL_Msk          (0x10000000UL) /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0SCR_RXCORERR_Pos         (29UL)         /*!< RXCORERR (Bit 29)                                     */
 #define R_MIPI_DSI_SQCH0SCR_RXCORERR_Msk         (0x20000000UL) /*!< RXCORERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_SQCH0SCR_RXAKE_Pos            (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_MIPI_DSI_SQCH0SCR_RXAKE_Msk            (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
/* =======================================================  SQCH0IER  ======================================================== */
 #define R_MIPI_DSI_SQCH0IER_AACTFIN_Pos          (4UL)          /*!< AACTFIN (Bit 4)                                       */
 #define R_MIPI_DSI_SQCH0IER_AACTFIN_Msk          (0x10UL)       /*!< AACTFIN (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0IER_ADESFIN_Pos          (8UL)          /*!< ADESFIN (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH0IER_ADESFIN_Msk          (0x100UL)      /*!< ADESFIN (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0IER_DABORT_Pos           (16UL)         /*!< DABORT (Bit 16)                                       */
 #define R_MIPI_DSI_SQCH0IER_DABORT_Msk           (0x10000UL)    /*!< DABORT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0IER_SIZEERR_Pos          (19UL)         /*!< SIZEERR (Bit 19)                                      */
 #define R_MIPI_DSI_SQCH0IER_SIZEERR_Msk          (0x80000UL)    /*!< SIZEERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0IER_TXIBERR_Pos          (24UL)         /*!< TXIBERR (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH0IER_TXIBERR_Msk          (0x1000000UL)  /*!< TXIBERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0IER_RXFERR_Pos           (26UL)         /*!< RXFERR (Bit 26)                                       */
 #define R_MIPI_DSI_SQCH0IER_RXFERR_Msk           (0x4000000UL)  /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0IER_RXFAIL_Pos           (27UL)         /*!< RXFAIL (Bit 27)                                       */
 #define R_MIPI_DSI_SQCH0IER_RXFAIL_Msk           (0x8000000UL)  /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0IER_RXPFAIL_Pos          (28UL)         /*!< RXPFAIL (Bit 28)                                      */
 #define R_MIPI_DSI_SQCH0IER_RXPFAIL_Msk          (0x10000000UL) /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH0IER_RXCORERR_Pos         (29UL)         /*!< RXCORERR (Bit 29)                                     */
 #define R_MIPI_DSI_SQCH0IER_RXCORERR_Msk         (0x20000000UL) /*!< RXCORERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_SQCH0IER_RXAKE_Pos            (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_MIPI_DSI_SQCH0IER_RXAKE_Msk            (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
/* ======================================================  SQCH1SET0R  ======================================================= */
 #define R_MIPI_DSI_SQCH1SET0R_START_Pos          (0UL)          /*!< START (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1SET0R_START_Msk          (0x1UL)        /*!< START (Bitfield-Mask: 0x01)                           */
/* ========================================================  SQCH1SR  ======================================================== */
 #define R_MIPI_DSI_SQCH1SR_RUNNING_Pos           (2UL)          /*!< RUNNING (Bit 2)                                       */
 #define R_MIPI_DSI_SQCH1SR_RUNNING_Msk           (0x4UL)        /*!< RUNNING (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1SR_AACTFIN_Pos           (4UL)          /*!< AACTFIN (Bit 4)                                       */
 #define R_MIPI_DSI_SQCH1SR_AACTFIN_Msk           (0x10UL)       /*!< AACTFIN (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1SR_ADESFIN_Pos           (8UL)          /*!< ADESFIN (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH1SR_ADESFIN_Msk           (0x100UL)      /*!< ADESFIN (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1SR_DABORT_Pos            (16UL)         /*!< DABORT (Bit 16)                                       */
 #define R_MIPI_DSI_SQCH1SR_DABORT_Msk            (0x10000UL)    /*!< DABORT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1SR_SIZEERR_Pos           (19UL)         /*!< SIZEERR (Bit 19)                                      */
 #define R_MIPI_DSI_SQCH1SR_SIZEERR_Msk           (0x80000UL)    /*!< SIZEERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1SR_TXIBERR_Pos           (24UL)         /*!< TXIBERR (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH1SR_TXIBERR_Msk           (0x1000000UL)  /*!< TXIBERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1SR_RXFERR_Pos            (26UL)         /*!< RXFERR (Bit 26)                                       */
 #define R_MIPI_DSI_SQCH1SR_RXFERR_Msk            (0x4000000UL)  /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1SR_RXFAIL_Pos            (27UL)         /*!< RXFAIL (Bit 27)                                       */
 #define R_MIPI_DSI_SQCH1SR_RXFAIL_Msk            (0x8000000UL)  /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1SR_RXPFAIL_Pos           (28UL)         /*!< RXPFAIL (Bit 28)                                      */
 #define R_MIPI_DSI_SQCH1SR_RXPFAIL_Msk           (0x10000000UL) /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1SR_RXCORERR_Pos          (29UL)         /*!< RXCORERR (Bit 29)                                     */
 #define R_MIPI_DSI_SQCH1SR_RXCORERR_Msk          (0x20000000UL) /*!< RXCORERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_SQCH1SR_RXAKE_Pos             (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_MIPI_DSI_SQCH1SR_RXAKE_Msk             (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
/* =======================================================  SQCH1SCR  ======================================================== */
 #define R_MIPI_DSI_SQCH1SCR_AACTFIN_Pos          (4UL)          /*!< AACTFIN (Bit 4)                                       */
 #define R_MIPI_DSI_SQCH1SCR_AACTFIN_Msk          (0x10UL)       /*!< AACTFIN (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1SCR_ADESFIN_Pos          (8UL)          /*!< ADESFIN (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH1SCR_ADESFIN_Msk          (0x100UL)      /*!< ADESFIN (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1SCR_DABORT_Pos           (16UL)         /*!< DABORT (Bit 16)                                       */
 #define R_MIPI_DSI_SQCH1SCR_DABORT_Msk           (0x10000UL)    /*!< DABORT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1SCR_SIZEERR_Pos          (19UL)         /*!< SIZEERR (Bit 19)                                      */
 #define R_MIPI_DSI_SQCH1SCR_SIZEERR_Msk          (0x80000UL)    /*!< SIZEERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1SCR_TXIBERR_Pos          (24UL)         /*!< TXIBERR (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH1SCR_TXIBERR_Msk          (0x1000000UL)  /*!< TXIBERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1SCR_RXFERR_Pos           (26UL)         /*!< RXFERR (Bit 26)                                       */
 #define R_MIPI_DSI_SQCH1SCR_RXFERR_Msk           (0x4000000UL)  /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1SCR_RXFAIL_Pos           (27UL)         /*!< RXFAIL (Bit 27)                                       */
 #define R_MIPI_DSI_SQCH1SCR_RXFAIL_Msk           (0x8000000UL)  /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1SCR_RXPFAIL_Pos          (28UL)         /*!< RXPFAIL (Bit 28)                                      */
 #define R_MIPI_DSI_SQCH1SCR_RXPFAIL_Msk          (0x10000000UL) /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1SCR_RXCORERR_Pos         (29UL)         /*!< RXCORERR (Bit 29)                                     */
 #define R_MIPI_DSI_SQCH1SCR_RXCORERR_Msk         (0x20000000UL) /*!< RXCORERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_SQCH1SCR_RXAKE_Pos            (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_MIPI_DSI_SQCH1SCR_RXAKE_Msk            (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
/* =======================================================  SQCH1IER  ======================================================== */
 #define R_MIPI_DSI_SQCH1IER_AACTFIN_Pos          (4UL)          /*!< AACTFIN (Bit 4)                                       */
 #define R_MIPI_DSI_SQCH1IER_AACTFIN_Msk          (0x10UL)       /*!< AACTFIN (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1IER_ADESFIN_Pos          (8UL)          /*!< ADESFIN (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH1IER_ADESFIN_Msk          (0x100UL)      /*!< ADESFIN (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1IER_DABORT_Pos           (16UL)         /*!< DABORT (Bit 16)                                       */
 #define R_MIPI_DSI_SQCH1IER_DABORT_Msk           (0x10000UL)    /*!< DABORT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1IER_SIZEERR_Pos          (19UL)         /*!< SIZEERR (Bit 19)                                      */
 #define R_MIPI_DSI_SQCH1IER_SIZEERR_Msk          (0x80000UL)    /*!< SIZEERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1IER_TXIBERR_Pos          (24UL)         /*!< TXIBERR (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH1IER_TXIBERR_Msk          (0x1000000UL)  /*!< TXIBERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1IER_RXFERR_Pos           (26UL)         /*!< RXFERR (Bit 26)                                       */
 #define R_MIPI_DSI_SQCH1IER_RXFERR_Msk           (0x4000000UL)  /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1IER_RXFAIL_Pos           (27UL)         /*!< RXFAIL (Bit 27)                                       */
 #define R_MIPI_DSI_SQCH1IER_RXFAIL_Msk           (0x8000000UL)  /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1IER_RXPFAIL_Pos          (28UL)         /*!< RXPFAIL (Bit 28)                                      */
 #define R_MIPI_DSI_SQCH1IER_RXPFAIL_Msk          (0x10000000UL) /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_SQCH1IER_RXCORERR_Pos         (29UL)         /*!< RXCORERR (Bit 29)                                     */
 #define R_MIPI_DSI_SQCH1IER_RXCORERR_Msk         (0x20000000UL) /*!< RXCORERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_SQCH1IER_RXAKE_Pos            (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_MIPI_DSI_SQCH1IER_RXAKE_Msk            (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
/* ======================================================  SQCH0DSC0AR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC0AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC0AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC0AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC0AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC0AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH0DSC0AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC0AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH0DSC0AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC0AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH0DSC0AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC0AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH0DSC0AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC0AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH0DSC0AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC0AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH0DSC0AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC1AR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC1AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC1AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC1AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC1AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC1AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH0DSC1AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC1AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH0DSC1AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC1AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH0DSC1AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC1AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH0DSC1AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC1AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH0DSC1AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC1AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH0DSC1AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC2AR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC2AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC2AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC2AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC2AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC2AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH0DSC2AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC2AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH0DSC2AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC2AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH0DSC2AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC2AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH0DSC2AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC2AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH0DSC2AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC2AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH0DSC2AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC3AR  ====================================================== */
